{
  "page_1": [
    {
      "url": "https://www.realestate.com.au/international/us/1405-bonita-drive-knoxville-tn-110099042485/",
      "price": "AUD $623,964",
      "location": "1405 Bonita Drive, Knoxville, TN 37918",
      "description": "Welcome to your dream home! Nestled in the charming Fountain City neighborhood along the Dogwood Trail, this spacious ranch-style 4 bedroom and 3 bath home is perfect for those needing extra space As you step inside, you'll be greeted by original hardwood floors that flow throughout the home. The two separate living areas offer ample space for relaxation and entertaining, highlighted by a cozy wood-burning fireplace and original built-ins."
    },
    {
      "url": "https://www.realestate.com.au/international/us/4129-n-oketo-avenue-norridge-il-110099042484/",
      "price": "AUD $1,209,233",
      "location": "4129 N Oketo Avenue, Norridge, IL 60706",
      "description": "Fully Renovated 4-Bedroom Gem in the Heart of Norridge!    Welcome to this stunning, move-in-ready home located in one of Norridge's most sought-after neighborhoods! Thoughtfully updated from top to bottom, this spacious 4-bedroom, 3.5-bath residence offers modern living with timeless style.    Enjoy the comfort of an open-concept layout featuring gleaming hardwood floors throughout the main and upper levels. The beautifully designed kitchen boasts sleek stainless steel appliances, quartz countertops, and a generous walk-in pantry-perfectly complemented by a mudroom for added functionality.    Retreat to the finished basement, ideal for entertaining or creating a cozy family space, complete with its own full bathroom. Convenience abounds with brand-new washers and dryers on both the second floor and basement levels.    Every detail has been meticulously updated, including new electrical and water service, a tankless water heater, furnace, central air system, windows, doors, and a new roof-all permitted and approved by the Village of Norridge.    Step outside to a spacious composite deck overlooking a large backyard, perfect for hosting gatherings or simply relaxing outdoors. A detached 2-car garage adds to the practicality.    Located within walking distance to the local high school, shopping, restaurants, and entertainment. Plus, you're just 10 minutes from O'Hare Airport and 20 minutes to downtown Chicago!    Don't miss the chance to own this exceptional home in a vibrant, well-connected community. Schedule your tour today!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/45-lakepoint-dawsonville-ga-110099042483/",
      "price": "AUD $1,243,559",
      "location": "45 Lakepoint, Dawsonville, GA 30534",
      "description": "SUMMER WILL BE HERE BEFORE YOU KNOW IT!    Welcome to your lake retreat on the serene north end of Lake Lanier in Dawsonville! This beautifully renovated ranch-style home sits on a spacious 0.62-acre lot and comes complete with a single-slip party dock featuring a boat lift, ready for your adventures on the open waters. Step inside to discover a spacious family room offering stunning views of the private, wooded backyard, creating the serene ambiance of a secluded retreat; A charming kitchen with a circular dining area surrounded by windows, offering breathtaking views and natural light; A spacious master adorns an office with more spectacular views, and secondary bedrooms are designed for comfort and relaxation.  Step outside the kitchen to your screened in room to watch movies and football with family and friends. From there head to the outdoor deck for grilling or down to the private backyard with a fire pit - an entertainerCOs dream or your personal oasis under the stars.     Additional features include a workshop and storage area with exterior access in the basement/crawl space. The gradual slope down to the level walk to the dock makes lake access easy and enjoyable, whether you're planning a day of boating or simply soaking in the beauty of Lake Lanier in the sun. Just minutes to GA 400, North Georgia Premium Outlets and Dahlonega   Don't miss this rare opportunity to have your own slice of lake paradise ~ Schedule your showing today and make this stunning LAKE RETREAT your new home! ~  & Don't forget to watch the video!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/4201-brittany-trail-drive-champaign-il-110099042482/",
      "price": "AUD $936,024",
      "location": "4201 Brittany Trail Drive, Champaign, IL 61822",
      "description": "Welcome to this beautifully upgraded five-bedroom, three-bath home in the highly sought-after Trails at Brittany neighborhood. From the moment you arrive, you'll be captivated by the professional landscaping, charming wraparound front porch, and inviting curb appeal.    Step inside to discover a home designed for both comfort and sophistication. The spacious kitchen features rich maple cabinetry, ceramic tile flooring, stainless steel appliances, and a butler's pantry-perfect for entertaining or everyday convenience. The formal dining room impresses with a coffered ceiling, crown molding, and elegant chair rail detailing, adding a touch of refined character.    Ideal for multigenerational living or guest privacy, this home offers two luxurious primary suites-one on each level. The second-floor primary includes a generous sitting area, whirlpool tub, and an expansive walk-in closet.    Additional highlights include:    Full basement with roughed-in bathroom  In-ground sprinkler system  Thoughtful, low-maintenance landscaping  Located just a short walk to the acclaimed K-8 Countryside School  Convenient access to Unit 4 schools, Stevens Family YMCA, and neighborhood walking paths, ponds, and parks  This home offers the perfect blend of functionality, location, and timeless design. A must-see!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/2100-n-parkside-avenue-chicago-il-110099042480/",
      "price": "AUD $123,264",
      "location": "2100 N Parkside Avenue, Chicago, IL 60639",
      "description": "Grand Av and Central, Vacant Lot. Great development opportunity for builders and developers!!! Located in a very convenient area; public transportation, schools, shops and stores nearby. Excellent location."
    },
    {
      "url": "https://www.realestate.com.au/international/us/7609-fern-lula-ga-110099042479/",
      "price": "AUD $933,059",
      "location": "7609 Fern, Lula, GA 30554",
      "description": "Stunning ranch with an amazing front porch is situated on a great lot with NO HOA! Welcome guests through the gorgeous Craftsman double door entry and into your home featuring a wide open concept floor plan! A separate formal dining room to your left is perfect for your dinner parties while casual everyday meals will be held in the kitchen/family room combination.  Boasting a gorgeous stacked stone fireplace, built-ins and  views to your tranquil backyard the family room has a warm, cozy feel.  The kitchen is well equipped with stainless appliances, a large breakfast bar, granite and plenty of storage. This home also offers a half bath for convenience and large laundry room.  The Owner's suite is quite spacious with soaring ceilings, tons of natural light and a private entrance to the back patio area.  The en suite bathroom is a relaxing retreat from the hustle and bustle of everyday life! Two additional guest bedrooms plus another full bathroom round out the main leveling living area.  The bonus room on the second floor would make a great home office, craft area or media center. The expansive screened in back porch is where you will live all spring and summer avoiding the heat and the bugs but still enjoying the peacefulness that this property provides.  There is more than enough room for a pool or your gardens and with NO HOA, the possibilities are endless!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/2144-n-73rd-avenue-elmwood-park-il-110099042478/",
      "price": "AUD $429,083",
      "location": "2144 N 73rd Avenue, Elmwood Park, IL 60707",
      "description": "Multiple Offers Received- Best and Highest Due Monday April 28, by 9 AM. Welcome to this charming, spacious home offering comfort, character, and incredible versatility! Begin your tour on the welcoming front porch -an ideal spot to unwind and enjoy quiet moments. Inside, you'll discover a generously sized living and dining area with attractive laminate flooring, perfect for everyday living and entertaining. The kitchen features classic maple cabinetry(2003), laminate countertops, and a cozy eat-in area, ideal for casual meals. Step into the enclosed back porch - a peaceful retreat for your morning coffee or favorite book and enjoy summer gatherings on the well-maintained deck with a retractable awning. The primary bedroom includes a ceiling fan, two closets (one cedar-lined), and plenty of space. Two additional bedrooms offer laminate flooring, ceiling fans, and ample storage. The full bath includes an oak vanity and a tub/shower combination. You'll also find convenient walk-up access to the attic, providing abundant storage options. The partially finished basement extends your living space with a comfortable family room, a wet bar, laundry area, workshop, and even a partial kitchen with a stove, countertop, and freezer. Well-maintained over the years, this home includes a Trane furnace (2009), central air (2020), sump pump (2020), and a tear-off roof (2015, house only). Most main floor windows have been updated, concrete front steps were re-poured in 2019, and the home received electrical updates in 2025. An oversized two-car garage and fenced yard complete the package. This home is in good condition and offers incredible potential, but is sold AS-IS. 13-month HWA Warranty offered, too. Don't miss your chance to make it your own!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/3255-hall-dacula-ga-110099042477/",
      "price": "AUD $2,730,525",
      "location": "3255 Hall, Dacula, GA 30019",
      "description": "Under Construction: A Masterpiece in the Making! Step into unparalleled luxury with this drop-dead gorgeous new construction home, designed to impress at every turn. This 5-bedroom estate features two spectacular primary suites-one on the main level and one upstairs-each with expansive, dream-worthy walk-in closets, offering both style and functionality.  The chef's kitchen is a culinary dream, complete with a sprawling island, an oversized eat-in area, and a separate prep kitchen for effortless entertaining. Throughout the home, rich hardwood floors and exquisite trim work add timeless elegance.  An incredible media room provides the perfect space for movie nights and game-day celebrations, making this home as functional as it is stunning.   Work in peace from the private office, host memorable dinners in the grand 12+ seater dining room, and unwind in the sophisticated family room, where sliding doors open to a backyard retreat. Outside, a resort-style pool and hot tub create the ultimate space for relaxation and entertaining.  Every detail has been thoughtfully designed to offer a perfect blend of comfort, elegance, and grandeur."
    },
    {
      "url": "https://www.realestate.com.au/international/us/309-dundee-road-barrington-il-110099042476/",
      "price": "AUD $2,168,817",
      "location": "309 Dundee Road, Barrington, IL 60010",
      "description": "Welcome home to the prestigious and desirable community of Barrington Hills!  Your very own resort style living home nestled on 5 acres, this property will not disappoint.  As you pull up the long newly sealed asphalt driveway, you'll be left speechless once you set your eyes on this all brick home!  Once inside, you'll immediately notice the sundrenched foyer with porcelain patterned floor tile, cathedral ceilings with an elegant curved stairway and fresh paint throughout.  Continuing to the living room, you'll admire the refinished wood floors (2017), big windows, and recessed lighting.  An oversized office space can fit your executive desk, while taking a break to admire the view to the outside.  The formal dining room can fit any size table for large gatherings with a gorgeous chandelier, bay windows, crown molding and inlay border in the hardwood floor while the informal dining room is right off the kitchen, next to a fireplace and great view of the sunroom.  The chef style kitchen (2017) features plenty of cabinet space with crown molding, granite countertops and beautiful backsplash to match with stainless steel appliances.  The sunroom is surrounded by floor to ceiling windows, updated porcelain tile and the best seat in the house to wind down at the end of a long day with your favorite beverage or snack.  The impressive family room features cathedral ceilings with large windows and patio door leading to the patio and the remodeled double sided fireplace (2017) to the other side.  The second story is covered in the same refinished hardwood floors throughout.  On the West side of the house are two spacious bedrooms with an updated Jack and Jill bath (2017).  On the East side of the house you have the Princess Suite featuring a spacious bedroom and its own remodeled private bath with 2 showers (2021).  The oversized primary bedroom features crown molding, recessed lighting, updated private balcony (2023), spa-like bath suite with a jacuzzi tub with a fabulous view you'll never want to get out of, and a cedar closet big enough to be a bedroom!  Don't forget about the finished walkout basement with porcelain tile, space to add your own theatre set up, dry bar and area to lounge next to a 2nd fireplace.  The exterior has so much space you'll never have to leave.  The main patio/deck can fit as many people as you want for any gathering and you have as much land to do with as you please.  Add a pool, a gazebo, whatever you want!  Great location minutes from schools, shopping, dining, entertainment....all with plenty of privacy!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/245-w-moreno-buford-ga-110099042475/",
      "price": "AUD $1,131,218",
      "location": "245 W Moreno, Buford, GA 30518",
      "description": "Commercial Office Space in Downtown Buford, just one street south of Main Street. Located Behind the Buford Grill and steps away from Rico's World Kitchen; catty Conner to Main Street Blooms. Free standing multi-unit building with its own parking lot. Building consist of 4 units, each unit has independent entrances, electric meter and HVAC. The downstairs units A  Unit C is leased to Used Auto Broker, Unit B is leased to a Renovations Company. City of Buford has approved the construction of a side walk on West Moreno Street. Please consult with the City of Buford for more details on this project. Lots going on in this street, Moreno Street has a new 256 space parking deck, Meander Brewing on West Moreno -soon to open will be a great hangout spot, additionally on Moreno Street is Tchin Tchin Coffee."
    },
    {
      "url": "https://www.realestate.com.au/international/us/311-chambers-rome-ga-110099042474/",
      "price": "AUD $78,015",
      "location": "311 Chambers, Rome, GA 30161",
      "description": "."
    },
    {
      "url": "https://www.realestate.com.au/international/us/34-horizon-bay-road-rocky-mount-mo-110099042473/",
      "price": "AUD $389,919",
      "location": "34 Horizon Bay Road, Rocky Mount, MO 65072",
      "description": "Investment or an Escape to the Lake RETREAT! LAKEVIEW Home that is as CUTE as can be and MOVE IN Ready! Comes with six lots and just under an acre giving you so many possibilities. Room to build garage or another house/cabin. Blacktop all the way and conveniently located. It's CUTE, It's Cozy and BEST of ALL...Everything has been done!!! Very clean and within the last 4-5 years it's been updated with new roof, and HVAC system. 3 bedroom and 1.5 bath with tons of parking. You will love the bonus room for doing laundry and having an extra bath. Been dreaming of living the LAKE LIFE and not breaking the bank, this 2nd tier lakeview home is it!!!! Call today and schedule a tour!!!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/26w065-jerome-avenue-wheaton-il-110099042472/",
      "price": "AUD $561,708",
      "location": "26w065 Jerome Avenue, Wheaton, IL 60187",
      "description": "Charming 3-bedroom, 2-bath ranch home on large lot, just under a half acre with mature trees. Features include hardwood floors, screened-in porch, and a fully fenced yard-perfect for pets and outdoor living. The unfinished basement offers tons of potential for storage, a workshop, or added living space.  Unique separate entrance makes it ideal for a home office, studio, or small business. Quiet setting, yet close to schools, shopping, and major roads. Great opportunity to own a versatile home with space to grow! Roof, gutters and siding replaced in 2020. Bathroom updated in 2025"
    },
    {
      "url": "https://www.realestate.com.au/international/us/1727-s-indiana-avenue-chicago-il-110099042471/",
      "price": "AUD $444,686",
      "location": "1727 S Indiana Avenue, Chicago, IL 60616",
      "description": "Luxury finishes and amazing natural light! This expertly designed loft in the original Kodak film building features an updated kitchen with oversized island - made for entertaining. Custom-made bathroom highlights include heated floors, touch LED floating mirrors, terrazzo tile, imported Italian sinks, and walk in shower with two shower heads. Stunning open floorplan with 12 foot ceilings, lavish fireplace, and gorgeous city views. The original concrete floors have been polished and sealed. Located in the coveted South Loop Prairie District, blocks to the lake, parks, restaurants, shopping and transportation. Brand new wardrobe closet and automatic remote blinds - this is quality!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/15310-jackson-dr-homestead-fl-110099042470/",
      "price": "AUD $780,148",
      "location": "15310 Jackson Dr., Homestead, FL 33033",
      "description": "Cozy single-family home in the Leisure City Area in Homestead! This updated 3-bedroom / 1 bathroom is a perfect fit for any family to enjoy. Newly Screened in porch perfect for entertaining along with a nice size back yard! Very close to shopping plazas and restaurants."
    },
    {
      "url": "https://www.realestate.com.au/international/us/1126-shoreline-jefferson-ga-110099042469/",
      "price": "AUD $2,964,570",
      "location": "1126 Shoreline, Jefferson, GA 30549",
      "description": "Welcome to 1126 Shoreline Drive, Jefferson, GA - a distinguished lakefront estate where elegance and tranquility converge in one of the area's most coveted locations.  This exceptional 6-bedroom, 5.5-bathroom residence is set on a sprawling 8-acre property, offering commanding views of a private 65-acre lake, perfect for an active water sports lifestyle with slalom course, ski jump, and ample space for wake boarding, fishing, and more.  The home is an ideal sanctuary for those who seek both luxury and natural beauty, featuring a prestigious address within the highly regarded Jefferson City School District and easy access to Interstate 85.    Designed with impeccable attention to detail, the residence showcases an expansive gourmet kitchen, equipped with state-of-the-art stainless steel appliances, custom cabinetry, and a spacious island perfect for culinary enthusiasts. Every aspect of this home has been thoughtfully crafted, from the panoramic windows framing the serene lake vistas to the two screened porches that create a perfect environment for al fresco gatherings.    The master suite, located on the main level, offers a peaceful retreat with sweeping lake views and a luxurious oversized en-suite bath. The layout is ideal for multi-generational living, providing ample space throughout, including 6 car garage parking and an oversized climate-controlled workshop for added functionality. Outdoor recreation is at the forefront of this property, with a private dock featuring water, electricity, and a boat lift, along with an outdoor shower for convenient post-lake refreshment. Offered below appraised value for a prompt sale, this is a rare opportunity to acquire a one-of-a-kind lakefront estate that harmonizes sophisticated living with the beauty of nature. Your dream home at 1126 Shoreline Drive awaits."
    },
    {
      "url": "https://www.realestate.com.au/international/us/2041-olive-springs-marietta-ga-110099042468/",
      "price": "AUD $592,914",
      "location": "2041 Olive Springs, Marietta, GA 30060",
      "description": "Welcome to 2041 Olive Springs Road SE, Marietta, Georgia 30060Coa property that embodies the perfect blend of comfort, convenience, and community. Nestled in the heart of Marietta, this home offers an unparalleled living experience in one of Georgia's most cherished locales. This property consists in 3 full bedrooms and 2 full bathrooms with a lot of natural lighting, with an exception prime Location: Situated in the Olive Springs neighborhood, this property boasts a strategic location that caters to both tranquility and accessibility. Residents enjoy proximity to major highways like I-75, facilitating effortless commutes to Atlanta and surrounding areas. The nearby Smyrna Market Village and Marietta Square provide a plethora of dining, shopping, and entertainment options, ensuring that leisure and lifestyle needs are met with ease. Families will appreciate the top-tier educational institutions serving the area. Marietta City Schools is an International Baccalaureate World School district, offering comprehensive programs from elementary through high school. The district's commitment to academic excellence ensures that students receive a well-rounded and globally minded education.    For outdoor enthusiasts, the proximity to Kennesaw Mountain National Battlefield Park provides ample opportunities for hiking, picnicking, and exploring Civil War history. Additionally, Six Flags White Water offers family-friendly aquatic adventures just a short drive away.  2041 Olive Springs Road SE is more than just a property; it's an invitation to experience the best of Marietta living. With its prime location, vibrant community, excellent schools, abundant recreational options, economic vitality, and culinary richness, this home offers a lifestyle that is both fulfilling and engaging. Don't miss the opportunity to make this exceptional property your new home."
    },
    {
      "url": "https://www.realestate.com.au/international/us/1699-little-fox-dacula-ga-110099042467/",
      "price": "AUD $1,090,650",
      "location": "1699 Little Fox, Dacula, GA 30019",
      "description": "Amazing property for the sale.!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/1210-lancelot-court-loganville-ga-110099042466/",
      "price": "AUD $856,605",
      "location": "1210 Lancelot Court, Loganville, GA 30052",
      "description": "Come check out this beautiful 4 sides brick home on a basement in Cevera Lakes! This homes is spacious and features 3 bedrooms, 2.5 bathroom with a huge bonus room you can use for whatever you have in mind. Level driveway with a 2 car garage plus a second driveway to the basement that has a boat garage door there as well. Screened in porch plus an open deck for BBQing with level backyard that could be turned into a great hangout space for you and your guests. Large unfinished basement ready for your imagination! This one is solid and just needs your final touch from it's original style and has already been priced for those minimal updates! Schedule an appointment today to see this home before it's gone!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/67-franklin-royston-ga-110099042465/",
      "price": "AUD $741,143",
      "location": "67 Franklin, Royston, GA 30662",
      "description": "Beautiful LOG HOME nestled in the woods on approximately 22 acres is awaiting its new owner! The home was freshly painted on the outside and offers rustic log walls and wood beams on the inside. The home offers two bedrooms and one and half bathrooms, with plenty of room to expand. The land includes an oversized garage/workshop, with an unfinished area upstairs, separate shed with electricity and insulation, a small greenhouse or make it a space for the chickens! The property is located on Nails Creek for enjoying fishing and hunting. The possibilities are endless!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/2147-w-adams-street-chicago-il-110099042464/",
      "price": "AUD $1,090,650",
      "location": "2147 W Adams Street, Chicago, IL 60612",
      "description": "Discover an amazing opportunity to own this brand-new, beautifully designed 4-bedroom, 3-bathroom duplex in a unique 6-unit building in the heart of United Center and The 1901 project. This spacious duplex-down features an expansive living and dining area, perfect for entertaining. The living room is highlighted by huge floor-to-ceiling windows, flooding the space with natural light. The chef's kitchen boasts custom cabinetry, huge quartz countertops, and stainless steel appliances, making it both stylish and functional. The main level includes a large bedroom and full bathroom, while the lower level offers three additional bedrooms. This includes a luxurious primary suite with a walk-in closet and a spa-inspired bathroom, as well as two large bedrooms with spacious closets and an additional full bathroom. Enjoy private front entry access, a garage parking spot, and additional outdoor space with a roof deck above the garage-ideal for relaxing or entertaining. Don't miss this incredible home in a prime location! Schedule your private showing today. Estimated completion date May, 2025. Conveniently located near West Loop, Little Italy, United Center and Medical District. Easy access to Eisenhower Expressway / 290, Blue line El Train stop, Western Ave Metra Stop for MD-N, MD-W, & NCS, and CTA buses."
    },
    {
      "url": "https://www.realestate.com.au/international/us/446-nw-17th-ct-homestead-fl-110099042463/",
      "price": "AUD $1,014,193",
      "location": "446 NW 17th Ct, Homestead, FL 33030",
      "description": "Welcome home! This delightful 4-bedroom, 2-bathroom home offers the perfect blend of comfort and convenience, situated on an expansive 8,560 sq ft lot. Key Features include Spacious Living, Comfort, Ample Parking in the front of the property and on the side having enough space to park your boat and/or RV. This large lot provides ample outdoor space for gardening, play, or entertaining. Home comes with several fruit trees including mango, avocado, starfruit, longan & lychee. Located in a friendly neighborhood with easy access to local amenities, schools, and parks, this home is perfect for anyone looking for a serene yet convenient lifestyle. Don’t miss the chance to make this wonderful property your own!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/1537-e-maryville-loop-beeville-tx-110099042462/",
      "price": "AUD $407,082",
      "location": "1537 E Maryville Loop, Beeville, TX 78102",
      "description": ""
    },
    {
      "url": "https://www.realestate.com.au/international/us/52-scott-toccoa-ga-110099042461/",
      "price": "AUD $262,130",
      "location": "52 Scott, Toccoa, GA 30577",
      "description": "Discover the charm of this unique home located in the heart of Toccoa with an amazing distribution and well-illuminated. This delightful property features 2 bedrooms and 1bathrooms, with an amazing and great bonus room to adequate to the buyer's preference, making it ideal for families or as an excellent investment opportunity. Enjoy a spacious living area, thoughtfully designed details, and a peaceful neighborhood that feels like home. The buyer can rest assured since this property is moving ready, roofing, siding, walls, flooring, kitchen and bathroom cabinets, and appliances are BRAND NEW!! Perfectly situated near local shops, restaurants, and area attractions, this property blends comfort and style seamlessly!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/2668-bull-run-drive-aurora-il-110099042460/",
      "price": "AUD $850,364",
      "location": "2668 Bull Run Drive, Aurora, IL 60503",
      "description": "This extra-large floor plan with soaring ceilings offers unmatched space and style, perfect for entertaining and everyday living. The home features a spacious living room, a formal dining room with high-efficiency Edison bulbs, and a cozy family room-ideal for gatherings and relaxation. The kitchen boasts stainless steel appliances, granite countertops, an oversized island, and ample cabinet space, making it a chef's dream. Upstairs, a huge open loft is perfect for lounging or a home office, leading to an expansive master bedroom with a private en-suite, while the second floor also includes three additional bedrooms and two full bathrooms, all with walk-in closets, providing plenty of space for family and guests. Enjoy the convenience of an upstairs laundry room! The finished basement offers carpeted floors, a powder bath, and a hidden storage room for added functionality, making it perfect for a home gym, playroom, or media space. Step outside to an extra-deep backyard, perfect for summer BBQs and yard games on the paver patio. A three-car garage provides ample parking and storage. Recent upgrades include a new roof and siding (2019), new garage doors (2022), new A/C (2020), and newer mechanicals such as a sump pump (2022), ejector pit (2022), furnace (2019), and water heater (2018). Located in the Oswego School District, this home is close to restaurants, shopping, gyms, parks, and major highways for an easy commute. With its modern updates, spacious layout, and prime location, this home is truly move-in ready-don't miss this fantastic opportunity to make it yours!"
    }
  ],
  "page_2": [
    {
      "url": "https://www.realestate.com.au/international/us/6864-n-northwest-highway-chicago-il-110099042459/",
      "price": "AUD $294,897",
      "location": "6864 N Northwest Highway, Chicago, IL 60631",
      "description": "Convenient location in vibrant Edison Park just steps to the Metra, downtown Park Ridge, Starbucks and many fine restaurants! This 2-bedroom 1 bath condo on the main level has been very well-maintained by the same owner for 20 years.  The features I love most  as an agent are the nice open floor plan and the unbelievable closet space.  AC wall unit was replaced in 2023. The kitchen, bathroom and hallway was painted in 2022. Other updates although not super recent include faucets in the kitchen and bathroom, the thermostat, dining room light fixture and ceiling fans in both bedrooms.  The windows and sliding doors were replaced in 2014. The laundry facility and storage unit is located in the basement. This unit does NOT have an assigned parking space however there is plenty of parking on Northwest Highway or the street directly south past the alley near the train tracks. Per the seller, parking spots parallel to the train tracks can be rented via the Edison Park Chamber of Commerce for $40 per month. Buyer should confirm.  There are no rental restrictions and pets are welcome up to 50 pounds. There is a non refundable move-in/move-out fee of $250. Seller will need flexibility with close date in order to find a home."
    },
    {
      "url": "https://www.realestate.com.au/international/us/401-e-wabash-avenue-rantoul-il-110099042458/",
      "price": "AUD $171,633",
      "location": "401 E Wabash Avenue, Rantoul, IL 61866",
      "description": "Step into this charming 2-bedroom, 1-bath gem located directly across from Eater Middle School. Featuring a brand-new roof, new carpet, and fresh interior paint, this move-in-ready home is perfect for first-time buyers, small families, or investors. Enjoy a functional layout, plenty of natural light, and a prime location close to schools, parks, and local amenities. Don't miss this affordable opportunity-schedule your showing today!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/67-franklin-royston-ga-110099042457/",
      "price": "AUD $741,143",
      "location": "67 Franklin, Royston, GA 30662",
      "description": "Beautiful LOG HOME nestled in the woods on approximately 22 acres is awaiting its new owner! This home was freshly painted on the outside and offers the rustic log walls and wood beams on the inside. The home offers two bedrooms and one and half bathrooms, with plenty of room to expand. The land includes an oversized garage/workshop, with an unfinished area upstairs, separate shed with electricity and insulation, a small greenhouse and a space for the chickens! The property is located on Nails Creek for enjoying fishing and hunting. The possibilities are endless!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/230-brompton-lane-sugar-grove-il-110099042456/",
      "price": "AUD $522,701",
      "location": "230 Brompton Lane, Sugar Grove, IL 60554",
      "description": "Welcome to 230 Brompton Ln Unit B in Sugar Grove, a bright and inviting 3-bedroom, 2.5-bathroom home located in the peaceful Windsor Pointe neighborhood. As you step inside, you're greeted by high ceilings, rich hardwood floors, and a layout that feels both open and cozy. The living room features a warm fireplace and lots of natural light, while the formal dining room and kitchen-complete with stainless steel appliances, crown-molded cabinets, and a casual eating area-make everyday living and entertaining easy. Too many updates to list but some of the highlights would be new hardwood flooring, fresh powder room with new vanity/mirror and toilet, new water heater, new washer and dryer! Nothing to be done before moving right into one of the largest models in the neighborhood.    Upstairs, the spacious primary suite offers a vaulted ceiling, large walk-in closet, and a private bathroom with dual sinks, a soaking tub, and a separate shower. Two additional bedrooms include ceiling fans and generous closet space, while the convenient laundry room also functions as a mudroom with direct access to the two-car garage. Outside, a concrete patio overlooks open green space, and the corner unit location adds a sense of privacy along with easy access to extra parking. This home is in the highly rated 302 School District and just minutes from local shops, restaurants, parks, and recreation spots like Bliss Woods and Blackberry Farm. With quick access to Route 56, Route 47, and I-88, commuting is simple-whether you're heading to Aurora, Naperville, or downtown Chicago. It's a great blend of comfort, convenience, and community."
    },
    {
      "url": "https://www.realestate.com.au/international/us/0-shadowick-mountain-jasper-ga-110099042455/",
      "price": "AUD $15,603",
      "location": "0 Shadowick Mountain, Jasper, GA 30143",
      "description": "Bent Tree Community is roughly 60 minutes North of Atlanta in the heart of the Appalachian Mountains. This gated community has numerous amenties making this a true resort community for year round living.  Amenities include an 18 hole golf course, hiking trails, pools, pickleball and tennis courts. There is also a huge 100+acre lake and an equestrian center.    This particular parcel of land in a combined 2 lots with approximately .63 acres of land to build your dream home!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/17051-ne-35th-ave-north-miami-beach-fl-110099042454/",
      "price": "AUD $468,088",
      "location": "17051 NE 35th Ave, North Miami Beach, FL 33160",
      "description": "Discover this beautifully 2-bedroom, 2-bath apartment in the highly sought-after Eastern Shores neighborhood! This residence offers convenient boat access, perfect for water enthusiasts looking to enjoy South Florida’s coastal lifestyle. Located just minutes from the beach, Bal Harbour Shops, and Aventura Mall, it provides easy access to world-class shopping and dining. This great and surrounding area is both family-friendly and welcoming, with nearby parks, shopping centers, restaurants, and places of worship. Enjoy the best of community living in a vibrant and serene setting—Eastern Shores is the perfect place to call home!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/1224-n-green-street-mchenry-il-110099042453/",
      "price": "AUD $858,165",
      "location": "1224 N Green Street, McHenry, IL 60050",
      "description": "Prime Mixed-Use Building in Downtown McHenry - Ideal Investment Opportunity! Located in the heart of Downtown McHenry on sought-after Green Street, this remodeled (2020) mixed-use building offers an excellent investment opportunity with strong cash flow potential. Just steps from Riverwalk festivities, restaurants, and shops, this property is perfectly positioned for both residential and commercial tenants. The first-floor commercial space features new mechanicals, electrical, and a new roof, providing a modern and updated space for businesses-month to month lease. The second-floor residential unit is a spacious 1,600 sq. ft. apartment with 2 bedrooms and 1 bath, offering comfortable living with a huge backyard. . Residential lease up in June, option to go month-to-month. With low maintenance costs and great income potential, this property is perfect for investors or owner-occupants looking to generate passive income. Don't miss this chance to own a prime mixed-use property in a thriving location!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/127-tottenham-lane-elk-grove-village-il-110099042452/",
      "price": "AUD $819,158",
      "location": "127 Tottenham Lane, Elk Grove Village, IL 60007",
      "description": "This expanded 4 bedroom 2.5 bath home has recently been updated! Upon entering this home you are greeted with a split living room/ dining room both with wood floors.  Off the living room, there is a perfect size family room/den leading to a huge great room addition that features vaulted ceilings, wood burning fireplace, beams and an oversized slider that brings you to the outdoor patio. Kitchen has been completely updated with marble tile and granite countertops, all new custom cabinets and new appliances. Enjoy a breakfast counter seating area.  Laundry room right off the kitchen with entry into the garage and outdoor area. Large master bedroom has lots of closets with a vanity and private bathroom. 2 car oversized garage has 8x8 storage area/workroom with lots of storage cabinets. Back yard is very large with a nice size patio, and Lot is .38!! This location is everything! Close to shopping, restaurants, library, interstates and parks."
    },
    {
      "url": "https://www.realestate.com.au/international/us/99-s-branch-road-northfield-il-110099042451/",
      "price": "AUD $179,435",
      "location": "99 S Branch Road, Northfield, IL 60093",
      "description": "Beautiful 4 bedroom 2 bath mobile home, located within the Glenview school district! This beautifully maintained home welcomes you with a cozy family room & open-concept kitchen, stainless steel appliances, smart refrigerator, beautiful wood cabinetry & large island, perfect for hosting family and friends!   The primary suite has a walk-in closet & refreshed full bath. Newer luxury vinyl tile flooring throughout this show stopper! Convenient mudroom/laundry room with side-by-side washer/dryer leads to outdoor entertainment and fun in the backyard, there is also a shed for all your storage needs.  On the other end of the home, is another refreshed full bath, and three bedrooms, there is nothing left to do, just move on in!  Sunset Village Community has a clubhouse, fitness center & park near walking path. Pets welcome: 2 pet limit, no weight limit but there is a breed restriction. No property taxes as this is a land lease $1,397.83/month which includes the lot lease, garbage service & lawn maintenance. Conveniently located close to grocery, shopping, restaurants, expressway, bus and train.  Come make this spectacular home yours now!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/2639-riverboat-way-conway-sc-110099042450/",
      "price": "AUD $510,527",
      "location": "2639 Riverboat Way, Conway, SC 29526",
      "description": "Welcome to Kingston Bay! Located in Conway and is minutes from the heart of downtown! Residents will enjoy easy access to local shopping, dining, and entertainment. Conway is a charming historic town with oak tree-lined streets, historic homes, unique shops, remarkable restaurants, and a flourishing art community. This spacious two-story home has everything you are looking for! With a large, open concept great room and kitchen you will have plenty of room to entertain. The kitchen boasts a large island with breakfast bar, stainless Whirlpool appliances and a walk-in pantry. The first floor also features a great size flex space which could be used as an office, formal dining room, or den. Your primary bedroom suite awaits upstairs with huge walk-in closet and very spacious bath with double sinks, 5' shower, and linen closet. Enjoy the coastal air on the covered porch overlooking the back yard. There is plenty of space in the two-car garage with garage door opener. It gets better- this is America's Smart Home! Control the thermostat, front door light and lock, and video doorbell from your smartphone or with voice commands to Alexa. *Photos are of a similar Galen home.  (Home and community information, including pricing, included features, terms, availability and amenities, are subject to change prior to sale at any time without notice or obligation. Square footages are approximate. Pictures, photographs, colors, features, and sizes are for illustration purposes only and will vary from the homes as built. Equal housing opportunity builder.)"
    },
    {
      "url": "https://www.realestate.com.au/international/us/4-montclair-avenue-berlin-nj-110099042449/",
      "price": "AUD $569,510",
      "location": "4 MONTCLAIR AVENUE, BERLIN, NJ 08009",
      "description": "Step inside this charming 2'bedroom, 2'bath retreat in a serene adult community and feel your worries melt away. There is a BRAND NEW ROOF installed approximately 1 month ago. a NEW HVAC system installed approximately 2 years ago.   Set behind a covered front porch and one'car garage, the home welcomes you with lush, professionally landscaped lawns front and back. Imagine morning coffee on your porch, then stepping through the front door onto gleaming cherrywood hardwood floors that instantly warm the spacious living room, a bright, open area that flows seamlessly into the dining nook. The dining space, defined by light'hued engineered wood laid diagonally, creates a subtle separation from the living area while guiding you toward the heart of the home: the kitchen. Here you'll find Corian countertops, a built'in pantry, abundant cabinet and counter space, plus high ceilings above the cabinets ideal for displaying decorative treasures or simply leaving the room feeling open and airy. A large window above the sink and a sliding glass door flood the space with natural light and offer views of your private backyard oasis. Step through that sliding door into the sunroom, where walls of windows frame views of the lush rear lawn and lead onto the concrete patio. A retractable awning keeps you cool on hot summer days or rolls away when you crave sunshine. Whether you're lounging with a book, entertaining friends, or savoring an evening cocktail, this outdoor extension feels like your own personal resort. Both bedrooms offer tranquil retreats, the primary suite boasts an en'suite bath and generous closet, while the second bedroom and full bath provide comfortable accommodations for guests. Throughout the home, thoughtful details from high ceilings and premium finishes to seamless indoor'outdoor living'combine to create a beautifully balanced sanctuary. Don't miss your chance to call this move'in'ready gem your own. Schedule your private tour today and discover the effortless blend of elegance, comfort, and community living."
    },
    {
      "url": "https://www.realestate.com.au/international/us/125-s-green-street-chicago-il-110099042446/",
      "price": "AUD $623,964",
      "location": "125 S Green Street, Chicago, IL 60607",
      "description": "Updated and stylish one-bedroom condo in the heart of the West Loop with a one of a kind 660 sqft Private Terrace and 11' ceilings! This bright and open home features newer wide plank European white oak hardwood floors, a modern kitchen with espresso cabinets, granite countertops, and stainless steel appliances. The spacious bedroom offers a large walk in closet, while the bathroom boasts marble flooring,  vanity, and a separate tub and shower. Enjoy abundant natural light  and the convenience of central air/heat and in-unit laundry. Located in a full-amenity building in one of the city's most vibrant neighborhoods. Parking available for 30K.  Parking located steps from the unit on the 2nd floor of the garage. Make this your new home today!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/195-n-harbor-drive-chicago-il-110099042445/",
      "price": "AUD $842,562",
      "location": "195 N Harbor Drive, Chicago, IL 60601",
      "description": "Experience the ultimate in city living at the prestigious ParkShore on the 44th floor! This stunning 2-Bedroom, 2-Bathroom + Den unit boasts floor-to-ceiling bay windows in EVERY ROOM with sweeping views of Navy Pier, Lake Michigan, the city skyline, and nearby parks. The bright, open Living and Dining area flows effortlessly, providing the perfect setting for entertaining or simply taking in the incredible vistas. The Kitchen, featuring stainless steel appliances, offers the opportunity to customize to your taste. The Den/Office, complete with built-in shelving and breathtaking views, can easily be converted into a third Bedroom. The Primary Suite includes a spacious walk-in Closet and a private Bath with a soaking tub and separate shower. The second Bedroom offers ample closet space and convenient access to the second full Bath. IN-UNIT WASHER & DRYER and one valet parking space included adds to the convenience of this sophisticated home. Enjoy an unrivaled lifestyle with ParkShore's premier amenities: gorgeous lobby to greet guests, an outdoor rooftop pool with a sundeck, indoor hot tub, two party rooms, tennis courts, health club, outdoor grills, and dry cleaner. The indoor pedway connects you to Bockwinkel's grocery store on the lower concourse. Just steps from Millennium Park, Maggie Daley Park, the lakefront, Michigan Ave, Lake Shore East, Mariano's, and more. Valet parking is included. This is urban luxury at its finest! Unit is currently leased through August 15, 2025."
    },
    {
      "url": "https://www.realestate.com.au/international/us/105-dover-drive-des-plaines-il-110099042444/",
      "price": "AUD $311,904",
      "location": "105 Dover Drive, Des Plaines, IL 60018",
      "description": "Lovely 2-Bedroom Condo with Parking & In-Unit Laundry!    Move right into this charming second-floor condo featuring a bright and spacious living room/dining room combo with gleaming hardwood floors. The updated kitchen offers stainless steel appliances, ample counter space, and a ceramic tile floor-perfect for everyday living and entertaining.    Both bedrooms are generously sized and feature double-door closets and hardwood flooring. The remodeled bathroom includes a Euro-style, oversized Jacuzzi tub (as-is) for ultimate relaxation.    Additional highlights include an in-unit washer and dryer, three A/C units, and a deeded parking space (#19). Enjoy southern exposure for great natural light all day long. This unit is rentable, making it a great investment opportunity.    Immediate possession-don't miss your chance to own this fantastic condo!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/18660-white-pine-circle-hudson-fl-110099042443/",
      "price": "AUD $358,869",
      "location": "18660 WHITE PINE CIRCLE, HUDSON, FL 34667",
      "description": "Discover this charming home located at 18660 W. Pine Cir in Hudson, FL. The property features a spacious layout with three bedrooms and two bathrooms. Enjoy the well-maintained backyard, appropriate for outdoor activities and relaxation. The kitchen is equipped with modern appliances and ample counter space. Located in a serene neighborhood, this home is close to local amenities and offers a comfortable lifestyle. Don't miss the opportunity to make this delightful house your new home."
    },
    {
      "url": "https://www.realestate.com.au/international/us/518-w-meadow-avenue-lombard-il-110099042442/",
      "price": "AUD $466,530",
      "location": "518 W Meadow Avenue, Lombard, IL 60148",
      "description": "Nestled on a spacious lot, this 2-bedroom, 1-bath home is a diamond in the rough, awaiting your personal touch. With a large 2-car detached garage and a versatile basement, the possibilities are endless. Perfect for those looking to invest in a property with great potential. Needs TLC but offers a fantastic opportunity to create your dream home. Don't miss out on this unique chance to own a piece of real estate with so much promise!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/707-e-patterson-street-tampa-fl-110099042439/",
      "price": "AUD $592,758",
      "location": "707 E PATTERSON STREET, TAMPA, FL 33604",
      "description": "Discover this well-priced income-producing rental situated on a double buildable lot in sought-after Seminole Heights. The front house is currently divided into two units: a spacious 2-bedroom, 1-bathroom unit and a cozy 1-bedroom, 1-bathroom unit, with the potential to easily reconvert back into a 3-bedroom, 2-bathroom single-family residence.Additionally, the garage apartment features a 1-bedroom, 1-bathroom layout, with ample space to enclose part of the porch, creating an extra bedroom for added convenience. The garage area currently serves as both storage and laundry facilities.All units boast newer metal roofs, along with updated plumbing and electrical systems, ensuring a low-maintenance investment. Don't miss out on this fantastic opportunity to own a versatile property in a vibrant neighborhood! Non-flood zone!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/232-leona-court-woodbury-nj-110099042440/",
      "price": "AUD $483,693",
      "location": "232 LEONA COURT, WOODBURY, NJ 08096",
      "description": "Don't miss out on this well cared for brick front 3-bedroom, 2 full bath cape, situated on a quiet cul-de-sac street in a nice area of Woodbury. This original owner had the builder open the one wall on the first floor bedroom and make the third bedroom, a family room. See attached original builder floor plan. Can easily be made back to third bedroom within hours. You will love the curb appeal as you pull up with the attractive brick front, nicely landscaped front flowerbeds and the oversized two car driveways. The covered front porch is a perfect spot to relax undercover with the morning cup of coffee on these beautiful spring days. Step inside to the space spacious living room with its raised cathedral ceiling, open staircase to the second floor and the upgraded LVP flooring that flows throughout the first-floor area. Upgraded Anderson windows have been installed through the home over the past 5 to 9 years. You will love the brick fireplace that was converted to gas logs. Perfect spot to snuggle up to on those cold winter days. This room opens to the spacious and open dining room/kitchen areas. The original kitchen has been upgraded with the current raised panel cabinetry, two seated breakfast bar area, newer Anderson casement windows, and all the existing appliances are included as well. The utility closet features the upgraded high-efficient gas HVAC, which was replaced in October 2013. The open dining area is a nice feature when hosting those holiday gatherings or for just everyday living. The Anderson slider steps out to the rear deck and backyard area. Perfect for those summer barbecues or just relaxing out on the back deck. The rear yard also features a storage shed to house all your outdoor tools. Back inside you will find the original third bedroom that the current owner had the builder leave the door off and opened a small section of a wall to make it a family room versus the third bedroom as it was designed in the attached floor plan.  Can easily be back to a third bedroom within hours. Just outside this room you will find a totally remodeled, upgraded ceramic tiled full bath with a full walk-in stall shower with built-in seat, as well as an upgraded vanity, counter and undermount sink. The laundry room houses the existing washer, dryer, upgraded high efficiency gas hot water heater (4/2013), electric service panel box and built in storage shelving. This convenient space also serves as a mud room with the side door out to the service walk to the driveway and rear yard. The second floor features two very spacious bedrooms and another full bath. These rooms all have Anderson windows as well. The larger bedroom features two walk-in closets with lights as well as access panels for additional storage areas for your items needing to be stored away. The full bath features newer LVP floor, upgraded vanity / sink with ceramic tile surround and a tub/shower condo This well cared for one owner home is so conveniently located to the local schools, shopping centers, many restaurants, shopping mall, movie, theaters, home improvement centers, Route 45, Route 55, New Jersey Turnpike and Route 295 north and south to be in the city within 15 minutes, Delaware within 20 minutes and the Jersey shore within 60 minutes. Such a convenient location for anything you could possibly need. Hurry before this one is gone."
    },
    {
      "url": "https://www.realestate.com.au/international/us/151-meander-circle-royal-palm-beach-fl-110099042438/",
      "price": "AUD $580,432",
      "location": "151 Meander Circle, Royal Palm Beach, FL 33411",
      "description": "Desirable spacious townhouse in the heart of Royal Palm Beach, With three 3 Beds and 2 Baths plus 1 car garage, This is one of the largest model in the 55+ community of Village Walk.Inside you will notice high ceilings, and newer flooring throughout the main area, with an eat in kitchen, Lots of storage space with two master closets. A large master bedroom and master bathroom with dual sinks. Just mins away from cultural Preforming art center and more."
    },
    {
      "url": "https://www.realestate.com.au/international/us/11909-dillon-falls-drive-austin-tx-110099042434/",
      "price": "AUD $762,581",
      "location": "11909 Dillon Falls Drive, Austin, TX 78747",
      "description": "The Eisenhower plan offers a spacious and flexible layout spread across two stories, featuring 2,728 square feet, 4-5 bedrooms, 2.5 bathrooms, and a 2-car garage. This thoughtfully designed home provides ample room for everyday living, entertaining, and relaxing, with several options to personalize the space to your lifestyle."
    },
    {
      "url": "https://www.realestate.com.au/international/us/921-newington-court-capitol-heights-md-110099042435/",
      "price": "AUD $569,494",
      "location": "921 NEWINGTON COURT, CAPITOL HEIGHTS, MD 20743",
      "description": "This is it!  Move in ready/Turn key townhouse close to Washington DC with 4 bedrooms, 2 full and 2 half baths, hard surface flooring on the upper two levels, neutral paint color throughout, updated kitchen and bathrooms, finished basement w/bedroom and a deck with an amazing view of nature.  There is a dedicated parking space in front of the property with ample visitor parking.  The main level entryway has a dedicated foyer with a split level effect into the open living room which leads to the updated kitchen with stainless steel appliances, hard surface countertops and an entrance to the rear deck and yard.  the upper level houses the primary en suite with a full updated bathroom and ample closet space.  This level is rounded off with a hall bathroom and 2 secondary bedrooms.  This level has hard surface flooring throughout.   The lower level features a 4th bedroom with an egress window and closet, a recreation space, the laundry and mechanicals room.  All that's missing is you.  This one is worth a look and conveniently located near public transportation and a short drive to Metrorail.  There are tons of local businesses and shopping nearby to include eateries, restaurants, gas, TJ Max, Marshalls, Woodmore Town Center, Joint base Andrews and Univ of MD medical center which are all a short drive away.   Pictures will be added soon!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/206-holiday-city-boulevard-williamstown-nj-110099042437/",
      "price": "AUD $475,892",
      "location": "206 HOLIDAY CITY BOULEVARD, WILLIAMSTOWN, NJ 08094",
      "description": "This home has a lot to offer. The sunroom is a big plus for the person who loves the outdoors and even has a gas fireplace for those chilly days. The open floor plan flows very nicely as you enter the front entrance. The steps are already equipped with the mobile chair just in case and when you or your loved one needs it! The rooms are spacious and both bedrooms have a Walk-in closet! The home backs up to the woods for that extra privacy. The home has solar power with a Lease bill of less than $100 and an electric bill around $7. This home is ready for its new owners to make it their own!The low Association fee is only due quarterly and covers your lawn, snow removal, club house, pool and endless activities."
    },
    {
      "url": "https://www.realestate.com.au/international/us/10825-n-stonebridge-drive-tucson-az-110099042432/",
      "price": "AUD $1,115,615",
      "location": "10825 N Stonebridge Drive, Tucson, AZ 85742",
      "description": "Stunning Oracle Plan with Next Gen(r) Suite in gated Preserve at Twin Peaks! This 3-bed home features over $80K in upgrades, luxury tile throughout (no carpet), a gourmet kitchen with GE appliances, granite, crown molding, and RO system. The private Next Gen(r) suite includes a separate entrance, kitchenette, bath, laundry, and garage. Enjoy a beautifully landscaped backyard with turf, raised garden beds, and a 12' slider to the covered patio. Peacefully located in a roundabout with no through traffic, park in front, and greenbelt behind--just minutes from I-10."
    },
    {
      "url": "https://www.realestate.com.au/international/us/4704-sw-bermuda-way-palm-city-fl-110099042433/",
      "price": "AUD $1,419,873",
      "location": "4704 SW Bermuda Way, Palm City, FL 34990",
      "description": "Nestled in the desirable golfing community of Evergreen, this spacious 4-bedroom, 3.5-bath ranch with a 3-car garage offers an exceptional living experience. The completely renovated home is move-in ready, with a brand-new roof for peace of mind. The light-filled living area features a decorative fireplace and sliding glass doors leading to the pool-patio area.  The luxurious owner’s suite has patio access, a spa-like bathroom with dual sinks, a separate tub and shower, and a large walk-in closet. The split-bedroom layout offers three private bedrooms, providing ideal privacy with two well-appointed bathrooms.Step outside to the spacious patio with a cabana bath and outdoor shower, while the pool offers year-round relaxation. Located within the renovated 18-hole Crane Watch Club Golf Course, this home is minutes from shops, fine dining, hospitals, top-rated schools in Palm City, and easy beach access. A rare gem combining luxury and opportunity."
    },
    {
      "url": "https://www.realestate.com.au/international/us/3322-ryan-avenue-philadelphia-pa-110099042427/",
      "price": "AUD $466,530",
      "location": "3322 RYAN AVENUE, PHILADELPHIA, PA 19136",
      "description": "Your Dream Home Awaits!Location is key, and this property does not disappoint! You'll be just moments away from popular shopping destinations and a variety of delightful restaurants, offering everything from casual bites to fine dining. Commuting is a breeze with easy access to all major highways and nearby attractions, making it the perfect choice for those seeking both convenience and excitement.Welcome to this stunning property that truly embodies the essence of modern living. Nestled in a perfect location, this beautiful home boasts two full living floors, each designed with an open concept that invites you to relax and entertain in style.As you step inside, you'll be greeted by gleaming hardwood floors that extend throughout both levels, creating a warm and inviting atmosphere. The spacious living areas are bathed in natural light, providing a seamless flow from one room to the next. The updated amenities in the kitchen are a chef's delight, featuring modern appliances, ample counter space, and elegant cabinetry, perfect for whipping up gourmet meals or hosting gatherings with friends and family.With two well-appointed Kitchen, you'll enjoy comfort and convenience in every corner of your new home. The thoughtfully designed layout ensures that each living space has an airy feel, ideal for both relaxation and entertainment.Bring your dreams and make this your forever home sweet home! Whether you're a first-time buyer or looking to upgrade, this property has it all. Don't miss the opportunity to make this enchanting residence your own. Schedule a viewing today and step into a lifestyle of comfort and convenience!This is An As-IS Sale. Home Inspections is for informational purposes Only."
    }
  ],
  "page_3": [
    {
      "url": "https://www.realestate.com.au/international/us/234-dolphin-point-clearwater-beach-fl-110099042428/",
      "price": "AUD $1,209,233",
      "location": "234 DOLPHIN POINT, CLEARWATER BEACH, FL 33767",
      "description": "INCREDIBLE OPPORTUNITY!!  MOTIVATED SELLER PAYING $25,000 IN UPCOMING ASSESSMENTS TO COVER A BRAND NEW ROOF, GUTTERS, AND DRYWALL CREDIT. DEEDED BOAT SLIP, NEW JET SKIS NEGOTIABLE, AND  BEST WATER VIEW IN COMPLEX!  Discover coastal living at its finest with this remarkable three-story townhouse, featuring a private dock and a 15,000 lb boat lift. Just moments from the Gulf, this prime location offers effortless access to world-class fishing, stunning Gulf Coast beaches, and the Intracoastal Waterway. Step inside your new home through a new striking decorative hurricane-impact front door and be greeted by approximately 360 sq ft of air-conditioned flex space on the first level—perfect as a home office, fourth bedroom, play area, or extra storage. This versatile space, not included in the main square footage, is awaiting your personal design to finish out this first level into whatever you desire.   The oversized two-car garage offers tandem parking, plus an additional space right out front.Second Level: Elevated Living & Entertaining. The heart of this home is a spacious, open-concept second floor, where a large kitchen seamlessly flows into the living and dining areas. Sleek granite countertops, a dry bar, with beautiful, stainless appliances create an entertainer’s dream, while rich wood-look tile floors exude warmth and elegance. A guest bedroom with plantation shutters opens to a generous balcony, perfect for soaking in the views. The living room’s captivating feature wall highlights a wood-burning fireplace, adding ambiance and charm. Enjoy the serene waterscape from the balcony, accessed through patio doors with wispy sheers that allow sunsets to become part of your daily routine.Third Level: Luxurious Private Retreat. The primary bedroom on the third level is nothing short of spectacular, showcasing a vaulted ceiling, gorgeous hardwood floors, and patio doors that lead to a third balcony, the ultimate vantage point for breathtaking views. The en-suite bath features dual above mount – glass sinks and a walk-in shower, while the dream closet, offers abundant storage. Also on this floor is a second bedroom with hardwood floors and patio doors leading to a fourth balcony---yes, a fourth! A conveniently located laundry closet includes newer washer and dryer units, both of which convey.Premium Upgrades & Unmatched Location. Nearly every room is accented by crown molding, enhancing the home's timeless elegance. Enjoy peace of mind with two new HVAC systems (replaced after the Hurricanes and outside units are elevated) 2024, New Water Heater and an Alert360 Security system with camera, motion and flood sensors.  Situated in the highly sought-after Island Estates community, you’ll love being just a short stroll from Publix, restaurants, and one of the Top 10-Rated Beaches in the U.S. Don’t miss your chance to own this meticulously upgraded townhouse, your gateway to unparalleled coastal living!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/8330-s-mather-rd-kirkland-az-110099042429/",
      "price": "AUD $232,485",
      "location": "8330 S Mather Rd, Kirkland, AZ 86332",
      "description": ""
    },
    {
      "url": "https://www.realestate.com.au/international/us/2340-caravan-place-melbourne-fl-110099042430/",
      "price": "AUD $1,168,665",
      "location": "2340 Caravan Place, Melbourne, FL 32940",
      "description": "A must-see ''home within a home'' concept, this former builder's model has all the extras! Situated on a waterfront lot with additional landscaping, the next-gen floor plan in Bridgewater, Viera's popular 55+ resort style community, features a separate living suite with private entrance, kitchen and laundry, family room, full bath and bedroom and is perfect for an office, in-laws, and grown children.  This beautifully decorated home with 3 additional bedrooms, 2 baths and a flex room, features plank tile throughout with color sealed grout adding beauty and ease of cleaning. The stunning gourmet kitchen features wall ovens, a cooktop, designer hood, tiled backsplash with undercabinet lighting, pantry and a huge island! Crown molding and additional LED lighting in all rooms! Enjoy relaxing on the stone-faced front porch or on the screened lanai overlooking the lake and fountain! State of the art clubhouse with heated pool, spa, tennis, pickleball! Close to beaches! HOA maintains your yard"
    },
    {
      "url": "https://www.realestate.com.au/international/us/3903-kline-avenue-reading-pa-110099042431/",
      "price": "AUD $624,120",
      "location": "3903 KLINE AVENUE, READING, PA 19606",
      "description": "Welcome to 3903 Kline Avenue!  This lovely, single family home sits atop a quiet street in St. Lawrence Boro in the wonderful Exeter Township school district.  Hardwood floors, updated bathrooms, and natural sunlight are the first things you’ll notice in this immaculate, 3 bedroom, 2 ½ bath home.  The kitchen is appointed with beautiful counter tops, updated appliances, and well-appointed cabinets, that lead to a well lit eating area. The family room has a wonderful vaulted ceiling and beautiful hardwood floors.  Upstairs has three bedrooms, a spacious bathroom, and a walk-in closet that could also be used as a small office.  You won’t feel as though you are in a basement on the lower level that is finished with a wet bar, nice flooring, a half bathroom, and a workshop.  Roof is two years old complete with gutter guards. The backyard is very private and well kept.  Love the fresh air?  Enjoy the wonderful three seasons room that sits right off the car port. A quick settlement is possible, but not necessary."
    },
    {
      "url": "https://www.realestate.com.au/international/us/1109-chiswell-lane-silver-spring-md-110099042425/",
      "price": "AUD $873,768",
      "location": "1109 CHISWELL LANE, SILVER SPRING, MD 20901",
      "description": "Estate Sale – Sold As-Is!Welcome to your next chapter in the highly sought-after Forest Knolls community! This rock-solid, 3-bedroom, 2.5-bath split-level home has been lovingly maintained by the current family since Dec 1963 and is move-in ready with thoughtful updates throughout.Step inside to a freshly painted interior, refinished hardwood floors on the main level, and new carpet upstairs and in the lower-level family/rec room. The welcoming foyer features tile flooring and a convenient hall closet, guiding you into the spacious living and dining room area—perfect for entertaining or relaxing.The recently refreshed kitchen is a standout with new stainless steel appliances, a brand-new cooktop, WilsonArt Solid Surfaces Countertops, and solid wood cabinetry offering excellent counter and storage space.Upstairs, you’ll find brand-new carpeting throughout the hallway and bedrooms, a fully updated hall bath, and a generous primary suite complete with a private bath and plenty of closet space. Two additional spacious bedrooms round out the upper level—each offering ample natural light and storage.Head downstairs to enjoy a large  family  room with fresh carpet and a cedar closet for extra storage. The lower level also features a laundry/utility room and a newly updated half bath.Outside, you'll love the private driveway, and large  fenced-in backyard—ideal for gatherings, gardening, or simply relaxing outdoors.The Forest Knolls community is full of charm and convenience. Enjoy access to the neighborhood pool, North Branch Park (accessible from right in the neighborhood), Sligo Creek Park and golf course, and a vibrant array of international dining and shopping options just minutes away. With three Red Line Metro stops within five miles and quick access to I-495, Rt. 29, and Rt. 97, commuting to Baltimore, D.C., or Northern Virginia is a breeze.Don’t miss this opportunity to own a beautifully maintained home in one of the area's most desirable neighborhoods!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/15-county-rd-366-crane-hill-al-110099042426/",
      "price": "AUD $467,934",
      "location": "15 COUNTY RD 366, Crane Hill, AL 35053",
      "description": "Smith Lake/Pigeon Roost Creek- NEW PHOTOS ADDED! Tiny cabin located minutes to Trident Marina! This home comes fully furnished and features 1br/1ba, ample size living and kitchen areas, and an additional 2 loft areas each allowing room for 2 twin size mattresses. Put in a sleeper sofa and you've got room to sleep up to 8 people! Produced over 25k on AirBNB last year and still has ongoing rentals."
    },
    {
      "url": "https://www.realestate.com.au/international/us/501-hungerford-drive-rockville-md-110099042422/",
      "price": "AUD $653,766",
      "location": "501 HUNGERFORD DRIVE, ROCKVILLE, MD 20850",
      "description": "Gorgeous Top Floor unit w/2-Story High Ceiling at the popular Fitz at Rockville Town Center. Dual master suites w/ample walk-in closet space plus a Loft overlooking living room ideal for home office or guest bedroom. Separate laundry room w/front loading washer & dryer (2022) and shelving for storage. Large balcony looking out to open common area. Amazing amenities including Outdoor Pool, Gym, Theater Room, Cyber Café, Party Room w/pool table, ping pong, and kitchen. FiOS TV & Internet are included in the condo fee. Water heater (for heat) replaced in 2017, A/C in 2022. Three (3) assigned garage spaces. Walk to Metro & Rockville town center, grocery stores, shops, restaurants, movie theater, library, weekend farmer's market. Easy commute to NIH or DC, minutes to I-270."
    },
    {
      "url": "https://www.realestate.com.au/international/us/8625-fleming-grant-road-micco-fl-110099042423/",
      "price": "AUD $1,043,841",
      "location": "8625 FLEMING GRANT ROAD, MICCO, FL 32976",
      "description": "Discover privacy on this 1.5-acre property featuring a pool home with NO HOA! Surrounded by a privacy fence and enhanced by newly planted palms, this residence offers seclusion. Inside, enjoy an open split floor plan with tile flooring throughout, granite countertops, and updated bathrooms. Relax or entertain on the family-sized covered porch overlooking the screened in pool and lanai. Recent updates provide peace of mind: new A/C (2023), new GE appliances (2022) and a newer metal roof. Added conveniences include a large storage shed, a whole-house generator, and a small pond on the lot."
    },
    {
      "url": "https://www.realestate.com.au/international/us/140-braymoor-circle-fayetteville-ga-110099042424/",
      "price": "AUD $561,708",
      "location": "140 Braymoor Circle, Fayetteville, GA 30215",
      "description": "Beautiful brick front single-family home, 4 bedrooms, 2.5 bath home located on a quiet cul-de-sac. Living Room w/brick fireplace.  Dining Room combination with Living Room.  Sunroom overlooking large backyard (partially fenced). Master on main level, garden tub and separate tiled shower.  3 bedrooms upstairs along with a loft area.  HOA includes mowing and maintenance of your yard.  Convenient to shopping, restaurants and schools. Don't miss out on this newly renovated house with new heating and air, appliances and more."
    },
    {
      "url": "https://www.realestate.com.au/international/us/164-colonial-parkway-manhasset-ny-110099042420/",
      "price": "AUD $5,769,989",
      "location": "164 Colonial Parkway, Manhasset, NY 11030",
      "description": "Welcome to this stunning Hamptons Style Colonial set at the end of one of Manhasset's most desirable streets. This gem is conveniently located close to town, schools and LIRR, yet offers the utmost in privacy, backing up to a preserve with water views. Upon entering the home you are greeted by an elegant \"gallery style\" foyer leading from the front to the back of the home. The formal living room is comfortable and elegant and warmed by a beautiful gas fireplace. French doors from the foyer and living room provide access to a fabulous maintenance free deck in the back. Entertain your guests in a banquet sized dining room. The foyer and the principal rooms are adorned with tasteful mill work and gleaming hardwood floors. Serve friends and family meals prepared in the recently redone chef's kitchen boasting both granite and quartz countertops, all set on stylish bespoke cabinetry. High end stainless steel appliances and a huge pantry complete the package. For more casual dining, serve meals at the enormous kitchen island or at a more casual family farm table. The kitchen overlooks the spacious and comfortable family room with built-ins surrounding another gas fireplace. Huge windows provide a beautiful view of the yard and preserve throughout the home. Dining al fresco could not be more convenient. A sun drenched office, laundry, storage and two powder rooms complete the first floor. The second floor sanctuary features four generously sized bedrooms and three full baths. The elegant primary suite features a spa-like bath offering double sinks, whirlpool tub and steam shower. You will also find two oversized closets and a show stopping balcony overlooking the yard, preserve and bay. Three more ample sized bedrooms with exceptional closet space. One bedroom has an ensuite bathroom and the other two share a jack and jill bathroom. The lower level boasts 10' ceilings, ample storage and tons of room for entertainment. French doors offer easy access to the patio and yard. All completed with a full house generator."
    },
    {
      "url": "https://www.realestate.com.au/international/us/3808-jack-vernon-circle-powder-springs-ga-110099042417/",
      "price": "AUD $569,353",
      "location": "3808 Jack Vernon Circle, Powder Springs, GA 30127",
      "description": "Historic Powder Springs - Stunning Townhomes ready for move-in! This stunning END UNIT Delivers the best of both worlds. Location and Style. This very Charming location has the walkability to the quaint historic downtown. Only a few steps to shops, restaurants, Powder Springs amphitheater w/ live music and entertainment, spray grounds and the award-winning Silver Comet Trail. This 4-bedroom, 3.5-bathroom residence offers both modern luxury and convenience. Nestled in the heart of a vibrant community, this property boasts an open-design, best for living and entertaining. Chef's kitchen, featuring quartz countertops, stainless steel appliances and beautiful cabinetry. The generously-sized bedrooms and baths will not disappoint with the spaciousness and features. Great Incentives offered! Open Wednesday, Thursday and Friday 12-4, Saturday 12-5 and Sunday 1-5."
    },
    {
      "url": "https://www.realestate.com.au/international/us/5713-timber-ridge-drive-raleigh-nc-110099042418/",
      "price": "AUD $779,994",
      "location": "5713 Timber Ridge Drive, Raleigh, NC 27609",
      "description": "Prime location meets unmatched potential near North Hills! Tucked away on a generous 0.60-acre lot just minutes from the heart of North Hills, this move-in ready split-level home offers space, charm, and unlimited potential. With 4 bedrooms and 3 full baths, it's the perfect blend of functionality and character. Step inside to find solid hardwood and laminate flooring throughout the first and second levels—absolutely no carpet! The updated kitchen features quartz countertops, a tile backsplash, stainless steel appliances, and a gas range—perfect for the cooking enthusiast! A built-in breakfast hutch adds a touch of classic charm to the dining area.  Natural light pours into the main-level living room through a large picture window, while the lower-level family room with a cozy fireplace is perfect to relax after a long day. Love the outdoors? You'll adore the versatile screened porch that opens to a deck and enormous fully fenced backyard—an entertainer's paradise or a tranquil retreat. Two outdoor storage buildings, including a wired workshop, offer excellent space for hobbies or additional storage. Key updates include: HVAC (2019), roof (2020), water heater (2020), fresh exterior paint (2024), and garage door opener (2025), ensuring peace of mind for years to come. Plus, the refrigerator (2024), washer (2021), and dryer (2021) convey with the home—making your move even easier.   This home has solid bones and is move-in ready but also offers opportunity for you to upgrade and expand. Opportunities with this much land just minutes from North Hills are rare—don't miss your chance to own a phenomenal property in a great North Raleigh location. Schedule your showing today and imagine the possibilities!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/101-e-safford-street-tombstone-az-110099042419/",
      "price": "AUD $514,899",
      "location": "101 E Safford Street, Tombstone, AZ 85638",
      "description": "Rare slice of Old West history is now available in Tombstone! This charming single-level home is situated on a large, fully fenced corner lot. The bright & light interior features a designer palette, layered crown molding, and carpet & wood-look flooring in all the right places. You'll love the welcoming living room and the formal dining room w/fireplace! The sizable kitchen has a built-in elec range, pendant lighting, and pull-out drawers. Two oversized main bedrooms with its own bathroom! There is also a bonus room ideal for a workshop, storage, or hobby area. If you want to relax while enjoying the neighborhood's tranquility, the cozy front porch and side & back covered patios await you! The spacious backyard provides plenty of room for your creative ideas. Don't miss this opportunity!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/1890-victor-higgins-drive-shelbyville-in-110099042415/",
      "price": "AUD $466,655",
      "location": "1890 Victor Higgins Drive, Shelbyville, IN 46176",
      "description": "Welcome home to the New Castle at Belmont! Part of our Smart Series, this thoughtfully designed two-story floorplan features four different elevations to choose from and numerous upgrades to make make your home perfectly designed to your needs. The standard layout includes a two-car garage, a gathering room, a kitchen, a dining nook, three bedrooms, and two-and-a-half bathrooms."
    },
    {
      "url": "https://www.realestate.com.au/international/us/201-mount-royal-road-vacaville-ca-110099042416/",
      "price": "AUD $1,404,083",
      "location": "201 Mount Royal Road, Vacaville, CA 95687",
      "description": "This two-story Next Gen home features a private suite on the second floor, complete with a separate entrance, living area, kitchen, bedroom and bathroom for seamless independent living. On the first floor is a spacious open-concept floorplan, with a bedroom near the foyer and a lavish owner's suite at the back of the home. A loft and two additional bedrooms are located upstairs."
    },
    {
      "url": "https://www.realestate.com.au/international/us/9900-s-thomas-drive-panama-city-beach-fl-110099042414/",
      "price": "AUD $764,545",
      "location": "9900 S Thomas Drive, Panama City Beach, FL 32408",
      "description": "Turnkey Gulf-Front Condo | 2BR + Bunk | 2.5BA | High ROI Potential!Exceptional investment opportunity at the Shores of Panama! This fully updated unit is rental-ready with strong income potential. Centrally located near top dining, shopping, and entertainment--this is a proven performer in PCB's vacation rental market."
    },
    {
      "url": "https://www.realestate.com.au/international/us/48-tranquility-lane-destin-fl-110099042413/",
      "price": "AUD $2,956,769",
      "location": "48 Tranquility Lane, Destin, FL 32541",
      "description": "48 Tranquility Lane is an exceptional coastal retreat offering 5 bedrooms, 3.5 bathrooms, and over 3,400 square feet of thoughtfully designed living space, making it perfect for families and guests to enjoy. This stunning property features one of the most impressive private pools in the area, complete with a spillover spa, a picturesque footbridge, and a 6-foot privacy fence, ensuring a secluded outdoor oasis like no other. Recent updates, including new hardwood flooring, fresh paint, modernized mattresses, and a high-efficiency pool heater, further enhance its luxury and comfort. This home has $155,000 + booked in 2024 with rental income ranging from $150K-225k annually in gross rental history. The first floor showcases an open-concept layout with a chef's kitchen featuring exotic granite countertops, flowing seamlessly into a spacious living room complete with a flat-screen TV and fireplace. The dining area overlooks the private courtyard and pool, creating an ideal setting for entertaining or relaxing. This level also includes a laundry room, a bedroom with full-size bunk beds, and a half bathroom. On the second floor, two expansive primary suites await, each with king-sized beds and private ensuite bathrooms. The primary suite above the garage also includes a cozy sitting area with a sectional and a queen sofa sleeper. Two additional bedrooms, one with two queen beds and another with a king bed, provide ample and flexible accommodations.Professionally decorated with custom furnishings and meticulous attention to detail, the home exudes sophistication. High-speed internet ensures seamless connectivity, while an additional refrigerator in the garage adds practicality. Outside, the home's extensive living spaces and extraordinary pool area offer endless opportunities for relaxation and entertainment. Situated just across the street from the beach and a short distance from Club Destiny, the property provides access to a wealth of community amenities, including a state-of-the-art clubhouse, fitness center, seasonally-heated swimming pool, tennis and basketball courts, a putting green, a children's playground, and even a private 25-seat IMAX theater.Located in one of the most sought-after neighborhoods, 48 Tranquility Lane combines luxury, privacy, and convenience. Whether lounging in the secluded courtyard, enjoying the nearby white-sand beaches, or exploring the exceptional amenities of the area, this home offers the ultimate coastal lifestyle.Contact us today for rental projections & cost-to-own figures."
    },
    {
      "url": "https://www.realestate.com.au/international/us/tbd-s-madison-street-bloomington-in-110099042412/",
      "price": "AUD $101,420",
      "location": "TBD S Madison Street, Bloomington, IN 47401",
      "description": "This lot is level and ready to be built on, just 2 miles south of downtown Bloomington. All utilities are available at the street (sewer, water, natural gas & electric). Prior to closing the fence will be removed, currently the neighbor has been maintaining it. Please do not go in the fenced area (arrangements need to be made to go in the fenced area). Zoning is R2 (Residential Medium Lot)"
    },
    {
      "url": "https://www.realestate.com.au/international/us/4208-falkirk-place-fredericksburg-va-110099042411/",
      "price": "AUD $736,430",
      "location": "4208 Falkirk Place, Fredericksburg, VA 22407",
      "description": "Welcome to Alexander's Crossing, Fredericksburg's premier new townhome community close to shopping, dining & commuter routes! The Nassau Cove truly lives up to its name. Enter this attached home through the one-car garage and step right into the gorgeous gourmet kitchen. Its large center island overlooks both the inviting great room and the formal dining space. Entertain family and friends here or outside on the optional outdoor patio. The main level also includes your luxury owner's suite, which features a dual vanity bath and huge walk-in closet. Upstairs, you'll find two spacious bedrooms, a full bath, and extra storage. The finished basement is included at Alexander's Crossing for more living space, so you get the most out of the Nassau Cove."
    },
    {
      "url": "https://www.realestate.com.au/international/us/1624-arlington-road-lafayette-in-110099042409/",
      "price": "AUD $273,053",
      "location": "1624 Arlington Road, Lafayette, IN 47904-1639",
      "description": "Welcome to 1624 Arlington Road in Lafayette—a charming 3-bedroom, 1-bathroom home offering just under 1,200 square feet of comfortable living space. This move-in ready home features an eat-in kitchen, ceiling fans throughout, and a fully fenced backyard perfect for pets, play, or entertaining.  Enjoy peace of mind with recent upgrades including a new water heater (2023), HVAC system (2024), and updated insulation and drywall in the living room and hallway (2022). Just one house down from Arlington Park and within walking distance to local favorites like Payless on Greenbush and Market Square, this location makes daily errands and recreation a breeze.  Priced to sell and situated in a friendly, established neighborhood, this home is ideal for anyone looking to enjoy both indoor comfort and outdoor living in a convenient location. Don’t miss your chance to make this welcoming community your new home!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/313-e-15th-street-tempe-az-110099042410/",
      "price": "AUD $1,552,499",
      "location": "313 E 15TH Street, Tempe, AZ 85281",
      "description": "Very RARE 1/2 acre lot Just three blocks from ASU and less than a five-minute walk to iconic Gammage Auditorium, this property offers an unbeatable location in one of Tempe's most established and tightly held neighborhoods—where homes rarely come up for sale.Sitting on a generously sized, flood-irrigated lot just over half an acre and surrounded by mature trees, this home has endless potential. Whether you're looking to create your dream home, invest in a prime rental property, or take on a rewarding fixer-upper project."
    },
    {
      "url": "https://www.realestate.com.au/international/us/322-e-central-boulevard-orlando-fl-110099042407/",
      "price": "AUD $545,949",
      "location": "322 E CENTRAL BOULEVARD, ORLANDO, FL 32801",
      "description": "Experience elevated city living in this beautifully remodeled 1-bedroom, 1-bath corner/end unit condo on the 19th floor of The Waverly on Lake Eola. This modern high-rise unit offers sweeping skyline views and a bright, open-concept layout with floor-to-ceiling windows that flood the space with natural light. On a clear night, you are able to see the Disney fireworks from your home. This unit is the largest 1 bedroom floorplan in the building.This condo offers new laminate floors throughout, new kitchen appliances, in-unit laundry and contemporary cabinetry—perfect for entertaining or quiet nights in. The spacious bedroom includes a generous walk-in closet space with custom shelving and direct access to the brand new fully remodeled bathroom with stylish finishes and a spa-like feel. You also have your own assigned parking spaceLocated in the heart of Downtown Orlando, The Waverly offers resort-style amenities including pool and spa, fitness center, 24-hour security, concierge service, and a resident lounge. Just steps from Lake Eola, Publix, dining, nightlife, and the Dr. Phillips Center for the Performing Arts, this prime location blends urban convenience with luxurious comfort.Don’t miss the opportunity to own a piece of Downtown Orlando’s skyline!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/2138-e-minton-drive-tempe-az-110099042408/",
      "price": "AUD $606,957",
      "location": "2138 E MINTON Drive, Tempe, AZ 85282",
      "description": "Welcome to this beautifully updated 2-bedroom, 2-bath townhouse in the heart of Tempe's popular Continental Villas! Just minutes from ASU and close to the 60 and 101 freeways, this move-in-ready home features a stylish open-concept layout with new lighting and a spacious great room feel. The kitchen shines with quartz countertops, stainless steel appliances, and classic subway tile. The large master suite offers double sinks and a walk-in closet, while fresh designer paint and natural light make the whole place feel warm and inviting. Enjoy a private well landscaped backyard with a covered and screened in patio. This friendly community features a sparkling pool, tennis courts, clubhouse, and a grassy play area. Plus, you'll have two assigned and covered Parking Spots!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/53-westridge-drive-durham-nc-110099042399/",
      "price": "AUD $936,180",
      "location": "53 Westridge Drive, Durham, NC 27713",
      "description": "Gorgeous transitional Woodcroft home on large cul-de-sac lot with great rear privacy!  Living room & foyer w/ vaulted ceiling, formal dining room, kitchen w/ granite countertops, birch flat panel cabinets, and stainless appliances, breakfast area, large family room w/ stone-faced fireplace, built-ins, and dry bar, large rear sunroom w/ skyllight, stunning primary bedroom suite w/ vaulted ceiling, fireplace, renovated bath w/ new cabinets/countertop/tile floors, and walk-in glass & tile shower!  Dual rear decks, dog area/doors, huge fenced back yard, extensive landscaping & walkways.  Deluxe updates include all hardwood flooring, renovated baths, architectural shingles, newer interior paint, and so much more!  A very special home you must see!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/1621-eagle-creek-drive-clearwater-fl-110099042400/",
      "price": "AUD $622,560",
      "location": "1621 EAGLE CREEK DRIVE, CLEARWATER, FL 33764",
      "description": "Welcome to 1621 Eagle Creek Dr, Clearwater, FL—a modern townhome offering a perfect blend of comfort, style, and convenience.  Built in 2019, this modern pad offers 2 bedrooms and 2.5 bathrooms spread across 1,571 square feet of comfortable living space. Step inside to an open floor plan with high ceilings and stylish tile flooring on the main level. The kitchen is a chef's dream, featuring gorgeous countertops and upgraded stainless steel appliances—perfect for whipping up your favorite dishes. Head upstairs to find two cozy bedrooms with plush carpeting, a spacious bonus room ideal for a home office or entertainment area, and a convenient laundry room. The master suite boasts dual sinks and a walk-in shower, adding a touch of luxury to your daily routine. This home is move-in ready, complete with blinds throughout, recessed lighting, in-wall pest control, a lanai for outdoor relaxation, and hurricane fabric shutters for peace of mind. Plus, there's an attached garage to keep your vehicle safe and sound. Located in the gated community of Towns at Belleair Grove, you'll have access to a community pool and playground. The central Clearwater location means you're just a hop, skip, and a jump away from beautiful beaches, St. Pete, and Tampa Airport. Whether you're a first-time homebuyer or looking to downsize without sacrificing style, this townhome checks all the boxes. Don't miss out on making 1621 Eagle Creek Dr your new address!"
    }
  ],
  "page_4": [
    {
      "url": "https://www.realestate.com.au/international/us/180-holmes-corner-drive-smithfield-nc-110099042401/",
      "price": "AUD $360,414",
      "location": "180 Holmes Corner Drive, Smithfield, NC 27577",
      "description": "Come tour 180 Holmes Corner Dr the Sydney at Wilson's Ridge!Welcome to Wilson's Ridge! Our Sydney townhomes greet you with open concept living. Chefs kitchen w/ stainless steel appliances, quartz countertops, shaker cabinets and tons of countertop space. First floor provides Large living room , dining area and a quite study room. The second floor offers a primary bedroom suite with a spacious walk In closet, and two secondary bedrooms. Relax and enjoy some fresh air on your back patio. Amenities in this brand new community include large and small dog park, playground, pavilion, cornhole area, and pocket park with firepit and seating area.. *Photos are for representation only*"
    },
    {
      "url": "https://www.realestate.com.au/international/us/1580-state-highway-357-sidney-ny-110099042402/",
      "price": "AUD $748,944",
      "location": "1580 State Highway 357, Sidney, NY 13849",
      "description": "Property is occupied. DO NOT VISIT!  Own your own piece of a country paradise with 123 acres of land. This property has approximately 25 acres of open field and 81 acres of wooded mountain and 3,757 feet of stream down the middle. Easy access right off of Interstate 88 right on a state road! There is a large two car garage with machine shed access behind it. Also a large old barn and fence in area fit animals making this your classic farmhouse setting! House details and features are from an old listing as there has not been access to the interior of the home."
    },
    {
      "url": "https://www.realestate.com.au/international/us/10265-gandy-boulevard-n-st-petersburg-fl-110099042403/",
      "price": "AUD $224,683",
      "location": "10265 GANDY BOULEVARD N, ST PETERSBURG, FL 33702",
      "description": "Welcome to this charming 2-bedroom, 2-bathroom condo located in the sought-after Itopia community in St. Petersburg, Florida. This spacious home features a thoughtfully designed split floor plan, providing privacy with each bedroom having its own en-suite bathroom and walk-in closet. The open-concept living area seamlessly blends the kitchen, dining, and living spaces, offering a perfect environment for entertaining or relaxing. An indoor laundry room adds extra convenience for modern living.Step outside to enjoy your generous-sized screened-in porch, ideal for morning coffee or evening relaxation while overlooking the peaceful surroundings. The gated Itopia community offers fantastic amenities, including 2 resort-style pools and hot tubs, clubhouse, tennis courts, volleyball, dog park, and more, ensuring there's always something to do.This condo received no damage from the past hurricanes. Location is key! This condo is just minutes away from shopping, dining, and entertainment options, with the stunning Gulf beaches nearby. Enjoy easy access to I-275, providing a quick commute to downtown St. Petersburg and Tampa, making it the perfect location for both work and play.For investors, market rent on this unit is about $1850/month yielding a healthy annual return.Don’t miss the opportunity to make this your new home!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/7765-penwood-court-lake-worth-fl-110099042404/",
      "price": "AUD $997,032",
      "location": "7765 Penwood Court, Lake Worth, FL 33467",
      "description": "Welcome to you beautiful Large 4 bedroom 2 bath home in Lake Charleston. Featuring generous half-acre lot on a quiet cul-de-sac.Bright open living in kitchen to family room'Split bedrooms. 2017 newer roof.  New SS Kitchen Appliances. A rated schools.Lake Charleston: features: Clubhouse, community pool, pickleball,tennis, soccer fields,playgrounds,bike-jog , basketball."
    },
    {
      "url": "https://www.realestate.com.au/international/us/113-ne-8th-place-cape-coral-fl-110099042405/",
      "price": "AUD $507,098",
      "location": "113 NE 8th Place, Cape Coral, FL 33909",
      "description": "Turnkey pool home with city utilities in and assessments paid, seller offering a $10,000 credit towards a new roof at closing and NO flood insurance required!This charming 3-bedroom, 2-bath pool home features an expansive screened lanai with a heated pool, integrated spa, and a fully fenced backyard—perfect for kids, grandkids, or pets.Inside, you'll find soaring vaulted ceilings and a bright, open floor plan. The updated kitchen boasts white cabinetry, quartz countertops, a glass tile backsplash, and stainless-steel appliances. Interior walls are painted in coastal tones, and luxury vinyl plank flooring runs throughout the home.The split bedroom layout offers privacy for the spacious primary suite, which includes a walk-in closet, an ensuite bath with tiled shower, and a view of the backyard. Two generously sized guest bedrooms share a guest bath featuring a quartz vanity and tub/shower combo.The screened lanai spans the width of the home and includes a cozy under-truss sitting area, ideal for outdoor dining or relaxing by the pool and spa.This property has a strong history as a successful short-term rental and is conveniently located near Pine Island Road—just minutes from restaurants, shopping, healthcare, entertainment, schools and more.  Recent updates include new AC 2024 and accordion shutters 2021.Whether you're looking for a primary residence, vacation home, or investment property, this one checks all the boxes.  Call today to schedule your private showing!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/rio-grande-est-u-v-b1396-l15-belen-nm-110099042406/",
      "price": "AUD $1,872",
      "location": "Rio Grande EST (U:V B1396 L15), Belen, NM 87002",
      "description": "This half acre is just 1.24 miles to the Manzano Expy! Great for a commute. Enjoy a quiet life here in the country near Belen, where you can dine and shop just a short drive away. You will love having land of your own, under bright blue skies! Make your dream home plans today, and know that you are making a great choice for today and your future! Nearby Rio Communities is a growing development. Take your next step by contacting us. We are NM land experts - here to help you make your dreams a reality!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/1676-ne-ozark-drive-lee-s-summit-mo-110099042396/",
      "price": "AUD $1,014,039",
      "location": "1676 NE ozark Drive, Lee's Summit, MO 64086",
      "description": "Extraordinary opportunity to own an acre plus water front lot on Prairie Lee Lake in Lee's Summit. Located on deep water, it is an ideal spot for your personal dock. Build your dream home without neighborhood restrictions. Beautiful views of the lake with plenty of room to build."
    },
    {
      "url": "https://www.realestate.com.au/international/us/2-s-4420-road-adair-ok-110099042397/",
      "price": "AUD $116,242",
      "location": "2 S 4420 Road, Adair, OK 74301",
      "description": ""
    },
    {
      "url": "https://www.realestate.com.au/international/us/2302-butterfly-palm-way-kissimmee-fl-110099042398/",
      "price": "AUD $397,877",
      "location": "2302 BUTTERFLY PALM WAY, KISSIMMEE, FL 34747",
      "description": "GROUND FLOOR, Handicap Accessible 3 bed + 2 bath in wonderful community just minutes from Disney World and so many other Orlando area attractions. Welcome to the 24-hour GUARD-Gated + Resort Style Community of Windsor Palms- the best place to spend your winters if you come from the cold! This turnkey condo can be your full-time residence or utilized as an INCOME-producing SHORT or long term rental. Unit has a history of strong occupancy and all current bookings convey with the sale so that you can start making money on day 1. Unit comes FULLY FURNISHED and nicely equipped; kitchen has quality appliances, soft close drawers, and granite counters. Split floorplan - the primary suite is on one side and the guest bedrooms share a bathroom on the opposite wing. Screened in lanai is perfect for enjoying a good book or morning coffee. EASY, low maintenance living - CABLE, INTERNET, grounds care, trash valet, water, and resort's amenities are all included! Just steps from the community clubhouse area, which has an Olympic sized pool, fitness and business centers, 50+ seat movie theatre + lounge area, and private convenience store. Additional outdoor recreation includes tennis, basketball + volleyball courts, and playground. Plenty of open parking. Quality construction from nationally-recognized homebuilder, Pulte Homes. Great Central Florida location – many shops and restaurants nearby (including the Margaritaville area and Flamingo Crossing) and close to major highways making for an easy commute to just about everywhere. Come check this one out, you’ll be glad you did!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/160-magnolia-way-deland-fl-110099042391/",
      "price": "AUD $76,299",
      "location": "160 Magnolia Way, Deland, FL 32724",
      "description": "Welcome to your new home!  Open concept home with an inviting living room.  A lot of natural light in the living room. The dining room also has beautiful built-in China cabinets. The kitchen is welcoming and in the front of the home, there is a nice window to look out while washing your dishes! The main bedroom is very nice with a walk-in shower in the bathroom. The walk-in closet is large and able to handle a lot of clothing. The large tree provides not only beauty, but shade!  There is an extra closed-in room by the living room for additional living space! Also, this home is partially furnished and has some dishes, pots, pans, and furniture to get you started. You will love to sit out and enjoy the wonderful Florida weather.  There is a patio on the back of the home for grilling! The carport is large enough for 2 vehicles, and the shed was converted to a workshop and laundry room, complete with washer and dryer, and a generator. Also, this home has a brand new central heat and air unit. This home needs a new family! 160 Magnolia Way, Deland, FL. $48,900 What a steal!!!!.... Call Ann to schedule a tour today"
    },
    {
      "url": "https://www.realestate.com.au/international/us/516-w-16th-street-okmulgee-ok-110099042392/",
      "price": "AUD $18,724",
      "location": "516 W 16th Street, Okmulgee, OK 74447",
      "description": "Investor Special.  1 Bed/ 1 Bath.  Needs some work on the interior.  Was previously a rental."
    },
    {
      "url": "https://www.realestate.com.au/international/us/710-e-lodge-drive-tempe-az-110099042393/",
      "price": "AUD $912,776",
      "location": "710 E LODGE Drive, Tempe, AZ 85283",
      "description": "Beautifully updated modern classic, close to ASU, Western Canal Path, major freeways, & Trader Joe's. Bright & open living spaces, perfect for both entertaining & everyday living. 4 bdrm, 2 bath split floorplan in Tempe. Kitchen offers abundant granite countertop space, stainless steel appliances, & a layout designed for both cooking & conversation. Spacious bedrooms & recently updated bathrooms w/marble floors provide plenty of room to relax, including primary suite w/ direct backyard access. A large laundry room w/space for storage adds extra convenience. Enjoy Arizona evenings under a covered patio adorned with charming bistro lights, surrounded by beautifully landscaped grounds that offer serenity & privacy. Don't miss this perfect mix of charm, comfort, & location!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/0001-e-1630-road-elmore-city-ok-110099042394/",
      "price": "AUD $124,668",
      "location": "0001 E 1630 Road, Elmore City, OK 73433",
      "description": "Welcome to the Rush Creek Ranch, where Lot 1 offers a rare chance to own a slice of paradise! This large 10 acre tract blends natural beauty with endless possibilities. Picture a diverse landscape of pecan and oak trees, paired with lush native grasses.  The land teems with wildlife, from trophy whitetail deer to roaming turkeys, making it a hunter’s dream.Numerous potential home sites are available on this lot, inviting you to build your dream home amid stunning views. Whether you envision a cozy homestead or a small ranch, this lot has the space for gardens, livestock, or even horses. Modern living is within reach, too—rural water, power, and high-speed fiber internet are all available right at the road.Location seals the deal. Just 10 minutes from I-35, you’re an hour from Oklahoma City and two and a half hours from Dallas/Fort Worth. It’s the best of both worlds: a peaceful retreat far from the hustle, yet close enough to city amenities. Lot 10 at Rush Creek Ranch isn’t just land—it’s an opportunity to live the life you’ve always wanted.  Additional land is available.  All showings are by appointment only. If you would like more information or want to schedule a private viewing, please contact David Thoming at (405) 886-4152."
    },
    {
      "url": "https://www.realestate.com.au/international/us/114-n-french-street-sullivan-in-110099042395/",
      "price": "AUD $216,882",
      "location": "114 N French Street, Sullivan, IN 47882",
      "description": "Welcome to 114 N. French St. in Sullivan, IN. This recently updated 1,380 sq. ft. home offers two spacious bedrooms and one and a half baths. Enjoy the enclosed patio, perfect for entertaining. Additionally, there is a  two car detached garage providing off-street parking or extra space for storage. Situated in the heart of Sullivan, this property is an excellent opportunity for homebuyers or those seeking a fantastic rental investment. Don't miss out on this home - schedule your showing today!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/165-wyckoff-road-eatontown-nj-110099042388/",
      "price": "AUD $341,706",
      "location": "165 Wyckoff Road, Eatontown, NJ 07724",
      "description": "Exciting investment opportunity near the future Netflix Studios! Welcome to the upper level unit at Laurel Gardens - a renovated gem located just minutes from the highly anticipated Netflix Studios at Fort Monmouth. With this major entertainment hub, poised to boost the local economy, this property offers not only a stylish living space but also incredible investment potential. The modern unit boasts sleek hardwood floors, contemporary finishes, and a bright, open-concept layout that caters to stylish living or rental potential. Residents enjoy access to an onsite lap pool and a prime location just a short drive to gorgeous beaches, vibrant boardwalks, and top-rated dining spots. Don't miss your chance to own at this hot spot at the Jersey Shore!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/1207-makarios-dr-st-augustine-beach-fl-110099042385/",
      "price": "AUD $1,090,650",
      "location": "1207 Makarios Dr, St Augustine Beach, FL 32080",
      "description": "Step Into A Life Of Barefoot Elegance On Anastasia Island. This Beautifully Renovated Makarios Carriage Home Situated Just Off A1a Along The Golden Mile Of St. Augustine Beach,Steps To The White Sand,Transcends The Standard.  The Spacious,Luxury-inspired Three Bedroom,Two Bath Home With Bonus Library Room Is In A League Of Its Own,Featuring Top-of-the-line Finishes And A Grand Living Area Leading To A Private Screened Balcony,Ideal For Entertaining And Enjoying The Relaxed Coastal Lifestyle. Walk Or Bike To All Cafes,Boutiques,And Nightlife Or Take A Dip In One Of The Two Sparkling Community Pools.,Imagined And Designed With Soft Coastal Hues In Mind,The Immaculate Renovations Include Full Interior Paint,Solid Hardwood Flooring,New Floor-to-ceiling Cabinetry With Under-counter Lighting And Elegant Granite Countertops. Elevated Designer Lighting And Custom Shutters Add An Element Of Sophistication Throughout The Home.  This Lock-and-go Beach Retreat Is Move-in Ready And Offers The Perfect Combination Of Modern Updates,Idyllic Island Living And An Unbeatable Location.  Nothing Compares."
    },
    {
      "url": "https://www.realestate.com.au/international/us/117-nutbush-creek-lane-norlina-nc-110099042386/",
      "price": "AUD $475,892",
      "location": "117 Nutbush Creek Lane, Norlina, NC 27563",
      "description": "JUST COMPLETED:  Long-awaited NEW CONSTRUCTION w/ 2-car GARAGE convenient to US 1, Norlina, Warrenton, Henderson, & South Hill, VA. Offering open-concept living area, spacious owner's suite, plus two additional bedrooms & a second full bath. 9-ft ceilings, upgraded trim package, front porch, rear concrete patio, concrete drive, laundry room and huge primary bedroom walk-in closing.  City water & sewer. Appliances include dishwasher, electric smooth-top range, & BI microwave. Fiber cement siding. LVP flooring in living areas.  Carpet in BR's.  Hard tile in baths & laundry.  BRIGHTSPEED internet available. Don't miss this beautiful home!!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/307-miller-street-bloomingdale-ga-110099042387/",
      "price": "AUD $522,701",
      "location": "307 Miller Street, Bloomingdale, GA 31302",
      "description": "Imagine coming home to a quiet street, dinner simmering in the kitchen, and the backyard lit by sunset. 307 Miller Street isn’t just a house, it’s your next chapter. Where Comfort Meets Convenience in Bloomingdale, GA! Tucked away at the end of a quiet street in the peaceful heart of Bloomingdale, this charming home offers more than just a place to live, it offers a lifestyle. Step inside to a bright and airy living space filled with natural light, where the kitchen, dining, and living areas seamlessly flow together. Perfect for entertaining, working from home, or simply relaxing. Whether you're prepping pancakes on Sunday morning or keeping an eye on the game while cooking dinner, the layout just makes sense. Out back, you’ll find a fully fenced yard that wraps from front to back, with two matching sheds and a covered patio ideal for cookouts, gatherings, or letting the pets run free. Just minutes from Tanger Outlets, 8 minutes to I-16 and I-95, and less than an hour from the beach."
    },
    {
      "url": "https://www.realestate.com.au/international/us/8-ac-farrar-rd-bentonville-ar-110099042384/",
      "price": "AUD $1,872,360",
      "location": "8 AC Farrar  RD, Bentonville, AR 72712",
      "description": "+/- 8 acres of land available just outside city limits, offering the perfect opportunity to build your dream home, start a hobby farm, or simply enjoy peaceful country living. This prime location is less than 9 minutes from XNA, only 5 minutes from The Creeks Golf Course, and situated just a half mile from Highway 264, providing convenient access to nearby amenities. Located within the highly sought-after Bentonville School District, this property combines rural charm with top-tier educational opportunities. Electric service is available at the street, while a septic system and water well will be needed. The house currently on the property is set to be removed."
    },
    {
      "url": "https://www.realestate.com.au/international/us/8000-badura-avenue-las-vegas-nv-110099042383/",
      "price": "AUD $327,663",
      "location": "8000 Badura Avenue, Las Vegas, NV 89113",
      "description": "Yes you can have it all at an affordable price!  This First floor unit is one of the most popular layouts available!  The condo includes granite counters throughout the home as well as the shower, all appliances included, and covered parking nearby.  The community is located in the ever popular Southwest market, just off the 215 freeway.  Inside the gated community, residents enjoy an exercise facility, pool, open green spaces, and a clubhouse!  Visit today and make this one yours!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/1502-holly-rd-charlottesville-va-110099042381/",
      "price": "AUD $1,092,210",
      "location": "1502 HOLLY RD, CHARLOTTESVILLE, VA 22901",
      "description": "OPEN HOUSE Saturday 4/26 and Sunday 4/27, 2pm-4pm. For the open house, please park on the cul-de-sac to avoid a log jam in the driveway.  Only once in a while does such a distinctive and special property come on the market. This classic mid-century modern home designed by James Tully is quietly nestled on 2 lots totaling one acre. Imagine living in the city of Charlottesville on an acre of woods! The ceiling to floor windows, skylights and innovative design create what others only immitate."
    },
    {
      "url": "https://www.realestate.com.au/international/us/104-eagle-heights-maysville-ga-110099042382/",
      "price": "AUD $700,419",
      "location": "104 Eagle Heights, Maysville, GA 30558",
      "description": "Better Than New! Seller incentives offered plus Lender credits offered that can be used towards closing costs if Preferred Lender is used.  Reach out for details.  Stunning 4 Bed, 3 Bath Home with Upgrades Galore!  This beautifully designed 2023 built home offers a spacious open-concept floor plan with high-end finishes throughout.  The gourmet eat-in kitchen offers custom cabinetry, granite countertops and stainless steel appliances.  The large dining area flows seamlessly into the extra large great room perfect for entertaining!  This floor plan is the ideal layout with the expansive primary suite with a spa like en-suite bath featuring quartz backsplash around the soaking tub.  A thoughtfully designed in-law or roommate friendly plan, including a secondary bedroom with its own en-suite bath.  Relax on the covered back porch, complete with TV hookup - perfect for game days!  Shopping and restaurants close by - 10 minute drive to Tanger Outlets.  ***Tons of Upgrades***    12 x 20 Derksen storage building with electricity, lights and plugs - great for extra storage and/or workshop.    Hot water recirculating system for virtually instant hot water throughout the home.    Electric blinds for convenience and style.    Energy-efficient insulation added to the attic and over the garage.    Last but not least - a full irrigation system covering all four sides of the property!  This home is truly move in ready with top tier upgrades you will not find in new construction.  Schedule your showing today!!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/1652-exchange-street-20-okoboji-ia-110099042380/",
      "price": "AUD $326,103",
      "location": "1652 Exchange Street 20, Okoboji, IA 51355",
      "description": "From location, views and storage, this charming second-floor condo has it all. Just minutes from the lake, walking/biking trails and city center, it features 2 bedrooms, 2 bathrooms, and a cozy fireplace, creating a welcoming atmosphere throughout. The south and west-facing windows in the kitchen/dining room offer abundant natural light and beautiful views. The condo's end-unit location gives added privacy and a bright, open layout. The added benefit of 2 garages allows parking plus storage. The property is conveniently situated near shopping, a movie theater, and other local amenities. Plus, it backs up to a peaceful bike trail, offering a serene outdoor escape right in your backyard. Ask your agent to provide you with the seller-paid inspection report. Don’t miss the opportunity to make this delightful condo your new home!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/501-dargan-place-sw-atlanta-ga-110099042378/",
      "price": "AUD $826,803",
      "location": "501 Dargan Place SW, Atlanta, GA 30310",
      "description": "Imagine walking out to the front porch and waking up to a great park view, where living in AMAZING Historic West End #westendbestend. Prepare to be awestruck by this stunning  *National Historic Register* 1920s single-family home in the vibrant West End, where history meets modern comfort! With 1,700 square feet of beautifully updated space, this enchanting residence features 3 spacious bedrooms and 2 tastefully designed bathrooms that will leave you breathless. Revel in the charm of original stained glass and hardwood floors, complemented by soaring 12-foot ceilings that fill each room with an abundance of natural light.Enjoy peace of mind with a brand new HVAC system, roof, and water heater while being just minutes away from Morehouse, Spelman, the West End Marta station, and the bustling Beltline filled with amazing breweries. The local Kroger is just a walk/bike ride away as well. This home is a true gem—experience its captivating energy and make it yours today! Your view from your huge front porch is peaceful West End Park."
    },
    {
      "url": "https://www.realestate.com.au/international/us/75-pecan-bend-lane-broken-bow-ok-110099042376/",
      "price": "AUD $973,627",
      "location": "75 Pecan Bend Lane, Broken Bow, OK 74728",
      "description": "Nestled on 2.48 m/l wooded acres in Hoocahtown/Broken Bow, Oklahoma, this classic log cabin aka \"Northern Exposure\" offers 2,057 m/l square feet of luxury living space. Built in 2006, the home features 3 bedrooms and 2.5 bathrooms, comfortably accommodating at least 8-10 people, could be more if you add bunkbeds. Equipped with a 50\" TV in the living room and a retro video game console along with foosball game area. The kitchen is equipped with stainless steel appliances, a single oven, and granite countertops, highlighted by ceiling fans throughout. Additional amenities include central heating and cooling, ceiling fans, hardwood and tile flooring, window treatments, and a laundry room with washer and dryer. New HVAC February 2024 includes a 10 year warranty. Expansive windows throughout the cabin provide stunning treetop views, while the open-concept living area boasts a large rock fireplace, dining space. Outside includes a 2,887 square-feet for the deck and wrap-around porch, both covered and open. Features a six-person hot tub, perfect for relaxation. Not far from Hoochatown for fun activities and visit the lake. Extra outside storage under that deck. Approximately 1.5 miles to Hoochatown Distillery and Shuck Me and about 3 miles to Girls Gone Wine. This is an Active Airbnb property, great investment opportunity. Priced below 2022 Appraisal. The property also offers ample space for the construction of additional cabins, enhancing its potential. Property being sold fully furnished."
    }
  ],
  "page_5": [
    {
      "url": "https://www.realestate.com.au/international/us/1019-college-street-griffin-ga-110099042377/",
      "price": "AUD $405,678",
      "location": "1019 College Street, Griffin, GA 30224",
      "description": "Charming House 5-Bedroom, 2-Bath Investment Opportunity in an Up-and-Coming Area This spacious property offers incredible versatility and investment potential. Currently operating as a fully occupied rooming house, it generates steady income while presenting an excellent opportunity for a new owner. Alternatively, the home can be converted into a beautiful single-family residence, perfect for those seeking a spacious layout. Located in a rapidly developing neighborhood, this property boasts 5 bedrooms and 2 bathrooms, providing ample space for tenants or a large family. The home features plenty of natural light, a functional layout, and endless possibilities for customization. Whether you're an investor looking for a high-performing rental or a homeowner with a vision, this property is a must-see. With the area experiencing growth and development, now is the perfect time to secure your spot in this vibrant community. Don't miss out on this unique opportunity-schedule your showing today!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/121-forman-way-aynor-sc-110099042373/",
      "price": "AUD $405,676",
      "location": "121 Forman Way, Aynor, SC 29511",
      "description": "Discover your dream home at 121 Forman Way! This brand-new Home Placer Clayton Homes Pearl model offers 4 bedrooms, 2 bathrooms, and 1,904 square feet of modern living space, all situated on a generous 1.14-acre lot with no HOA restrictions. Bring your boats, trailers, RVs, and toys - there's plenty of room to enjoy them all!  Step inside this stunning home, available for on-site tours and walkable viewings, and experience the perfect blend of comfort and freedom. Located just minutes from Highways 22 and 31, you’re only 35 minutes away from the beach and all the excitement of the Grand Strand, while still enjoying the peace and tranquility of country living.  Key Features:  Brand New Home Placer Clayton Homes Pearl Model 4 Bedrooms, 2 Bathrooms 1,904 Sq Ft of Living Space 1.14 Acres - No HOA Ideal for Boats, RVs, and Outdoor Toys Close to Highways 22 & 31 35 Minutes to the Beach Don’t miss this incredible opportunity to own a slice of paradise at an unbeatable price. Schedule your tour today and see why 2858 Moores Mill Rd is the perfect place to call home!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/0-county-line-road-brighton-il-110099042374/",
      "price": "AUD $124,824",
      "location": "0 County Line Road, Brighton, IL 62012",
      "description": "TRACT 6Located just minutes away from access to I-255, this 5+/- acres tract offers a mostly open building site. Previously used as pastureland, this property could possibly be suitable again for livestock. There are a variety of tracts available at this location. Subject to final survey. Buyer to verify access to local utilities. Tax amount is an estimate due to it being split from a larger parcel and should be verified with the county."
    },
    {
      "url": "https://www.realestate.com.au/international/us/428-vista-dr-murrells-inlet-sc-110099042375/",
      "price": "AUD $2,496,480",
      "location": "428 Vista Dr., Murrells Inlet, SC 29576",
      "description": "Embrace the ultimate beach lifestyle at this charming coastal retreat! Discover your own slice of paradise in this soon to be constructed 6 bedroom, 5 bathroom beach house, complete with a sparkling private pool and outdoor kitchen. Perfect for families seeking a primary residence, a second home, or a savvy investment opportunity! Just steps away from the pristine shores, enjoy endless days of sun, sand, and surf. Explore nearby attractions such as Murrells Inlet, renowned as the 'Seafood Capital of South Carolina,' offering an array of outdoor adventures and culinary delights. Your dream beach escape awaits!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/2053-brofford-drive-columbus-oh-110099042371/",
      "price": "AUD $655,170",
      "location": "2053 Brofford Drive, Columbus, OH 43235",
      "description": "NEW ON MARKET! OPEN HOUSES 4/25, 4-6PM plus 4/26 & 4/27, 1-4PM! Beautifully Remodeled 3-Level Split in Dublin Schools! This move-in ready home has been thoughtfully updated throughout, offering modern style and comfort in every corner. The former dining room wall was removed to create an open-concept kitchen and eating area, perfect for everyday living and entertaining. The remodeled kitchen features stainless steel appliances, a large island with pendant lighting, granite countertops, new cabinets, a stainless steel under-mount sink, crown molding, laminate flooring, and canned lighting! A new sliding glass door leads to the fenced backyard with a poured concrete patio, perennial gardens, and a storage shed—an ideal outdoor retreat. Exterior updates include new vinyl siding with cedar shake accents and new vinyl windows throughout. The home also boasts a gas furnace, AC, gas hot water tank and an energy-efficient thermostat all new in 2013. Both bathrooms have been renovated with new tile floors, updated vanities, and modern toilets. The home also features new lighting throughout, giving every space a fresh, bright feel. Upstairs you'll find 3 bedrooms and a full bath, while the lower level offers another full bathroom and a cozy family room with a wood-burning fireplace. The laundry room includes a stackable washer (2025) and dryer (2017), as well as a utility sink.The garage is insulated and drywalled with a newer LiftMaster opener & keypad, built-in workbench, cabinets, bifold closet with shelving, lighting, and even a TV mount—perfect for projects or extra flex space. Every detail has been considered—don't miss the opportunity to make this beautifully updated home yours!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/211-loch-alsh-drive-chalfont-pa-110099042372/",
      "price": "AUD $651,425",
      "location": "211 LOCH ALSH DRIVE, CHALFONT, PA 18914",
      "description": "Welcome to 211 Loch Alsh Dr, Chalfont, PA! Located in the highly sought-after The Highlands community within the award-winning Central Bucks School District, this beautiful townhome offers both comfort and convenience. The main floor features hardwood flooring throughout, a spacious kitchen with electric  cooking and a breakfast room that opens to a large deck'perfect for entertaining. The bright and airy living room opening to the formal dining room allows a nice flow for dinner parties. An updated powder room conveniently completes the main level. Upstairs, the primary suite boasts a walk-in closet and a private en-suite bath. Two additional generously sized bedrooms share the hall bath. The upstairs laundry adds to the home's practicality. The fully finished basement is a standout feature, offering a custom-built wet bar with built-in shelving and accent lighting, plus a walkout to a charming brick patio; ideal for relaxation or hosting guests! Enjoy the convenience of being close to shopping, dining, outdoor fun at Lake Galena, and the culture offered in close-by Doylestown. Don't miss this fantastic opportunity to own a home in a prime location! Please reach out for a private tour! Showings begin at Friday's Open House!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/5599-dublinshire-drive-dublin-oh-110099042369/",
      "price": "AUD $920,421",
      "location": "5599 Dublinshire Drive, Dublin, OH 43017",
      "description": "Welcome home to this beautiful home nestled in one of Dublin's most sought-after neighborhoods. With nearly 3000 sq ft of living space, this residence sits on a generous and private 0.52-acre lot that is surrounded by mature landscape and bordered by a serene stream. Inviting curb appeal greets you outside and inside you find a two-story foyer adorned with hardwood flooring, leading to a thoughtfully designed layout featuring extensive millwork and solid 6-panel wood doors throughout. The main level boasts a formal living room, a vaulted family room with skylights and cozy fireplace, and a well-appointed kitchen perfect for entertaining. Upstairs, the expansive primary suite offers a serene retreat, complemented by three additional bedrooms that provide comfort and flexibility for family or guests. The home's design ensures both functionality and elegance, making it ideal for modern living. Outside, the property features a spacious backyard, perfect for outdoor activities and gatherings. Its prime location places you within walking distance to Wyandot Elementary School, community pools, parks, and a variety of shopping and dining options, ensuring convenience and a vibrant lifestyle. This home presents an exceptional opportunity to own a piece of Dublin's charm with a convent location to shopping, dining, and just feet from the community pool, parks and school."
    },
    {
      "url": "https://www.realestate.com.au/international/us/9130-sw-101st-ave-miami-fl-110099042370/",
      "price": "AUD $1,318,454",
      "location": "9130 SW 101st Ave, Miami, FL 33176",
      "description": "East Kendall home. Great location. Home features 3 bedrooms, 2 baths , a charming round kitchen , very unique and great for entertainment. Spacious formal living room, formal dining and a family room. Volume ceilings. One car garage and a large covered terrace ideal for relaxing or hosting gatherings. Ample space for a pool. This home is ready for your personal touch. It has a carport on the side. This is a great neighborhood with easy access to Palmetto Expressway or the turnpike. Very close to Baptist Hospital, shopping centers , restaurants. and easy access to Kendall Drive. Owner willing to to do Seller financing with 20% down payment. Private lending terms to be discussed."
    },
    {
      "url": "https://www.realestate.com.au/international/us/66-v-street-lake-lotawana-mo-110099042368/",
      "price": "AUD $1,170,225",
      "location": "66 V Street, Lake Lotawana, MO 64086",
      "description": "Lake life with acreage! Large, custom built home perched on two lake lots with a circle drive and lake views. An adjoining lot in the rear of the home totals four peaceful, private acres. The property includes a covered well dock with a powered boat lift on a wide code with amazing sunset views. Walk into a great room with soaring vaulted ceilings, large windows overlooking a wraparound deck, and a three-sided see-through fireplace. Large kitchen island with granite countertops and tile backsplash. Eat in kitchen and formal dining area. Main level primary suite and second bedroom with brand new carpet and paint. Upstairs has two large bedrooms, a full bath and loft area overlooking the main level. Plenty of room for guests in the expansive, walk out basement with a second kitchen, see through, three-sided fireplace, great room, non-conforming fifth bedroom and storage area. Basement walks out to a covered patio with hot tub that stays with the home! Four garage spaces, two on the main level and two on the side of the home with extra workshop space. Tons of parking space, a rarity in Lake Lotawana. Fenced in area in the back yard and a deck that wraps around the entire home. Easy dock access with no steps, accessible by golf cart. Lake Lotawana is a sought-after location with Kansas City's only waterfront restaurant accessible by boat. Take your golf cart just a few miles away to the community playground, tennis courts, restaurants, brewery, and coffee shop. There is always something to do in this community; fishing tournaments, ski, sailing, kayaking and community events, and so much more."
    },
    {
      "url": "https://www.realestate.com.au/international/us/6010-maria-avenue-suitland-md-110099042363/",
      "price": "AUD $592,914",
      "location": "6010 MARIA AVENUE, SUITLAND, MD 20746",
      "description": "Welcome to this lovingly maintained split foyer home, offering 2 bedrooms and 2 bathrooms. The property can be brought back to its original three bedrooms. Nestled in a peaceful neighborhood, this charming residence features a spacious layout, perfect for comfortable living. The home boasts a bright and airy living room, ideal for relaxing or entertaining guests.The well-kept kitchen flows seamlessly into the dining area, making meal preparation and hosting a breeze. The lower level includes an additional living space, providing flexibility for a home office, den, or additional entertainment area.For your convenience, an attached two-car garage ensures ample parking and storage. There is an additional driveway space for two more vehicles. The generous backyard offers endless possibilities, whether you're looking to create an outdoor oasis, garden, or simply enjoy the open space.This home is a true gem—move-in ready and just waiting for you to make it your own!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/1300-shoshone-drive-camp-connell-ca-110099042364/",
      "price": "AUD $965,826",
      "location": "1300 Shoshone Drive, Camp Connell, CA 95223",
      "description": "Escape to this classic tri-level chalet nestled on an oversized 0.76-acre lot in desirable Big Trees Village. With a full bathroom on each level and flexible living spaces, there's room for everyone to relax and unwind. Soaring chalet windows and vaulted ceilings in the great room offer treehouse-style views of the surrounding forestespecially magical when the snow is falling. The main level features an open-concept living area, kitchen, two bedrooms, and a full bath. Upstairs, the spacious loft is perfect for additional sleeping space or a cozy retreat. The lower level serves as a fourth bedroom with plenty of room for games, movie nights, or guests. Step outside to a large wraparound deck ideal for morning coffee or evening stargazing. Optional Big Trees Village HOA amenities include pools, tennis, bocce, and more. Located in Camp Connell, just minutes from the Stanislaus River, Big Trees State Park, and Bear Valley Ski Resortthis is your perfect mountain escape."
    },
    {
      "url": "https://www.realestate.com.au/international/us/322-windrush-boulevard-indian-rocks-beach-fl-110099042365/",
      "price": "AUD $858,009",
      "location": "322 WINDRUSH BOULEVARD, INDIAN ROCKS BEACH, FL 33785",
      "description": "Welcome to your dream waterfront townhome condo, perfectly nestled along the serene Intracoastal Waterway. Units had no storm damage from hurricanes. This 2-bedroom, 2.5-bath gem offers a harmonious blend of luxury, comfort, and convenience. Step inside to discover a spacious living/dining room combo with expansive water views, flowing seamlessly to a large private balcony where you can relax and take in the sights of playful dolphins, passing boats, and jet skis. The oversized eat-in kitchen is a chef’s delight, featuring beautiful granite countertops and ample cabinetry for all your culinary needs. The generously sized primary suite is a true oasis, boasting breathtaking water views and a walk-in closet and additional space for all your storage needs. Hurricane windows and shutters give you peace of mind. An in-unit laundry and numerous closets throughout make everyday living a breeze.This home also offers incredible community amenities, including a sparkling pool and a deeded boat slip, perfect for boating enthusiasts. Parking is effortless with four assigned under-building parking spots. Located just a short stroll from the beach, you’ll enjoy easy access to sandy shores, stunning sunsets, and a variety of local restaurants and entertainment. With no pet restrictions and a 30-day minimum rental period, this property offers exceptional flexibility for both personal use and rental potential. Don’t miss your chance to own this slice of paradise—schedule your private tour today!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/5533-97th-way-n-st-petersburg-fl-110099042366/",
      "price": "AUD $686,376",
      "location": "5533 97TH WAY N, ST PETERSBURG, FL 33708",
      "description": "COME AND ENJOY THIS HOME THAT IS NESTLED IN THE TREE LADEND NEIGHBORHOOD OF BAY PINES ESTATES. THIS HOME IS LOCATED ACROSS FROM THE VA HOSPITAL AND LESS THAN 2 MILES TO THE BEAUTIFUL SANDY BEACHES. ALSO, KESWICK CHRISTIAN SCHOOL IS WITHIN 1/4 MILE. THE KITCHEN HAS A BAY WINDOW TO ENJOY YOUR MORNING COFFEE.  THERE IS ALSO A WOOD BURNING FIREPLACE. THE HV/AC IS APROXIMATLEY 6 MONTHS OLD AND IS A TRANE SYSTEM. THERE IS AN INSIDE LAUNDRY ROOM WITH SO MUCH STORAGE. THE BACK YARD BACKS UP TO THE PINELLAS TRAIL.  ALSO HAS AN OUTDOOR KITHEN WITH A GREEN EGG SMOKER INCLUDED. THERE IS A SHED (WORKSHOP) FOR YOUR OUTDOOR EQUIPMENT WITH ELECTRIC. THE SQUARE FOOTAGE WAS MEASURED BY THE OWNER. THIS LOCATION IS AMAZING, SO MANY RESTARAUNTS, WALMART, STARBUKS, HAIR SALON, NAIL SALON, DUNKIN DONUTS, SANDWICH SHOP ALL WITHIN 1/2 MILE OF THIS HOME.."
    },
    {
      "url": "https://www.realestate.com.au/international/us/13125-wilcox-road-largo-fl-110099042367/",
      "price": "AUD $522,701",
      "location": "13125 WILCOX ROAD, LARGO, FL 33774",
      "description": "POSITIVE CASH FLOW! NO MILESTONE SURVEY REQUIRED! FULLY FUNDED RESERVES! Only 6 minutes to the sugary sands of Indian Rocks Beach; here's an incredible opportunity to own an Absolutely Turn-Key Short Term Rental, curated with high-end furnishings, artwork, and accessories, right down to the towels in the bathrooms and the silverware and dishes in the kitchen cabinets! Live here full-time or come down as a Snow Bird for as long or short as you choose....OR begin earning money on short term rentals on Day One! NOT the usual tired-out, shabby thrift store furnishings for this beach property! Our little gem is offered with ALL the existing curated high-end furniture, artwork, accessories, Two 55\" Smart TV and supplies including a back-up inventory of hotel quality towels and bed linens! Completely Renovated in 2022, this Super Cute 1/1 boast New HVAC (2019), New Water Heater (2020), New High-Impact Vinyl Windows 2021. The totally renovated kitchen (2021) features beautiful white shaker cabinets, matching SS appliances, high end Granite Countertops and stacked Washer and Dryer, hidden in a clever Pantry! The Living Room is furnished with a beachy sleep sofa equipped with comfy gel foam mattress and a handcrafted surfboard coffee table!. Fun, whimsical and handcrafted furniture and accessories adorn the entire condo. The Large bright bedroom features a new bed frame w/headboard and high-end GelFoam Mattress (07/2022)! The large and breezy and fully furnished screened lanai opens onto the serene park-like grounds, featuring a beautiful fountain! Keyless remotely-programable Smart Lock system enables multiple custom passcodes allowing for contactless check-in of guests and cleaning crew as well as the New Owner! The community features a large centrally located pool, lounging area and barbecue grill, just a 2 minute walk from the unit! \"Casita Playa\", as we lovingly refer too our adorable condo, is nestled in a quiet residential neighborhood but easily accessible to a myriad of restaurants, bars, night life, shops and beaches. The Southwest Recreational Complex is right across the street which has workout facilities, olympic lap pools, park and activities that open to the general public! Several Epic Nature Parks are within a bike ride away and of course the many World Class Gulf Beaches are minutes away as well. No Flood Zone (X) Non-Evac Zone These building are only two stories which avoids the current very expensive Milestone Inspection requirements on 3 or more story high condo buildings. There are currently no special assessments in the works. Despite condo documents stating otherwise, condo management is aware of, and has expressly sanctioned Short Term Rentals in this association. This sanction is not guaranteed to remain in place for any specified period of time. Cash Only, Listing Agent is Co-Seller of the property. This is an on-going STVR that is completely compliant with the rules and regulations of City of Largo and Largo Fire Dept. Rental history and Financials are available! Check out the 5-Star Reviews on our Airbnb and VRBO (link to listings furnished upon request)"
    },
    {
      "url": "https://www.realestate.com.au/international/us/s-mahan-street-ridgecrest-ca-110099042358/",
      "price": "AUD $29,646",
      "location": "S Mahan Street, Ridgecrest, CA 93555",
      "description": "Great opportunity to own a residential lot in an established Ridgecrest neighborhood. This 6,534 sq ft parcel is surrounded by existing homes and located near active development, offering easy access to nearby utilities. Ideal for a custom build or investment, with paved roads and neighborhood amenities just minutes away. Don't miss out on this build-ready lot in a growing community"
    },
    {
      "url": "https://www.realestate.com.au/international/us/4706-shale-place-tampa-fl-110099042359/",
      "price": "AUD $778,590",
      "location": "4706 SHALE PLACE, TAMPA, FL 33615",
      "description": "Step into your dream home! This stunning 3-bed, 2-bath gem is entirely move-in ready and packed with brand-new features. Enjoy a spacious open floor plan, perfect for entertaining friends and family.  This home offers: All-new stainless steel appliances, New windows and sliding doors, Updated plumbing and main sewer line, Water softener and water heater, Gutters and soffits.  Relax in the large screened lanai with an outdoor bar, ideal for gatherings. Plus, there's a charming deck where you can unwind in the fenced yard. With a state-of-the-art smart home security system, you'll feel safe and secure.  Nestled in a quiet cul-de-sac, this home provides easy access to the airport and shopping centers. Just move in and start enjoying the ultimate blend of comfort and convenience!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/3515-taylor-lane-milton-ga-110099042360/",
      "price": "AUD $2,223,428",
      "location": "3515 Taylor Lane, Milton, GA 30004",
      "description": "Exceptional Home in Prime Milton Location with Pool and Top Schools. You'll love this spacious, beautifully crafted traditional residence sitting on a level 1.19-acre lot with a finished basement. Step inside to an inviting open floor plan featuring 10’ ceilings, a dedicated study, and a formal dining room. The heart of the home is the gourmet kitchen, complete with stainless steel appliances, a 6-burner commercial gas range, a large natural stone island, a sunny breakfast area, and a walk-in pantry. The living room offers custom shelving and an abundance of natural light—perfect for both relaxing and entertaining. The main level also includes a guest bedroom with an en-suite bath, plus a convenient half bath for visitors. Upstairs, unwind in the luxurious primary suite featuring a tray ceiling, spa-like bath with his-and-hers vanities, soaking tub, glass-enclosed shower, and a spacious walk-in closet. A loft space plus three additional secondary bedrooms, one with an ensuite and the others including a shared jack and jill, round out the upper level. The full finished basement adds even more value with a large flex space, a media room, a full bath, and an additional bedroom—ideal for guests, in-laws, or a home gym. Outside, your private backyard oasis awaits. Enjoy the fenced-in, saltwater pool—perfect for warm southern summers and cooler days alike with Sonos exterior sound system, lighting, and professional landscaping. Conveniently located near premier shopping and dining options including Crabapple Market Village; Starbucks, Hyde Brewing, Playa Bowls, Publix (2.5 miles), Avalon, Downtown Alpharetta, and Historic Roswell.Don’t miss the opportunity to call this stunning property home—schedule your private tour today!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/10503-east-park-ave-houma-la-110099042362/",
      "price": "AUD $148,229",
      "location": "10503 East Park Ave, Houma, LA 70363",
      "description": "..."
    },
    {
      "url": "https://www.realestate.com.au/international/us/5333-simrak-street-north-port-fl-110099042350/",
      "price": "AUD $429,083",
      "location": "5333 SIMRAK STREET, NORTH PORT, FL 34287",
      "description": "CHARMING 3 Bedroom, 2 Bathroom home with a converted garage storage room, located in North Port. NO HOA FEES & NO FLOOD REQUIRED! CLICK ON THE VIRTUAL TOUR LINK 1 FOR THE VIDEO AND VIRTUAL LINK 2 FOR THE 3D TOUR. Featuring a bright & airy floor plan, tile & vinyl flooring throughout, plantation shutters, recessed & pendant lighting and MORE! Spend quality time with friends and family in an open living and dining room with large windows and a glass slider providing plenty of natural lighting. The kitchen offers ALL stainless-steel appliances, granite countertops, a breakfast counter, a cabinet pantry and plenty of cabinets for storage. The spacious master suite has French doors to the back yard, a built-in closet and a private bathroom with a single sink vanity and a walk-in shower. The guest bedrooms are a fantastic size with built-in closets and a shared guest bathroom nearby. Start your morning with a peaceful cup of coffee or unwind with your favorite evening beverage on the screened lanai, while soaking in the tranquil beauty of your private backyard. The former garage has been converted into a clean, enclosed storage space with finished walls and flooring, providing a versatile area ideal for storing household items, equipment, or seasonal belongings. Get ready for backyard fun in this fully fenced outdoor haven! Towering oak trees offer the perfect shade for sunny day adventures, while the spacious paved patio sets the scene for effortless entertaining—whether it's weekend BBQs, evening hangouts with friends, or cozy nights under the stars. This inviting outdoor haven is your own slice of nature, ideal for play, relaxation, and everything in between—no shoes required. 2022 ROOF - HURRICANE PROTECTION. Conveniently located within walking distance of McKibben park that has a play ground, basketball court, tennis court, shuffleboard, a fishing pier, pavilions, kayak & boat launch, walking trails and more! Also close to US-41 for easy access to local shopping, dining, LIVE entertainment and award-winning beaches! Schedule your showing TODAY!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/203-caledonia-drive-lafayette-la-110099042351/",
      "price": "AUD $218,442",
      "location": "203 Caledonia Drive, Lafayette, LA 70508",
      "description": "This cozy 3-bedroom, 1.5-bathroom cottage is move-in ready and the perfect place to call home. Located in the Milton and Southside High School districts, this charming home is easy to maintain and so much to love. There is a large backyard with plenty of space for pets, and a storage shed for tools. The house has never flooded, located in flood zone X, so you can rest easy at night when you live here. Schedule your showing today!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/7320-stone-haven-court-n-pinellas-park-fl-110099042352/",
      "price": "AUD $390,075",
      "location": "7320 STONE HAVEN COURT N, PINELLAS PARK, FL 33781",
      "description": "HIGH AND DRY!!! Welcome Home! This beautifully updated three bedroom, two bathroom unit offers the perfect blend of modern elegance and comfort. The updated kitchen with custom designed cabinetry and updated bathrooms showcase stylish and high quality fixtures, ensuring a contemporary living experience. With new laminate flooring throughout, the spacious open floor plan provides ample room for both relaxation and entertainment. There are glass sliders that lead from the living room and primary bedroom to a private fenced in backyard that is ideal for outdoor entertaining! INTERNET AND CABLE INCLUDED IN THE LOW MONTHLY HOA FEE!! Situated in a prime location, you're just minutes away from the stunning Gulf Beaches and the vibrant lifestyle of downtown St. Petersburg.  This is truly Florida living at it's best! Come and see this beautiful home today and make it yours tomorrow before someone else does."
    },
    {
      "url": "https://www.realestate.com.au/international/us/1135-rosecroft-lane-york-pa-110099042353/",
      "price": "AUD $502,417",
      "location": "1135 ROSECROFT LANE, YORK, PA 17403",
      "description": "Discover this beautiful townhome featuring an open-concept living, dining, and kitchen area perfect for entertaining and everyday living.  The spacious kitchen boasts an extra-large island, ideal for meal prep and casual gatherings.  Upgraded amenities include a stylish laundry room with cabinetry and shelving on the upper floor adjacent to the bedrooms, providing convenient storage.  The home has been thoughtfully refreshed with luxury vinyl plank flooring throughout the kitchen, living room, and bathrooms, offering durability and a sleek look. Enhancements such as a new patio with a privacy fence create an excellent outdoor retreat.  Flexible space on the bottom floor can serve as a playroom, home office, or den- adaptable to your lifestyle needs.Located close to I-83, shopping, and amenities, this home combines comfort, style, and convenience!Don't miss this opportunity to make this lovely townhome yours!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/113-anchorage-drive-havelock-nc-110099042354/",
      "price": "AUD $858,165",
      "location": "113 Anchorage Drive, Havelock, NC 28532",
      "description": "Boaters Paradise in The Moorings - Deep Water Slip included. Welcome to this meticulously maintained like-new home in the desirable waterfront community of The Moorings. Built in October 2023 with quality, comfort and coastal living in mind. This 3 bedroom, 2.5 bath single-story home offers 2,410 sq ft of thoughtfully designed space, including wide hallways and doors for aging in place. Deep water boat slip #9 conveys with the home - approx 40' long, 16' wide & 6' deep water - perfect for larger vessels. Located on Clubfoot Creek with quick access to the Neuse River & ICW, it's a true boaters dream just steps from your back door & screened porch! Highlights: 2x6 construction with extra insulation for energy efficiency & quietness. Not in a flood zone. Screened in rear patio with water views. Detached 12x20 shed. Beautiful LVT flooring in the main areas, carpeted bedrooms. Open-concept living, large kitchen with 2 refrigerators, double oven and gas stove & electric oven. Rinnai tankless gas water heater. 500-gallon buried propane tank and grill hookup. Spacious laundry room with built-in ironing board & full size stackable washer & dryer. Portable generator included. All appliances convey. Low HOA/DOA under $55 per month combined! Enjoy the peaceful secluded setting just minutes from MCAS Cherry Point, The Crystal Coast Beaches and historic Beaufort, Atlantic Beach & Emerald Isle. Come relax - the work is done. Welcome home."
    },
    {
      "url": "https://www.realestate.com.au/international/us/280-s-300-st-george-ut-110099042355/",
      "price": "AUD $612,418",
      "location": "280 S 300, St George, UT 84770",
      "description": "Beautifully remodeled home featuring custom tile work in both bathrooms, brand new cabinets, new flooring, and new landscaping. Nearly everything has been redone, including: Kitchen: Removed drop-down ceiling New Kitchen Aid appliances, kitchen sink, and faucet New cabinets and floating shelves New disposal Added gas line for stove Beams added for structural support and decor Bathrooms: Remodeled master bath with separate shower and tub New tile, plumbing fixtures, vanities, and glass enclosures Utilities: All new plumbing in walls New heating and AC system New tankless water heater New water softener Other Renovations: New roof, fireplace cap, windows, and doors New light fixtures, electrical upgrades, and switches See More...>Ethernet added to rooms with a central hub... New drywall texture, baseboards, and trimNew wood floorNew garage textures, paint, lighting, and trimCloset rods and shelving replacedCustom hall cabinet with hamper and shelvesLandscaping:New sprinkler system front and backOvergrowth removedNew sod, curbing, and pavers.Verification: Buyer to verify all information."
    },
    {
      "url": "https://www.realestate.com.au/international/us/1623-county-c-rd-grafton-wi-110099042356/",
      "price": "AUD $474,331",
      "location": "1623 County C Rd, Grafton, WI 53024",
      "description": "Lot No. 3  of CSM No. 4276 - 3.05 Acres.  Awesome building site offering great views, mature trees, quiet  and walking distance to Lion's Den Gorge Nature Preserve.  Your opportunity to Build your dream home!  Lot No. 3 perks for a mound system.   Close driving distance to Hwy 43 and shopping in Grafton or a short drive north on Cty Rd. C to downtown Port Washington.   Please see documents for details. SEE DRONE VIDEOS IN DOCUMENTS!!"
    }
  ],
  "page_6": [
    {
      "url": "https://www.realestate.com.au/international/us/8-boxwood-way-warren-twp-nj-110099042357/",
      "price": "AUD $2,847,548",
      "location": "8 Boxwood Way, Warren Twp., NJ 07059-6858",
      "description": "Welcome to resort living in this preferred neighborhood of Warren Township,where every detail of this 4 bdrm, 4.5 bath, 3 car garage colonial showcases elegant design,renovated baths & newly finished basement,and newer lush backyard oasis resting on a .89 acre private lot and cul-de-sac.Step inside to discover a grand 2-story foyer flanking an elegant dining room and a billiard/living room.The chef kitchen features a large center island, breakfast room, designer lighting, granite counters, marble backsplash, high end appliances, and custom cabinets.The kitchen is open to the expansive 2-story family room that has abundant light and a gorgeous fireplace with custom moldings.The second floor offers 4 generous sized bedrooms, including the primary hotel style suite with a vaulted ceiling, a sitting area, a large designer walk in closet, and a spa like marble bathroom with double vanity, walk in steam shower and soaking tub, and 2 additional updated bathrooms.The newly renovated lower level offers a sprawling recreational room for entertaining, a full bath, an exercise room and a utility room with storage.This outdoor area is a dream, with a sprawling deck with built in lighting and outdoor kitchen, bluestone patio, an 8 seat hot tub, outdoor pavilion, gas fire-pit area, gorgeous manicured grounds with landscape lighting.This home is TURN KEY! DREAM location, just 5 minutes to top rated schools,including Pingry School,and close to all major highways and shopping."
    },
    {
      "url": "https://www.realestate.com.au/international/us/16-1039-road-10-poouli-kurtistown-hi-110099042348/",
      "price": "AUD $388,515",
      "location": "16-1039 ROAD 10 (POOULI), KURTISTOWN, HI 96760",
      "description": "Aloha! Welcome to this beautiful peace of paradise where dreams do come true. This property boasts 3 acres complete with fencing, a permitted concrete dwelling, solar power with the option to tie into the grid, and fruiting trees consisting of- 38 Rambutan- 7 citrus- 13 Lychee- 2 Avocado- 1 Pamaolo treeThe concrete structure is about 700sqft. It has a large open floor plan with a bathroom, a loft, and lots of storage space. Let your imagination run wild and utilize this space as you see fit. It comes with (2) ~2,000 gallon stainless steal water container catchments. Perfect for all of your shower, washing. flushing, and watering needs.This is a great place to live good, eat fresh fruit from your yard, catch your own rainwater, and enjoy your life.This property is only about 15 minutes to Kea'au town with a post office, shops, restaurants, gas stations, and more; and only about 30 minutes from Hilo and its beaches.All information is provided as a courtesy. Buyer is to verify.Mahalo for your inquiry!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/1318-w-21st-street-kansas-city-mo-110099042349/",
      "price": "AUD $187,236",
      "location": "1318 W 21st Street, Kansas City, MO 64108",
      "description": "Discover a rare lot in Kansas City’s West Side, a hidden gem now reborn in a vibrant renaissance! Perched high with stunning West Bottoms views and epic sunsets, build your dream home amid historic charm and new modern masterpieces. Across the street, 7 cleared lots signal imminent construction, joining nearby million-dollar homes.  Walk to trendy West Side shops, parks, eateries, theaters, and bars. Nearby is Crossroads, downtown, Union Station, Streetcar, and River Market. And your new view to the West includes a stunning view of the new Rock Island Bridge, wineries, and West Bottoms! Easy highway access. Build your urban dream home! Lot next door at 1322 W 21st Street is also for sale. Taxes and lot size per county record. Buyer to verify lot lines. No preferences or limitations or discrimination because of any of the protected classes under Fair Housing."
    },
    {
      "url": "https://www.realestate.com.au/international/us/1301-pennrose-drive-reidsville-nc-110099042347/",
      "price": "AUD $538,304",
      "location": "1301 Pennrose Drive, Reidsville, NC 27320",
      "description": "Nestled in the established community of Pennrose Park is a uniquely beautiful home that blends old character charm w/ modern upgrades & amenities.  Original hardwood floors span throughout the main living area w/ original french doors & glass nobs into the dining room.  The kitchen has been completely remodeled to feature granite countertops, eyecatching backsplash & stainless steel appliances.  A full bath & laundry room are off the kitchen.  The sunroom can be used for relaxing or office space. Upstairs you’ll find 3 bedrooms & a fully renovated bathroom that reflects yesteryear's charm.  Outside is a fully fenced yard WITH an awesome matching extra building. It’s currently being used as a man cave, bring your imagination & make that space yours!  The home underwent several updates in 2023 including repainting the exterior, a new roof, new deck, new gutters, metal wrapped all windows & new vertical siding. Video Tour: https://listings.lighthousevisuals.com/sites/lkrvjzv/unbranded"
    },
    {
      "url": "https://www.realestate.com.au/international/us/408-n-butterfield-road-libertyville-il-110099042346/",
      "price": "AUD $1,084,409",
      "location": "408 N Butterfield Road, Libertyville, IL 60048",
      "description": "Sitting on just over an acre on a very secluded and private lot you will find this massive, two-story custom home which offers a very unique floor plan, tons of space and is a blank canvas for a buyer looking to create their dream home! AS you enter the modern, two-story foyer you will love the vaulted ceilings which are offered in the foyer and family room, marble floors line the main level along with a fireplace in the family room for those chilly winter nights! The master suite in this home is majestic and spacious with a rounded spa like space for a master bathroom! There are three additional bedrooms with en suite bathrooms, a full basement with high ceilings along with an attached garage. Tons of windows throughout this home offer natural sunlight from every angle! The home is unfinished and needs a buyer with vision to bring back to life however the space, sq footage and lot size makes this home a prime property for adding value while adding your custom finishes. Consider this a new construction with the exterior already completed and all you have to do is come inside and finish the interior!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/3200-e-highway-20-highway-skiatook-ok-110099042342/",
      "price": "AUD $5,148,834",
      "location": "3200 E Highway 20 Highway, Skiatook, OK 74040",
      "description": "PRIME DEVELOPMENT OPPORTUNITY 69 +/- Acres in Skiatook City Limits! This already zoned commercial property offers an exceptional development opportunity with prime visibility and accessibility. Tulsa County APN: 92328-23-28-45210 (9.66 acres) and 92329-23-29-14720 (59.41 acres) Situated directly off Highway 20, it benefits from a high annual average daily traffic count of 15,500 with population growth of 0.8% per year. The property is strategically located less than one mile from US Highway 75, providing easy access to major transportation routes. The property is fully equipped for development, with city water, electric, and gas readily available at the road. Its location is ideal for connecting to key destinations: just 15 minutes to both Downtown Tulsa and Tulsa International Airport, 30 minutes to the Tulsa Port Waterway, and within 25 miles of a trade school to support workforce development. Skiatook is a thriving community experiencing steady population growth. It features a public school system with high marks, a lower cost of living, and a lake-centered lifestyle, all of which enhance its appeal. As an up-and-coming town, Skiatook combines the charm of small-town living with the advantages of being just a short drive from a major metropolitan area. The property’s location at the crossroads of major highways makes it ideal for a variety of development opportunities, including retail, mixed-use, or industrial projects. Industry-specific incentives are available to further encourage business growth and investment. With its proximity to high-traffic routes, strong local infrastructure, and ample room for growth, this property is an unparalleled opportunity to be part of Skiatook’s bright future. Contact us today for more information and to explore the possibilities for this exceptional property."
    },
    {
      "url": "https://www.realestate.com.au/international/us/3555-s-peak-drive-fayetteville-nc-110099042343/",
      "price": "AUD $467,934",
      "location": "3555 S Peak Drive, Fayetteville, NC 28306",
      "description": "Location, location, location! Leave the car behind — walk to Hope Mills Medical Home, Millstone 14 movie theater, Putt-Putt Fun Center, La Cocina Restaurant, and Frostings Bakeshop. Minutes to Walmart, Lowe’s, gyms, nail salons, Harris Teeter, Hope Mills Parks and Recreation, and dining options. Inside, this 3 BD, 2.5 BA home offers nearly 1,900 sqft of well-designed space. The living room welcomes you with a cozy fireplace and flows into a kitchen with hardwood floors and  bar-height counters,  First-floor master suite for added privacy, spacious loft upstairs for a second living area, office, or play space. Two bedrooms feature walk-in closets, plus an upstairs laundry room. Fully fenced backyard, storage shed,  and tucked away on a quiet cul-de-sac. Move-in ready and close to everything!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/231-delaware-avenue-jamestown-ny-110099042344/",
      "price": "AUD $210,641",
      "location": "231 Delaware Avenue, Jamestown, NY 14701",
      "description": "Welcome to your dream home! This charming 2-bedroom ranch offers easy living and ideally located. Just a short walk to Bergman park, Persell middle school, and other local conveniences. The home is solidly built, featuring a durable metal roof for minimal maintenance and promises peace of mind with its strong foundation, updated heating system, updated gutters, and central air.You’ll find plenty of space with a large detached garage for vehicles, storage, or a workshop. Relax on the front porch or enjoy the back patio with guests.Inside boasts a large kitchen, wood floors, and new windows throughout. There's a bonus room that can be used as a cozy den, dining room or a third bedroom. Laundry hook ups are available downstairs or upstairs for ease. The large, finished basement was once utilized as a workspace/recreational area. This ranch blends practicality, charm, and security. Don’t miss the chance to call it yours!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/413-ouachita-15-chidester-ar-110099042345/",
      "price": "AUD $351,068",
      "location": "413 Ouachita 15, Chidester, AR 71726",
      "description": "2 homes on White Oak Lake with 5 1/2 lots.  Info provided is for Mobile Home at 413 Ouachita 15.  409 Ouachita 15 Brick home (homes site side by side). 3 bedroom 1 bath with 1138 sq ft.  Foundation is closed piers Water:City Sewer:Septic Gas:Natural Exterior:Brick 2 car carport"
    },
    {
      "url": "https://www.realestate.com.au/international/us/5341-circle-drive-weeki-wachee-fl-110099042341/",
      "price": "AUD $1,558,740",
      "location": "5341 CIRCLE Drive, Weeki Wachee, FL 34607",
      "description": "Amazing views of the Weeki Wachee River! This 3 story waterfront log cabin style home has quick directaccess to the Gulf. House also has a platted side lot that is included. Offers 2 docks with power, water andfish cleaning station. A new roof has just been installed. Ground level is perfect for entertaining. As youenter the house you will be welcomed by warm plank wood floors, high volume ceilings and cozy familyroom. The kit is fully equipped with updated appliances & a large pantry. 2nd & 3rd Br's are on 2ndfloor/main level with a full bath and laundry room. 3rd level has a large private suite with it's on balcony.The lower floor has a lot of space for playing games and rear of this property is unbelievable and a mustsee . In addition there are 2 outdoor sheds, storage, power & water supply. Brick pavers accent thedriveway & walkways. There is room for RV or camper and all your water toys. Ample parking for you andany guests."
    },
    {
      "url": "https://www.realestate.com.au/international/us/186-expansive-drive-lexington-nc-110099042340/",
      "price": "AUD $599,062",
      "location": "186 Expansive Drive, LEXINGTON, NC 27295",
      "description": "Welcome to the Hayden, one of our two-story floorplans in Bristol Fields located in Lexington, North Carolina. This home features 5 bedrooms, 3 bathrooms, 2,511 sq. ft. of living space, and a 2-car garage. Upon entering the home, youll be greeted by an inviting foyer passing by the flex room, then led into the center of the home. This open-concept space features a functional kitchen overlooking the living room, a breakfast area, a guest bedroom and a full bathroom in the back left of the home. The kitchen is equipped with a corner walk-in pantry, granite countertops, stainless steel appliances, kitchen island, and a breakfast area. From the breakfast area you can step out onto the back patio, perfect for entertaining guests or relaxing after a long day. The second floor hosts the spacious primary bedroom and primary bathroom boasting two walk-in closets, a walk-in shower, dual vanity, and separate water closet for ultimate privacy. The additional three bedrooms share a third full bathroom the upstairs loft space is perfect for family entertainment, work out area, or a reading space. The laundry room completes the second floor. With its luxurious design and ample space, the Hayden is the perfect place to call home. Do not miss this opportunity to make the Hayden yours at Bristol Fields. Contact us today to schedule a personal tour!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/151-sprocket-rd-orangeburg-sc-110099042339/",
      "price": "AUD $313,605",
      "location": "151 SPROCKET RD, ORANGEBURG, SC 29115",
      "description": "Welcome to the Perry at The Park at Wilkinson! This ranch-style home is thoughtfully designed, with two bedrooms and 2 bathrooms, all one level. The split bedroom design allows for privacy and comfort. The Primary Bedroom features an ensuite bathroom with a double vanity and a walk-in primary closet. This plan also offers a cozy kitchen that overlooks the spacious living area. All our homes include D.R. Horton's Home is Connected package, an industry leading suite of smart home products that keeps homeowners connected with the people and place they value the most. The technology allows homeowners to monitor and control their home from the couch or across the globe. *The photos you see here are for illustration purposes only, interior, and exterior features, options, colors, and selections will differ. Please see sales agent for options."
    },
    {
      "url": "https://www.realestate.com.au/international/us/2615-jarvis-circle-palm-harbor-fl-110099042335/",
      "price": "AUD $1,164,920",
      "location": "2615 JARVIS CIRCLE, PALM HARBOR, FL 34683",
      "description": "Welcome to your dream home in the heart of Palm Harbor, Florida! This beautifully renovated 3-bedroom, 2-bathroom, 2-car garage residence perfectly blends modern elegance with everyday comfort. From the moment you step inside, you’re greeted by soaring ceilings, an open-concept layout, and high-end finishes throughout. New kitchen featuring sleek quartz countertops, classic white shaker cabinetry, a breakfast bar and nook, reverse osmosis filtration system, and premium stainless steel appliances. Ideal for entertaining, the kitchen flows seamlessly into the bright and airy family room with a cozy wood-burning fireplace, and opens through French doors to a serene screened-in lanai. Retreat to the primary suite, complete with vaulted ceilings, a luxurious, newly renovated ensuite bath, and a custom walk-in closet. The two additional bedrooms are generously sized, perfect for guests, family, or a home office. Step outside to your own private oasis: a screened-in, heated PebbleTec pool surrounded by neat landscaping, covered seating areas, and a fully fenced backyard—perfect for soaking in the Florida sunshine year-round. Located in the desirable Waterford Crossing community (no flood insurance required), this home is just minutes from Dunedin Causeway, Honeymoon Island, the Pinellas Trail, and the vibrant shops, restaurants, and breweries of Downtown Dunedin. Enjoy the added bonus of a neighborhood park just steps away. Key Updates Include: New roof (2023), New Pool Heater, PebbleTec pool surface (2020), Epoxy garage floor (2023), New flooring & interior paint, Paver driveway & pool deck, Sprinkler system on well. This is Florida living at its finest—modern updates, prime location, and unbeatable outdoor living. Don’t miss this exceptional opportunity!"
    },
    {
      "url": "https://www.realestate.com.au/international/us/532-duvall-street-longs-sc-110099042336/",
      "price": "AUD $515,788",
      "location": "532 Duvall Street, LONGS, SC 29568",
      "description": "Introducing the Aria  a meticulously crafted home with 3 bedrooms, 2 bathrooms, and 1,618 square feet of expansive living space. Its focal point is the stunning kitchen, complete with a generous island, sleek stainless steel appliances, and ample pantry space. This single-level layout is perfect for hosting gatherings or simply unwinding in comfort. The Primary Suite is a retreat in itself, offering a spacious closet and a lavish bathroom with a walk-in shower, linen closet, and dual vanity. With its contemporary design and open concept, the Aria caters to those who crave both style and functionality.All of our homes include D.R. Horton's Home is Connected package, an industry leading suite of smart home products that keeps homeowners connected with the people and place they value the most. The technology allows homeowners to monitor and control their home from the couch or across the globe. *The photos you see here are for illustration purposes only, interior and exterior features, options, colors and selections will differ. Please see sales agent for options."
    },
    {
      "url": "https://www.realestate.com.au/international/us/1507-rocky-rise-san-antonio-tx-110099042337/",
      "price": "AUD $581,992",
      "location": "1507 Rocky Rise, San Antonio, TX 78245",
      "description": "The Lombardi is a two-story, 2539 square foot, 5 bedroom, 2.5 bathroom, 2-car garage layout that will cater perfectly to larger families. A deep-set, covered porch opens to a foyer, formal dining room, and powder room. A butler entry connects the dining room and spacious kitchen lined with abundant cabinet and counterspace. Classic white subway tile backsplash is a perfect accent. The large kitchen island faces the family room. The private main bedroom suite is located off the family room and features a separate tub and shower, double vanity sinks, ceramic tile flooring, private water closet and a large walk-in closet. A downstairs utility room is located off the entry foyer and a storage space is located under the stairs. The second floor includes a versatile loft area with plenty of natural light, a full bath, four secondary bedrooms, and spacious closets. Additional features include 9-foot ceilings, 2-inch faux wood blinds throughout the home, luxury vinyl plank flooring in entryway, family room, kitchen, and dining room, ceramic tile at all bathrooms and utility room, pre-plumb for water softener loop, and full yard landscaping and irrigation. Youll enjoy added security in your new home with our Home is Connected features. Using one central hub that talks to all the devices in your home, you can control the lights, thermostat and locks, all from your cellular device."
    },
    {
      "url": "https://www.realestate.com.au/international/us/85089-sara-road-yulee-fl-110099042338/",
      "price": "AUD $545,949",
      "location": "85089 SARA Road, Yulee, FL 32097",
      "description": "Welcome home to this spacious, newly renovated 4 bedroom 2 bath home located in the desirable Wilson Neck neighbourhood! Beautiful built-ins located throughout give this home a charming feel. Enjoy your time entertaining on the huge back porch or in the oversized kitchen with island. Seperate living and dining room. New roof and stainless steel appliances. Won't last long."
    },
    {
      "url": "https://www.realestate.com.au/international/us/5428-big-cow-creek-san-antonio-tx-110099042334/",
      "price": "AUD $471,679",
      "location": "5428 Big Cow Creek, San Antonio, TX 78253",
      "description": "The Stanley is a two-story home featured in our Riverstone at Westpointe community in San Antonio, TX. Offering 3 classic front exteriors, 1-car garage and full yard landscaping and irrigation, this home is sure to impress. Step inside this 4 bedroom, 2.5 bathroom home to find 2243 square feet of open concept living. Whether you're cooking, enjoying a meal or entertaining, you'll never be far from the action with a beautifully blended kitchen, dining area and living room. With laminate counter tops, stainless steel appliances and shaker style cabinetry, this home's kitchen was designed with you in mind. You'll also love a roomy, single basin sink, a spacious corner pantry and an oversized kitchen island with plenty of workspace. A versatile, open to below loft greets you at the top of the stairs and is a perfect play room or entertainment area. Quality carpet and large windows that provide natural light make this a well rounded space. The primary bedroom is located upstairs and is built with an attractive ensuite bathroom. The main bathroom features a laminate vanity counter top, a combined shower and bath tub and a grand walk-in closet with built-in shelving. A second full bathroom and all secondary bedrooms are also located upstairs. Whether you are using these rooms as bedrooms or other bonus spaces, all include quality carpet and closets. Additional features include sheet vinyl flooring in entry, living room, and all wet areas, laminate bathroom counter tops and our HOME IS CONNECTED base package. Using one central hub that talks to all the devices in your home, you can control the lights, thermostat and locks, all from your cellular device. Contact us today by clicking the text with us button or the request information button and receive more information about The Stanley floor plan in Riverstone at Westpointe."
    },
    {
      "url": "https://www.realestate.com.au/international/us/5700-n-123rd-street-kansas-city-ks-110099042329/",
      "price": "AUD $1,215,474",
      "location": "5700 N 123RD Street, Kansas City, KS 66109",
      "description": "RARE FIND! Experience peaceful acreage living without sacrificing convenience! Perched atop Piper's highest point, this 2,354 sq ft retreat offers stunning sunsets. Features 3 beds, 3.5 baths, finished basement, barn, pastures, & stocked pond. Updated w/ modern farmhouse charm, open concept, granite island, SS appliances, 2 fireplaces. Enjoy serene pond views from 2 large decks. Main-floor master suite w/ fireplace & en-suite. Versatile finished basement. 2 oversized upstairs bedrooms & remodeled bath. NEW roof (2021), HVAC (2021), tankless water heater (2020), carpet (2024). 1200 sq ft barn (3 stalls, coop, tack room, loft). 3 fenced pastures w/ water/electric. Ample parking w/ 30 amp hookup. 7 mins to The Legends. Private showings available upon request."
    },
    {
      "url": "https://www.realestate.com.au/international/us/795-hammond-dr-2101-atlanta-ga-110099042330/",
      "price": "AUD $351,068",
      "location": "795 Hammond DR 2101, Atlanta, GA 30328",
      "description": "Welcome to this stunningly renovated condo that is vacant and ready to make your own and this incredible view can be all yours! This home boasts a modern kitchen that overlooks the northside of Sandy Springs and perfectly complemented by the spacious bedrooms features custom closets, while the updated bathroom. The private balcony, perfect for relaxing and enjoying the north view. All appliances including washer and dryer come with the property. Enjoy resort-style living with access to concierge services, a sparkling pool, two fully equipped gyms, a dog park, and nearby Hammond Park. This prime location is moments from downtown Sandy Springs, with shopping, dining, and entertainment options at your doorstep. Plus, enjoy easy access to public transit with MARTA bus and train stations within walking distance. Comfort and convivence abound in the gorgeous Sandy Springs condominium."
    },
    {
      "url": "https://www.realestate.com.au/international/us/176-holmes-corner-drive-smithfield-nc-110099042328/",
      "price": "AUD $369,775",
      "location": "176 Holmes Corner Drive, Smithfield, NC 27577",
      "description": "Come tour 176 Holmes Corner Dr the Sydney at Wilson's Ridge!Welcome to Wilson's Ridge! Our Sydney townhomes greet you with open concept living. Chefs kitchen w/ stainless steel appliances, quartz countertops, shaker cabinets and tons of countertop space. First floor provides Large living room , dining area and a quite study room. The second floor offers a primary bedroom suite with a spacious walk In closet, and two secondary bedrooms. Relax and enjoy some fresh air on your back patio. Amenities in this brand new community include large and small dog park, playground, pavilion, cornhole area, and pocket park with firepit and seating area.. *Photos are for representation only*"
    },
    {
      "url": "https://www.realestate.com.au/international/us/408-southampton-a-west-palm-beach-fl-110099042326/",
      "price": "AUD $212,201",
      "location": "408 Southampton A, West Palm Beach, FL 33417",
      "description": "Welcome to your next chapter in the highly sought-after, vibrant 55+ community where comfort, convenience, and relaxation await you. This beautifully designed neighborhood is more than just a place to live—it’s a lifestyle! Perfectly located with easy access to shopping, dining, and entertainment, you’ll enjoy both tranquility and the excitement of nearby attractions. This meticulously cared for 1 bedroom and 1.5 bath unit can be purchased furnished or unfurnished. Call me for a showing today"
    },
    {
      "url": "https://www.realestate.com.au/international/us/13006-aegean-drive-jacksonville-fl-110099042327/",
      "price": "AUD $1,497,732",
      "location": "13006 AEGEAN Drive, Jacksonville, FL 32246",
      "description": "Welcome home to this extraordinary Palisade home in Tamaya. This light, airy and custom smart home offers custom features and designs spread out over 3,000 sq. ft between the main house and private casita. Enjoy 4 BR's and 2 1/2 baths in the main house and a private 1BR and 1Bath in the backyard Casita. The Casita can serve as an office, guest suite or in-law suite. The custom backyard offers a vacation feel with a tranquil, cozy and relaxing setting along with an outdoor kitchen, custom lighting, fire pit and yard ready for your private pool to enjoy the sunrise.This meticulous home has an open private floor plan with a living room, kitchen with granite counters, walk-in pantry & dining area off the kitchen. Enjoy a cozy master suite on the first level with a nice bathroom and walk-in closet. Enjoy a spacious office in the front with a relaxing lake view from the porch to capture sunsets. Enjoy a roomy upstairs with 3BR's and plenty of space. Open House 4/26 & 4/27 12-3pm."
    },
    {
      "url": "https://www.realestate.com.au/international/us/204-village-drive-welaka-fl-110099042325/",
      "price": "AUD $54,454",
      "location": "204 VILLAGE Drive, Welaka, FL 32193",
      "description": "Lovely site in Welaka Village.  Public water and sewer are available.   It is a great spot close to the small crossroad town of Welaka with cute restaurants nearby and best of all close to Lake George and the St. John's river for recreation.  Plenty of private and public places to launch your boat nearby.  Rural area that has started to grow because of how beautiful it is.  Lots of area parks and trails to enjoy the Florida weather outdoors."
    },
    {
      "url": "https://www.realestate.com.au/international/us/1703-portorosso-drive-richmond-tx-110099042323/",
      "price": "AUD $486,798",
      "location": "1703 Portorosso Drive, Richmond, TX 77406",
      "description": "The Baxtor at Sorrento is a 1,409 sqft one story plan offering 3 bedrooms and 2 full bathrooms located in the growing city of Richmond, Texas. Through the foyer and past the secondary bedrooms and utility room, the home opens up into the open concept kitchen and living area. This plan offers the simple yet essential luxuries including gorgeous granite counter tops, stainless steel appliances, a large corner pantry, and plenty of space for hosting. From the comfort of your living room you get a beautiful view of your covered back patio and fenced in yard, perfect for everyday use or entertaining guests. In the primary suite, you will find a walk in closet as well as dual vanities and a walk-in shower. The remaining 2 bedrooms are located just past the entry where the shared second bathroom is located as well. Each bedroom features carpeted floors as well as a closet. Bedroom 2 and 3 share a bathroom placed conveniently between them. This plan offers 2 beautiful elevations to choose from, both with front facing brick and high quality siding. The 2 car garage offers the perfect amount of space for both parking and storage. Contact us today to find your dream home in Sorrento."
    },
    {
      "url": "https://www.realestate.com.au/international/us/13209-bywell-horizon-city-tx-110099042321/",
      "price": "AUD $389,997",
      "location": "13209 BYWELL, Horizon City, TX 79928",
      "description": "Welcome to this charming single story home offering 4 bedrooms and 2 bathrooms, perfect for comfortable living. Step inside to find brand new carpet in the living room, creating a fresh and inviting space for relaxing and entertaining. The kitchen is a true highlight, featuring beautiful granite countertops, stainless steel appliances, and plenty of cabinet space for all your needs.Enjoy a beautifully landscaped backyard — ideal for outdoor gatherings, gardening, or simply unwinding after a long day. Plus, with quick access to Loop 375, commuting around the city is a breeze.Don't miss the opportunity to make this move-in-ready home yours!"
    }
  ]
}