{
  "page_1": [
    {
      "url": "https://www.realestate.com.au/international/tr/antalya-antalya-310099007570/",
      "price": "AUD $332,391",
      "location": "Antalya, Akdeniz kiyisi",
      "description": "Reference: THIU-T1891. These modern residences are located in the heart of Mahmutlar, one of Alanya's most prestigious and vibrant neighbourhoods. Thanks to its central positioning, residents enjoy immediate access to urban infrastructurecafes, schools, shops, and healthcarewhile still relishing the tranquillity of a calm residential atmosphere. Just a five-minute stroll to the beach, the development offers the perfect balance between convenience and coastal living. Set on a 3, 469 m2 plot, this elegant single-block project consists of 109 apartments, available in various layouts ranging from 1+1 to spacious 5+1 duplexes. Each residence is designed with generous ceiling heights of up to 3 metres and includes expansive balconies and terraces, enhancing the sense of light and space. Open-plan or separate kitchens, multiple bathrooms, and thoughtfully planned living areas create a harmonious flow throughout each home. All units come with an individually controlled radiator heating system. The architecture features soft tones and an illuminated exterior that adds sophistication, while the interiors showcase meticulous attention to detail with natural marble and premium finishes throughout the lobbies and shared areas. Residents benefit from a range of upscale amenities such as an underground parking garage, quiet elevators, and smart security systems. The landscaped grounds include a swimming pool, children's pool with slides, barbecue areas, a playground, and serene green spaces for relaxation. The comprehensive spa centre provides a Finnish sauna, salt and steam rooms, massage rooms, a heated indoor pool, and a traditional Turkish bath. For fitness and recreation, there's a gym, indoor children's playroom, and communal loungesall secured by 24/7 surveillance and supported by backup generators and high-speed internet access in shared areas. With its prime location, refined design, and extensive social facilities, this complex offers a luxurious and family-friendly lifestyle in one of Alanya's most desirable settings."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/antalya-antalya-310099007566/",
      "price": "AUD $542,134",
      "location": "Antalya, Akdeniz kiyisi",
      "description": "Reference: THIU-T1890. Located in one of Alanya's most popular and rapidly developing districts, this striking new project is just 300 metres from the beach, offering a luxurious lifestyle in close proximity to the Mediterranean Sea. Surrounded by markets, restaurants, banks, and transport options, the complex is ideally positioned for both permanent living and investment. The development rises on a spacious plot of 6, 023 m2, comprising two residential blocks with a total of 144 apartments. Offering a range of configurations from 1+1 apartments to 4+1 duplexes, the project is designed to cater to various lifestyle needs. All units are equipped with high-quality materials, modern architectural details, and expansive balconies that maximise natural light and views. Residents enjoy the advantage of fully fitted kitchens and bathrooms, spacious layouts, and stylish finishes that combine functionality with elegance. The outdoor area includes beautifully landscaped gardens, a large swimming pool with slides, sunbathing terraces, and shaded pergolas. Social and wellness facilities enhance daily life, featuring a spa centre with sauna, steam room, massage areas, a Turkish bath, and an indoor heated pool. For fitness and leisure, there is a professionally equipped gym, cinema room, karaoke space, and game lounge with billiards and table tennis. Children benefit from dedicated indoor and outdoor play areas. Security is a priority with 24/7 surveillance, camera systems, coded entry, and an on-site management office. Additional conveniences include a backup generator, water purification systems, and fast Wi-Fi in communal areas. Combining refined architectural design with a resort-style lifestyle just steps from the sea, this residence offers an exceptional opportunity for modern coastal living in Alanya."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/antalya-antalya-310099007554/",
      "price": "AUD $559,909",
      "location": "Antalya, Akdeniz kiyisi",
      "description": "Reference: THIU-T1889. Just a short walk from the Mediterranean coast, this newly developed residential complex offers the perfect blend of comfort, elegance, and functionality in one of Alanya's most desirable areas. Set within a well-connected neighbourhood close to public transport, shops, schools, and restaurants, it promises a vibrant yet relaxed lifestyle. The project consists of a single block rising over nine floors, with 63 units in total. A wide variety of apartment options are available, from compact 1-bedroom layouts to spacious 4-bedroom duplexes. All units are designed with attention to detail, featuring open-plan living areas, contemporary kitchens, fitted bathrooms, and expansive windows that frame sweeping views of the sea, mountains, or cityscape. Carefully selected materials and soft colour palettes enhance the sense of space and light throughout. Residents have access to an extensive range of amenities, including a large outdoor pool, landscaped gardens, a wellness centre with sauna and hammam, a fully equipped gym, and a cosy cinema room for indoor entertainment. Families will appreciate the children's playroom, game zone, and safe outdoor areas, while the social lounge and barbecue spot offer perfect settings for community gatherings. The complex also includes a generator, elevator, parking area, and 24/7 security, ensuring peace of mind and convenience at every turn. Ideal for those seeking a modern lifestyle by the seawhether for year-round living, holiday use, or investmentthis residence delivers elevated living with panoramic vistas and thoughtful design."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/alanya-mahmutlar-alanya-antalya-310099004087/",
      "price": "AUD $204,411",
      "location": "Alanya Mahmutlar, Alanya, Antalya Ili",
      "description": "Reference: IHBL-T334. 2 + 1 KAPADOKYA SITESI MAHMUTLAR - KAPADOKIA SEA AND PARK Cosy residence in the very centre of town Great view of the Mediterranean. View over park. Air conditioning for heating or cooling the living room. American kitchen with oven, hob and refrigerator. Lift in the building. Lovely pool area. Right in the centre of the town near shops and restaurants. Within walking distance of the beach. Holiday home with inviting balconies for the warm summer nights. A Peaceful holiday home furnished and ready for occupation. Facilities Swimming pool, Housekeeper, Possibility for Internet, Shared storage rooms Equipment Air conditioning, Dishwasher, Washing machine, Home appliances, Furniture, Oven, Refrigerator, Tiled ceramic floors, Steel entrance door, Spotlights Alanya Mahmutlar About Mahmutlar is one of the more peaceful districts of Alanya. The whole district itself is nestled in-between the long beach promenade and the Taurus mountains, with views of the famous banana plantations, and mountains. The district is approximately 10 kilometers from Alanyas city centre, and is a serene, easy going area. Mahmutlar is recommended for people who want a holiday in quiet and peaceful surroundings, together with natural beautiful green scenery. Activities In Mahmutlar the sea offers easy access to water sports, beach activities and fishing. Several gyms and hamams are located in the city and the surrounding areas are perfect for biking and hiking. Shopping In Mahmutlar, you will find small shops scattered around the area, though most of the main and varied stores such as butchers, bakeries, and hardware stores are in the centre of Mahmutlar. Small Supermarkets are scattered throughout the whole area. Mahmutlar centre hosts the Saturday market, also at the eastern end of Mahmutlar is the place where the Tuesday market is hosted, between the two main roads, Barbaros Cadde and Ataturk Cadde. Public transportation Since Mahmutlar stretches over several kilometers, it has its own local buses to get around inside the city and the part that is connected to Kargicak. Buses that go in the direction of Alanya run every 10 minutes approximately, and return with the same frequency. As everywhere else in the Alanya area, taxis are available from almost every corner. Food & dining You will be able to find small, family owned cafes nearly everywhere in Mahmutlar. Just like the people living here the restaurants offer a great mix of cuisine between local and touristic. There are also several well-known Turkish and international restaurant/cafe chains to be found. Nearby Nearby Mahmutlar you will find Kargcak and Kestel. These two areas are a lot less busy than Mahmutlar and the beaches offers crystal clear water with very few people. Behind Mahmutlar the majestic Taurus mountains are a great place for taking a hike or a picnik. Wrap up Mahmutlar is a peaceful, quiet area of Alanya with a good mix of residential areas and tourism. The local community is easy-going and international. The place has beautiful views, and is located beside the turquoise Mediterranean/Akdeniz sea with several kilometers of seemingly endless beach promenade. All daily requirements such as shops, and gyms readily available. Distance to beach: 0.1 km Distance to shops: 0.2 km Distance to town centre: 1 km Year: 1995 Bedrooms: 2 Livingrooms: 1 Bathrooms: 1 Balconies: 1 Gross: 90 m² Price: 115000 EUR"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/yıldırım-fidyekızık-bursa-bursa-310098972318/",
      "price": "AUD $472,860",
      "location": "Yıldırım, Fidyekızık, Bursa, Bursa (province) 16300",
      "description": "Duplex Apartment with Indoor Parking in Fidyekzk, Yldrm, Bursa The duplex apartment is located in Fidyekzk, in the Yldrm district of Bursa. Known for its active working life and being a central hub for many companies in the industrial and textile sectors, Yldrm is one of the most densely populated areas in Bursa. Fidyekzk, on the other hand, is a neighborhood offering a city view and nestled in green vegetation due to its proximity to Mount Uluda, preferred by those seeking a conservative and peaceful lifestyle. The project is conveniently located within walking distance of all types of social amenities and public transportation. Right next to the duplex apartment are a village mosque and a village square, which serves as a local marketplace, tea garden, and community gathering spot. The apartment is just 10 km from the Saitabat Waterfall, 12 km from the historic village of Cumalkzk, 30 km from negl Mobilyum Furniture Bazaar, 40 km from Bursa Yeniehir Airport, 45 km from Uluda Ski Resort, and 135 km from Sabiha Gken Airport. Within the boundaries of the building where the apartment for sale in Bursa is located, there are 2 indoor parking spaces and 1 outdoor guest parking space allocated to the apartment, ideal for those seeking a tranquil and peaceful life. The duplex apartment with a spacious layout is situated in Mee Sevgi Apartment in Fidyekzk and features 4 bedrooms, 1 living room and kitchen, 3 balconies, a bathroom, and 2 spacious internal hallways. The apartment also operates on a central heating system powered by natural gas and is equipped with radiators. YEI-00316"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/arnavutkoy-arnavutkoy-istanbul-310098972321/",
      "price": "AUD $20,682,209",
      "location": "Arnavutköy, Arnavutköy, İstanbul",
      "description": "Panoramic Bosphorus View Ultra-Luxury Villa in Arnavutky, Beikta Discover timeless elegance in this exclusive 5+1 luxury villa located in Arnavutky, one of Istanbuls most prestigious and historic neighborhoods on the European Bosphorus shore. Nestled on a 1367 m private garden, this four-story residence offers an exceptional lifestyle with uninterrupted sea and Bosphorus views from expansive terraces. Property Features: Land Size: 1367 m private garden Gross Area: 600 m, Net Area: 500 m Layout: 5 Bedrooms + 1 Living Room Floors: 4 floors of elegant and functional design Spacious terraces with breathtaking sea & Bosphorus views Luxury Amenities: Private swimming pool Jacuzzi, sauna, and steam room for a spa-like experience Modern and luxurious interior design with premium finishes Private parking area for multiple vehicles Prime Location Arnavutky, Beikta: Situated in one of Istanbuls most elite and tranquil Bosphorus neighborhoods Surrounded by historic architecture, upscale restaurants, and elite schools Easy access to central districts like Etiler, Bebek, and Levent Ideal For: Discerning buyers seeking privacy, panoramic views, and timeless luxury in an irreplaceable Istanbul location. Perfect as a prestigious residence, holiday home, or a long-term investment asset. Contact us today for more information or to schedule a private viewing of this rare gem in Bosphorus-front real estate. Motelle Property Your Global Real Estate Partner VIP Investment Consultancy Comprehensive buying support from start to finish Exclusive Luxury Listings Premium properties in Istanbuls most sought-after locations Data-Driven Investment Strategies Maximizing ROI through expert financial modeling Turkish Citizenship by Investment Full assistance for eligible buyers Property Management & Rental Services Airbnb hosting, legal compliance, and income optimization 24/7 Investor Support Professional guidance throughout your purchase Secure This Exclusive Apartment Today Contact us to schedule a private viewing or for more details: Phone: +90 544 387 8688 Website: motelleproperty.com"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/mezitli-kuyuluk-mersin-mersin-310098972008/",
      "price": "AUD $332,169",
      "location": "Mezitli, Kuyuluk, Mersin, Mersin 33200",
      "description": "Brand New Apartments in Mezitli Mersin Within Walking Distance to Social Facilities Mersin is one of the most notable cities in the Mediterranean region with its deep blue sea, long beaches, mild climate, quality educational institutions, famous restaurant chains and modern marina. The shopping malls in the city, world-renowned brands, international hotel chains and various tourism investments contribute positively to the local economy. Mezitli, one of the largest and most popular districts of Mersin, has an important position in city life. Apartments for sale in Mersin Turkey are within walking distance to all the amenities offered by daily life, popular stores and shopping malls. In addition, it is only 4 km away from the sea and the restaurants lined up along the coast. The project is also located 8 km from Sayapark Shopping Center, 12 km from Forum AVM, 20 km from Mersin Intercity Bus Terminal and 85 km from ukurova International Airport. The apartments for sale are located in a stylish and boutique housing project consisting of a total of 4 blocks, two of which are 8-storey and two of which are 7-storey. This special project offers rich social facilities such as an outdoor swimming pool, Turkish bath, fitness center, sauna, children's playground, walking paths, recreation areas, charging station for electric vehicles, solar system, smart home systems, indoor/outdoor parking and pergola areas. The apartment options offer solutions suitable for various living needs with different plans of 3 and 4 bedrooms. Each apartment has living spaces such as a spacious living room, open-plan kitchen, shared bathroom, en-suite bathroom and a large balcony. Designed with modern lines and built with quality materials, the apartments promise a comfortable and contemporary living experience. COV-00211"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/kagıthane-hamidiye-istanbul-istanbul-310098972013/",
      "price": "AUD $759,914",
      "location": "Kağıthane, Hamidiye, Istanbul, İstanbul 34408",
      "description": "Flats Offering Rental Income Guarantee for Investors in Istanbul Kagithane The luxury project is located in the center of Kathane, one of the new living centers on the European Side of Istanbul. Kathane, which is one of the residential areas in Istanbul that has been in high demand recently, has rich public transportation opportunities that offer easy access to many points on the European Side. Hotel concept flats for sale in Istanbul, Kagithane are within walking distance from daily amenities, such as banks, schools, parks, and markets, 850 m from Vadi Istanbul Shopping Center, 2, 5 km from Okmeydan Cemil Tacolu City Hospital, 2, 2 km from Kathane - Airport metro stop, 3, 1 km from Istanbul Justice Palace, 3, 8 km from Istanbul Bilgi University, 4, 2 km from Cevahir Shopping Center, 4, 4 km from Hali University, 4, 6 km from Istanbul Commerce University, 9 km from Dolmabahe Beikta beach, and 28, 3 km from Istanbul Airport. The project consists of 133 independent sections in 2 blocks with 10 floors on an area of 4000 m. The project has an indoor parking lot, spa, basketball court, conference hall, reception and lobby services, cafes, meeting room, guest seating areas, generator, lightning rod, water tank, elevator, 24/7 security camera system, and security. There are 3 different types of flats in the project; 1+0, 2+1, and 3+1. They are equipped with steel entrance doors, bathroom and kitchen furniture, shower cabin, ceramic flooring, suspended ceiling, and lighting system. IST-1285"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/avcılar-tahtakale-istanbul-istanbul-310098971873/",
      "price": "AUD $893,095",
      "location": "Avcılar, Tahtakale, Istanbul, İstanbul 34320",
      "description": "Real Estate with Lake Views in a Comprehensive Project in Avcilar Istanbul The real estate in Avcilar Istanbul is located on the E-80 European Highway, right next to the Istanbul Canal Project. Within the rapid developments in recent years, Avcilar became one of the most outstanding residential areas of the European side of Istanbul. With the Kanal Istanbul project, the investment value of the district has increased severely. The project in Istanbul Avclar is located within easy reach of daily amenities and transportation lines. The modern project is 2 km to the Kucukcekmece Lake, 6.1 km to Akbati AVM, 10 km to Beylikdz Marina, 12 km to TUYAP International Fair Center, 14.9 km to Avcilar coast, and 42 km to Istanbul Airport. The new project includes 462 flats on a land area of 19, 500 sqm. The project also hosts rich social facilities such as a garden, camellia, swimming pool, children's pool, indoor, sauna, gym, ornamental pool, children's playground, elevator, indoor parking lot. The project has a 24/7 security service. There are different types of real estate with open-plan or separate kitchens and en-suite bathroom options. All real estate has a balcony. The real estate is equipped with top-quality heat insulation, steel doors, video intercom, kitchen appliances, ceramic and parquet flooring, a central heating system, and a shower cabin. IST-0856"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/kagıthane-hamidiye-istanbul-istanbul-310098971698/",
      "price": "AUD $2,359,652",
      "location": "Kağıthane, Hamidiye, Istanbul, İstanbul 34408",
      "description": "Live a Distinctive Life with First-Class Apartments in Kathane Apartments in Istanbul for sale are located in the European side of the city, Kathane. The area is very close to the international highways and the bridges that merge two continents together. Kathane is also very important due to the transportation opportunities. It is connected to the rest of the city by highways, metro and tram lines. Istanbul apartments are very close to many local amenities such as shopping centers, culture, arts and sports centers, cafes, restaurants, bars, post offices, banks and ATMs, colleges, hospitals, pharmacies, and playgrounds for children. Kathane apartments for sale are 3 minutes to TEM highway, 5 minutes to the nearest metro station, Trk Telekom Arena and Maslak business district, 10 minutes to the popular districts of Nianta and Mecidiyeky, 15 minutes to Taksim Square and Fatih Sultan Mehmet Bridge and 30 minutes to stanbul Airport. Apartments in Turkey for sale are in a modern residential complex. The complex consists of 9 blocks of 559 apartments and 55 commercial units. This complex is built on 27.000 m land area and 10.000 project area. The complex has a stream in front of it and has many social amenities around the stream such as a well-designed garden, zen gardens, a pond, walking, and cycling paths, basketball and volleyball courts, football field, shopping street, cafs, restaurants, indoor parking lot, activity areas such as cinema room and music studio, gazebos, lounge areas, playgrounds, outdoor cinema, fitness center, sauna, steam room, Turkish bath, indoor swimming pool, guest house, hobby room, pharmacy, coiffeur, elevators, lightning rod, water tank, generators, secured entry system, 24-hour security service, and cameras. Types of Apartments Studio apartments have a living room, an open kitchen, a bathroom, and a closed balcony. 1 bedroom apartments have a living room, an open kitchen, a bathroom, a closed or an open balcony. 2 bedroom apartments have a living room, a separate kitchen, a bathroom, an en-suite bathroom, a closed and an open balcony. 3 bedroom apartments have a living room, a separate kitchen, a bathroom, an en-suite bathroom, 2 closed balconies, and an open balcony. 3, 5 bedroom apartments have a living room, a separate kitchen, a bathroom, an en-suite bathroom, a servants room or a study room, 2 closed balconies, and an open balcony (Some of the 3, 5 bedroom apartments have a laundry room). 4 bedroom apartments have a living room, a separate kitchen, a bathroom, an en-suite bathroom, 2 closed balconies, and 2 balconies. Each apartment is equipped with high technical qualities such as steel door, kitchen appliances, natural gas, water booster, central hot water, heat cost allocator, air conditioners, satellite TV infrastructure, central cable TV, fiber optic internet infrastructure, and video intercom. Please contact us for the payment plan and further information. IST-0225"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/mezitli-kuyuluk-mersin-mersin-310098971644/",
      "price": "AUD $1,958,543",
      "location": "Mezitli, Kuyuluk, Mersin, Mersin 33330",
      "description": "New Detached Villas in a Prestigious Location in Mezitli, Mersin Boasting one of the longest coastlines in the Mediterranean and Europe, Mersin has recently become a hotspot for both local and foreign investors. Mezitli is one of Mersins most valuable districts thanks to its central location, abundant social amenities that ease daily life, educational institutions, shopping centers, markets, and natural beauty. These new villas, situated in a prime location in Mezitli, Mersin, are part of an exclusive project rich in social features. The villas for sale in Mersin, Turkey, stand out with their proximity to the beach, schools, markets, and other amenities that make daily life easier. The stylish project is located 1.5 km from Soli Center Mall, 2 km from the beach and the local hospital, 6 km from the marina, 8 km from Forum Mall, 12 km from the High-Speed Train Station, and 82 km from ukurova International Airport. Situated in one of Mezitlis most in-demand areas, this exclusive villa project is built on approximately 4, 416 m plot and consists of 12 independent, three-story villas. The project offers a comfortable lifestyle with privileged features such as a private swimming pool for each villa, a Turkish bath, sauna, elevator, parking lot, private landscaped gardens, generator, and a security camera system. The 6-bedroom villas stand out with their high-quality materials and meticulous craftsmanship. Additionally, each villa includes a smart home system that provides a modern and innovative standard of living, making everyday life more convenient. COV-00213"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/alanya-payallar-antalya-antalya-310098971539/",
      "price": "AUD $293,286",
      "location": "Alanya, Payallar, Antalya, Antalya 07475",
      "description": "Luxe Apartments in a Hotel-Concept Project with Shuttle Service in Payallar The apartments are located in the Payallar neighborhood in Alanya, Antalya. Payallar is subject to quick development, featuring brand-new coastal walks, shining seawater, and beautiful nature. Payallar is a popular holiday village. Its quick development attracts local and foreign visitors. Apartments for sale in Alanya, Turkey are within walking distance of social amenities. Also, they are located 2 km from the sea, 4.7 km from Seapark & Dolphinpark, 14.5 km from Alanya center, 17.4 km from Alanyum Shopping Mall, and 52 km from Alanya-Gazipaa Airport. The 5-star hotel-concept project is enriched with an indoor-outdoor pool, Turkish bath, sauna, steam room, chill-out space, fitness center, cafe, bar, playground, gazebo, barbeque, cinema, and chess room. The apartments come with multiple room-type options. They are equipped with a steel exterior door, PVC windows, kitchen appliances, a countertop, and a sanitation system. AYT-02965"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/zeytinburnu-zeytinburnu-istanbul-310098971540/",
      "price": "AUD $1,363,146",
      "location": "Zeytinburnu, Zeytinburnu, İstanbul",
      "description": "Stylish 3-Bedroom Apartment with Partial Sea View in Yedi Mavi, Istanbul 156 m | 9th Floor | $870, 000 Live by the sea in one of Istanbuls most iconic coastal projects Yedi Mavi. This modern 3-bedroom, 2-bathroom residence is located on the 9th floor, offering natural daylight and partial views of the Marmara Sea. With 156 m grossand 125 m net area, the apartment features a functional layout, high-end finishes, and a serene, family-friendly atmosphere. Apartment Features: 3 Bedrooms + Spacious Living Room Large Separate Kitchen with Built-In Appliances 2 Stylish Bathrooms with Quality Fixtures 1 Indoor Parking Space Included Fully Secured, Family-Oriented Complex Premium Yedi Mavi Facilities: Seaside walking & cycling paths just steps away Indoor & Outdoor Pools | Spa | Turkish Bath & Sauna Fitness Center | Game Rooms | Kids Playground Tennis & Basketball Courts | On-site Caf & Landscaped Gardens 24/7 Security & Concierge Services Prime Zeytinburnu Location: Walking distance to Marmaray Station, shopping centers, and international schools Only 2 minutes to Eurasia Tunnel and E-5 Highway Quick access to Sultanahmet, Fatih, and central business districts Ideal for both family living and investment with rental potential Price: $870, 000 USD Contact us today to schedule a private viewing or explore more options in Yedi Mavi and Istanbuls coastline properties. Motelle Property Your Global Real Estate Partner VIP Investment Consultancy Full support for international investors Exclusive Luxury Listings Prime properties in Istanbuls best locations Data-Driven Investment Strategies Maximize ROI with expert financial modeling Turkish Citizenship by Investment Full assistance for eligible buyers Property Management & Rental Services Airbnb hosting, legal compliance, and income optimization 24/7 Investor Support Professional guidance throughout your purchase Secure This Exclusive Apartment Today Contact us to schedule a private viewing or for more details: Phone: +90 544 387 8688 Website: motelleproperty.com"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/mezitli-kuyuluk-mersin-mersin-310098971501/",
      "price": "AUD $449,681",
      "location": "Mezitli, Kuyuluk, Mersin, Mersin 33200",
      "description": "Brand New Apartments in Mezitli Mersin Within Walking Distance to Social Facilities Mersin is one of the most notable cities in the Mediterranean region with its deep blue sea, long beaches, mild climate, quality educational institutions, famous restaurant chains and modern marina. The shopping malls in the city, world-renowned brands, international hotel chains and various tourism investments contribute positively to the local economy. Mezitli, one of the largest and most popular districts of Mersin, has an important position in city life. Apartments for sale in Mersin Turkey are within walking distance to all the amenities offered by daily life, popular stores and shopping malls. In addition, it is only 4 km away from the sea and the restaurants lined up along the coast. The project is also located 8 km from Sayapark Shopping Center, 12 km from Forum AVM, 20 km from Mersin Intercity Bus Terminal and 85 km from ukurova International Airport. The apartments for sale are located in a stylish and boutique housing project consisting of a total of 4 blocks, two of which are 8-storey and two of which are 7-storey. This special project offers rich social facilities such as an outdoor swimming pool, Turkish bath, fitness center, sauna, children's playground, walking paths, recreation areas, charging station for electric vehicles, solar system, smart home systems, indoor/outdoor parking and pergola areas. The apartment options offer solutions suitable for various living needs with different plans of 3 and 4 bedrooms. Each apartment has living spaces such as a spacious living room, open-plan kitchen, shared bathroom, en-suite bathroom and a large balcony. Designed with modern lines and built with quality materials, the apartments promise a comfortable and contemporary living experience. COV-00211"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/1-azerbaycan-cd-ayazaga-istanbul-310098971517/",
      "price": "AUD $720,744",
      "location": "1 Azerbaycan Cd., Ayazağa, İstanbul 34396",
      "description": "Modern 1+1 Apartment in Maslak Koru with Forest View $460, 000 | 5th Floor | High Investment Value Step into luxury and nature in this beautifully designed 1-bedroom apartment in the prestigious Maslak Koru project, located in Istanbuls elite Maslak Mahallesi. Positioned on the 5th floor, this 70 m gross apartment combines elegant living with panoramic forest views, offering a peaceful lifestyle in the citys top business and residential hub. Apartment Features: Layout: 1 Bedroom + Living Room + Open Kitchen Floor: 5th Gross Area: 70 m Price: $460, 000 (Cash) Delivery: March 30, 2026 Ideal for: Investors, professionals, and expats Maslak Koru Project Highlights: Overlooks lush forest scenery rare in Istanbul city living Premium design with modern architecture and smart home systems On-site amenities: Gym, spa, indoor pool, kids areas, walking paths, social lounges 24/7 security, underground parking, and concierge service Unbeatable Maslak Location: 2 mins to Metro (easy access to city center) 5 mins to Vadistanbul Mall, 10 mins to Istinye Park Near top universities (Istinye, Beykent) and private hospitals (Liv, Acbadem) High rental demand from professionals, executives, and students Why Choose This Apartment? Strategic location in Istanbuls financial and lifestyle center Strong capital appreciation and rental income potential Trusted developer with on-time delivery record A luxury yet manageable property perfect for foreign investors Contact us today to schedule your private video tour or explore more prime properties in Maslak, Vadistanbul, and beyond. Motelle Property Your Global Real Estate Partner VIP Investment Consultancy Comprehensive buying support from start to finish Exclusive Luxury Listings Premium properties in Istanbuls most sought-after locations Data-Driven Investment Strategies Maximizing ROI through expert financial modeling Turkish Citizenship by Investment Full assistance for eligible buyers Property Management & Rental Services Airbnb hosting, legal compliance, and income optimization 24/7 Investor Support Professional guidance throughout your purchase Secure This Exclusive Apartment Today Contact us to schedule a private viewing or for more details: Phone: +90 544 387 8688 Website: motelleproperty.com"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/aksu-kemeragzı-antalya-antalya-310098971363/",
      "price": "AUD $485,719",
      "location": "Aksu, Kemerağzı, Antalya, Antalya 07112",
      "description": "Stylish Flats in a Hotel-Concept Complex Near the Beach in Kundu Antalya The stylish flats are in a hotel-concept complex within walking distance of the sea in Kundu, Antalya. Kundu is recognized as a tourist resort close to the city center. Within its prime location, it offers numerous investment opportunities. Flats for sale in Antalya Kundu are located within walking distance to the market restaurants, cafes, bus station, shopping center, and beach, 7 km to Anadolu Hospital, 8.5 km to Dden Waterfall, 10 km to TerraCity Shopping Mall, 12 km to Antalya Airport, 15 km to Belek golf courses and 18 km to Kaleii. The flats are in a hotel concept complex consisting of 281 flats with 8 floors on 22993 sqm of land. The privileged services and facilities offered by the hotel concept complex include security, security camera, indoor and outdoor car parking, elevator, reception, lobby, indoor and outdoor pool, playground, basketball court, tennis court, outdoor pool with slides, Turkish bath, sauna, spa, hairdresser, fitness area, restaurant, market, cafe. The flats are offered for sale in 1-bedroom and 2-bedroom types. 1-bedroom flats consist of a bedroom, living room, open-plan kitchen, balcony, and bathroom. 2-bedroom flats consist of two bedrooms, a living room, an open-plan kitchen, a balcony, and a bathroom. Stylish flats have features such as a steel door, lacquered room doors, aluminum windows, central air conditioners, a built-in set, a central satellite system, and internet access. AYT-3917"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/yenisehir-kuzeykent-mersin-mersin-310098971192/",
      "price": "AUD $335,302",
      "location": "Yenişehir, Kuzeykent, Mersin, Mersin 33110",
      "description": "New Investment Flats in an Excellent Location in Yeniehir, Mersin Mersin is a key port city that attracts both local and international buyers. Thanks to its location on the Mediterranean coast, modern infrastructure, and growing economy, it has become one of the regions most attractive places to live and invest. Yeniehir, one of Mersins largest and most developed districts, is known for its population, easy transportation, and central location. The city also offers a high quality of life with its warm climate, torquise sea, long beaches, and rich cultural and natural beauty. Mersin International Port, strong tourism investments, and the international airport nearby add to its appeal. The flats for sale in Mersin Turkey are close to daily amenities. The nearest supermarket is just 300 meters away. Hospitals and clinics are only 800 meters from the site, restaurants are 900 meters away, and cafs are within 1 km. The flats are also 3 km from Sayapark Shopping Mall, 5 km from Mersin Marina, 5.8 km from Forum Mersin, and 74 km from ukurova International Airport. Built on a 2, 014 m plot, this boutique project consists of one 11-story building. It offers not only a great location but also a variety of shared features for residents. These include a swimming pool, outdoor parking, generator, barbecue and sitting areas, walking and biking paths, an electric car charging station, and a playground. The 2-bedroom flats include a living room, separate kitchen, balcony, childrens room, and bathroom. With their modern design, high-quality finishes, and practical layout, these flats offer a bright, comfortable, and stylish place to live. COV-00210"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/beylikduzu-sahil-istanbul-istanbul-310098971197/",
      "price": "AUD $470,050",
      "location": "Beylikdüzü, Sahil, Istanbul, İstanbul 34520",
      "description": "Chic Sea View Flats in a Luxury Complex in Beylikdz The luxurious flats are located in the Sahil Neighborhood in Beylikdz District. Beylikdz District is surrounded by the Marmara Sea from the south, Avclar District from the east, Bykekmece District from the west, and Esenyurt District from the north. The district is the new attraction point of stanbul with its spacious and lively streets and abundant greeneries. The stylish flats for sale in Istanbul Beylikduzu are 1 km to the beach and Beylikdz Marina, 4 km to Marmara Park Mall, 5 km to E-5 highway and the metrobus, 8 km to Kkekmece Lake, and 32 km to stanbul Airport. The well-located flats reside in a complex built upon 7.800 sqm land. The complex consisting of 6 blocks and 92 flats in total provides its inhabitants with indoor and outdoor swimming pools, a Turkish bath, a sauna, a steam room, a spacious and well-kept garden, 24/7 security service, and security cameras. The newly built flats feature apart kitchens, balconies, and en-suite bathrooms in addition to bedrooms and living rooms. The contemporary-designed flats are equipped with steel entrance doors, chic kitchen cabinets, built-in kitchen appliances, laminated and ceramic floorings, showers, PVC double glazed balcony doors, and windows. IST-0889"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/bahcelievler-siyavuspasa-istanbul-istanbul-310098971169/",
      "price": "AUD $101,909",
      "location": "Bahçelievler, Siyavuşpaşa, İstanbul, İstanbul 34182",
      "description": "Key-Ready 1-Bedroom Apartment with Separate Kitchen in Bahelievler The ready-to-move apartment is situated in the Bahelievler district on the European side of Istanbul. In recent years, Bahelievler has gained attention with its central location and urban renewal projects. The area offers easy access to shopping centers, parks, schools, and public transportation. This apartment for sale in Bahelievler, Istanbul, is within walking distance of daily amenities and located 100 meters from Siyavupaa Cultural and Sports Complex, 150 meters from the bus stop, 200 meters from Bahelievler State Hospital, 1.2 km from Dr. Sadi Konuk Training and Research Hospital Bahelievler Outpatient Clinic, 1.4 km from the metro station, 1.6 km from Medicana Bahelievler Hospital, 1.7 km from the Metrobus station, 10.4 km from ili-Mecidiyeky, 16 km from Taksim Square, and 35.3 km from Istanbul Airport. Built in 2013, the building is situated on a corner lot and consists of a single 5-story block with a total of 12 apartments. It is equipped with an elevator, security cameras, and 24/7 security services. The 1-bedroom apartment has a gross area of 55 m and a net area of 50 m and is located on the first floor. It consists of 1 bedroom, 1 living room, 1 separate kitchen, and 1 bathroom. The apartment is enriched with features such as laminate and ceramic flooring, a central satellite system, and a shower cabin. IST-01674"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/zuhtupasa-mah-istanbul-istanbul-310098970866/",
      "price": "AUD $1,628,514",
      "location": "Zühtüpaşa Mah., İstanbul, İstanbul 34724",
      "description": ""
    },
    {
      "url": "https://www.realestate.com.au/international/tr/erdemli-cesmeli-mersin-mersin-310098970818/",
      "price": "AUD $151,087",
      "location": "Erdemli, Çeşmeli, Mersin, Mersin 33875",
      "description": "Stylish Flats in a Complex with Pool near the Beach in Mersin Cesmeli The flats with 1 or 2 bedrooms are equipped with high-quality cabinets in the bathrooms, kitchens, and hallways. They also feature stylish PVC windows, balcony railings, shower cabins, bathroom fixtures, steel doors, and silicone wall paints. The flats are located in an 11-storey building, situated on a 4.877 m plot area. The complex includes a swimming pool, parking lot, gazebos, children's playground, security cameras, and generators. The project is located in the emeli region in Mersin. Mersin is a popular Mediterranean city, featuring a mild climate, beautiful beaches, and well-developed transportation connections. The city attracts investors, holidaymakers, and expats. The flats for sale in Mersin are located 200 m to the beach, 300 m to the restaurant, 15 km to Erdemli State Hospital and NovaCity Mall, 24 km to Mersin Marina, 30 km to Forum Mall, and 88 km to ukurova International Airport. ICX-0169"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/demirtas-demirtas-bursa-310098970735/",
      "price": "AUD $115,537",
      "location": "Demirtaş, Demirtaş, Bursa (province) 16245",
      "description": "An apartment in Demirtas (Alanya) for sale Apartment layout: 1+1, total area: 60 sq.m, distance to the beach: 500 m If you are interested in low-budget housing in Alanya, then Demirtas is for you. Previously, Demirtas was little developed, but now due to the shortage of the plots in the districts close to the city center, Demirtas is now being actively built up and its social infrastructure is rapidly developing. Today Demirtas has basic shops and supermarkets, a market, gas stations, pharmacies, a post office and many schools. Demirtas has beautiful nature, fresh air and wide deserted beaches. It is 18 km from the center of Alanya and the public transport runs along the sea. One of the main advantages of this district is that it is only 17 km away from Gazipasa International Airport. The Demirtas real estate with hotel infrastructure has a high rental potential. The district infrastructure: five primary schools, two middle schools, a lyceum, supermarkets, a market, shops, pharmacies, ATMs, a post office, taxi, gas stations and other infrastructure options located on the central street along a mountain river. The famous Sapadere Canyon open for tourists and other natural beauties are located higher up the riverbed. Numerous parks, recreation areas and playgrounds are located throughout the district."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/side-507-sk-10-a-07330-manavgat-antalya-turkiye-side-antalya-310098970539/",
      "price": "AUD $151,087",
      "location": "Side, 507. Sk. 10/A, 07330 Manavgat/Antalya, Türkiye, Side, Antalya 07600",
      "description": "CENNET RESIDENCE SITE, LOCATED IN THE SIDE PARADISES REGION, WAS BUILT IN 2004. OUR APARTMENT BASEMENT FLOOR CONSISTS OF 2 BEDROOMS, 2 BATHROOMS/WC AND 2 BALCONIES. THE WAREHOUSE WITH CONDOMINIUM OWNERSHIP IS A TITLE DEED AND THERE IS A ZONING AMNESTY. THE LOCATION IS CENTRAL AND WITHIN WALKING DISTANCE OF SOCIAL AND COMMERCIAL AREAS. CALL FOR DETAILED INFORMATION AND ON-SITE PRESENTATION. YOURS TRULY UGUR FIRE"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/oba-belediyesi-oba-belediyesi-antalya-310098970561/",
      "price": "AUD $158,197",
      "location": "Oba Belediyesi, Oba Belediyesi, Antalya 07460",
      "description": "Nestled in the sought-after location of Oba in Alanya, Antalya, this luxury apartment promises an exceptional lifestyle for discerning buyers and investors alike. Just 2300 meters from the sparkling sea, the property is situated in a newly built residential complex designed to deliver modern comfort and high standards of living. This exquisite apartment features one bedroom and one bathroom, spanning a generous living area of 55 square meters. The interiors are crafted with premium materials, reflecting contemporary design and ensuring unparalleled comfort and convenience. Enjoy the ease of secured parking, and rest assured with state-of-the-art video surveillance systems. Residents of this outstanding complex benefit from a plethora of amenities. Dive into relaxation with both indoor and outdoor swimming pools, unwind at the spa, or savor a delicious cup of coffee at the on-site caf. Fitness enthusiasts will appreciate the modern gym facilities, while families can enjoy dedicated children's areas for play and development. With landscaped relaxation areas, you can immerse yourself in the tranquility and beauty of the surroundings. This luxurious apartment in Alanyas vibrant Oba area presents a remarkable opportunity for those seeking an idyllic permanent residence or an attractive real estate investment in one of Turkeys premier tourist destinations. Priced competitively at $89, 000, this is a unique chance to own a slice of paradise."
    }
  ],
  "page_2": [
    {
      "url": "https://www.realestate.com.au/international/tr/istanbul-sisli-istanbul-310098970473/",
      "price": "AUD $613,234",
      "location": "Istanbul Sisli, İstanbul 34360",
      "description": "The apartment for sale is located in Sisli. Istanbul Sisli is a district located on the European side of Istanbul. It is one of the most populous and central districts of the city. It is bordered by the districts of Beyoglu, Kagithane, Sariyer, Eyup, and Besiktas. Additionally, it has many historical buildings, monuments, parks, and museums. The district also has a large population of immigrants from various countries and offers a diverse range of cultural experiences.Public transportation options such as The M2 line metro. It is also possible to travel within the district and throughout Istanbul with bus and minibus lines. The minibus option can be used for movements within the district.One of the key transportation routes serving the area is the TEM Expressway, also known as the D-100, which provides a direct connection between the European and Asian sides of Istanbul. Another major highway in the area is the E-5, which runs through Istanbul and provides easy access to other parts of the city.Some of the notable hospitals in the area include, Sisli Etfal Training and Research Hospital, Istanbul University Cerrahpasa Faculty of Medicine, Istanbul Sisli Etfal Training and Research Hospital, and Acibadem Sisli Hospital.Popular shopping places in Sisli include: Nisantasi: This is a high-end shopping district that is home to luxury fashion boutiques, designer shops, and upscale restaurants. Cevahir Shopping and Entertainment Center: This is the largest shopping center in Europe and offers a wide range of shopping and entertainment options. Osmanbey street: This is a modern shopping street with a large selection of shops, restaurants, and cafes. Profilo Shopping Center: This is a large shopping center that offers a variety of shopping and entertainment options, including a movie theater and a food court.The closest airport is approx. 0-50 km away.The apartment offers a living space of 43 m. This includes a bed-/living room and a bathroom. The bathroom offers a shower. There is an open kitchen and ready installed appliances.The property provides SAT/TV and air conditioning.The complex includes lifts for your convenience.For leisure activities a fitness room can be used. For your relaxation a sauna is available.The real estate comes with a parking space.For your safety a 24/7 surveillance system and a security service are active. This is in Turkey quite common for upscale living space.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %.Upon signing a purchase contract, a placement / termination fee of 0 % including VAT on the purchase price will be charged to the buyer."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/antalya-manavgat-antalya-310098970276/",
      "price": "AUD $388,381",
      "location": "Antalya Manavgat, Antalya 07600",
      "description": "The villa for sale is located in Manavgat. Manavgat is at the heart of the Turkish Riviera and governed by the province Antalya. The city of Manavgat has seen considerable growth in recent years and when combined with the surrounding areas counts more than 250.000 inhabitants. One of Manavgat's famous districts, right next to the Mediterranean Sea, is Side. Side is well known for it's antique amphitheatre, luxurious hotels and white beaches. The region offers uncountable sights and impressive nature. The Manavgat river and waterfall, the bordering Taurus Mountains, an active nightlife and fresh fruits and vegetable all year long make life rich and healthy, up to the point that one does not want to leave for long or come back at the earliest chance. The same can be said for the whole area stretching from Antalya to Alanya.The property has lovely 110 m of living space. In total there are 4 rooms and 2 bathrooms. All rooms can be used as a bedroom or living room.A beautiful garden is part of the property.A swimming pool for cooling down and to enjoy during a nice summer day is part of the property.The house can be bought fully equipped with all kitchen appliances installed.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/istanbul-sisli-istanbul-310098970208/",
      "price": "AUD $1,350,892",
      "location": "Istanbul Sisli, İstanbul 34360",
      "description": "The apartment for sale is located in Sisli. Istanbul Sisli is a district located on the European side of Istanbul. It is one of the most populous and central districts of the city. It is bordered by the districts of Beyoglu, Kagithane, Sariyer, Eyup, and Besiktas. Additionally, it has many historical buildings, monuments, parks, and museums. The district also has a large population of immigrants from various countries and offers a diverse range of cultural experiences.Public transportation options such as The M2 line metro. It is also possible to travel within the district and throughout Istanbul with bus and minibus lines. The minibus option can be used for movements within the district.One of the key transportation routes serving the area is the TEM Expressway, also known as the D-100, which provides a direct connection between the European and Asian sides of Istanbul. Another major highway in the area is the E-5, which runs through Istanbul and provides easy access to other parts of the city.Some of the notable hospitals in the area include, Sisli Etfal Training and Research Hospital, Istanbul University Cerrahpasa Faculty of Medicine, Istanbul Sisli Etfal Training and Research Hospital, and Acibadem Sisli Hospital.Popular shopping places in Sisli include: Nisantasi: This is a high-end shopping district that is home to luxury fashion boutiques, designer shops, and upscale restaurants. Cevahir Shopping and Entertainment Center: This is the largest shopping center in Europe and offers a wide range of shopping and entertainment options. Osmanbey street: This is a modern shopping street with a large selection of shops, restaurants, and cafes. Profilo Shopping Center: This is a large shopping center that offers a variety of shopping and entertainment options, including a movie theater and a food court.The closest airport is approx. 0-50 km away.The apartment has a living space of 97 m. In total there are 3 rooms and a bathroom. All rooms can be used as a bedroom or living room. The bathroom offers a shower. The open kitchen is set up with preinstalled appliances.The property provides SAT/TV and air conditioning.The complex includes lifts for your convenience.For leisure activities a fitness room can be used. For your relaxation a sauna is available.Parking space is available.For your safety a 24/7 surveillance system and a security service are active. This is in Turkey quite common for upscale living space.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %.Upon signing a purchase contract, a placement / termination fee of 0 % including VAT on the purchase price will be charged to the buyer."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/antalya-manavgat-antalya-310098970217/",
      "price": "AUD $384,293",
      "location": "Antalya Manavgat, Antalya 07600",
      "description": "The apartment for sale is located in Manavgat. Manavgat is at the heart of the Turkish Riviera and governed by the province Antalya. The city of Manavgat has seen considerable growth in recent years and when combined with the surrounding areas counts more than 250.000 inhabitants. One of Manavgat's famous districts, right next to the Mediterranean Sea, is Side. Side is well known for it's antique amphitheatre, luxurious hotels and white beaches. The region offers uncountable sights and impressive nature. The Manavgat river and waterfall, the bordering Taurus Mountains, an active nightlife and fresh fruits and vegetable all year long make life rich and healthy, up to the point that one does not want to leave for long or come back at the earliest chance. The same can be said for the whole area stretching from Antalya to Alanya.The closest airport is approx. 50 km away.The apartment offers a living space of 135 m. In total there are 4 rooms and a bathroom. All rooms can be used as a bedroom or living room. A shower and a bathtub are part of the unit. There is an open kitchen and ready installed appliances. A private balcony is included in this apartment.The property provides SAT/TV, internet, air conditioning and blinds.The complex includes lifts for your convenience. The outdoor area includes a lovely community garden as part of the complex.For leisure activities a pool can be used.Parking space is available.For your safety a 24/7 surveillance system and a security service are active. This is in Turkey quite common for upscale living space.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/alanya-okurcalar-antalya-310098970171/",
      "price": "AUD $218,631",
      "location": "Alanya Okurcalar, Antalya 07410",
      "description": "The apartment for sale is located in Alanya. Alanya belongs to the province of Antalya. By car the ride from the city of Antalya to Alanya takes about 120 minutes. Alanya is a well known holiday destination as well. The city has a rich history dating back to late antiquity. The founding of the city presumably goes back to the hellenic period. On top of this Alanya offers a diverse nature, long beaches and many attractions. Alanya has got an own airport with a limited number of international flights (via Istanbul most destinations are available).The sea is visible from the property.From the apartment it is around 0, 5-1 km to the beach. The closest airport is approx. 50-100 km away.The apartment offers a living space of 80 m. This includes a bed-/living room and a bathroom. The bathroom offers a shower. The kitchen concept has an open design. A private balcony is included in this apartment.The property provides SAT/TV and air conditioning.The complex includes lifts for your convenience. A community garden including a barbecue can be used.For leisure activities a pool and fitness room can be used. For your relaxation a sauna is available.A parking space is also available.For your safety a 24/7 surveillance system and a security service are active. This is in Turkey quite common for upscale living space.The apartment can be purchased fully equipped with all kitchen appliances installed.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %.Upon signing a purchase contract, a placement / termination fee of 0 % including VAT on the purchase price will be charged to the buyer."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/alanya-oba-antalya-310098970064/",
      "price": "AUD $263,068",
      "location": "Alanya Oba, Antalya 07460",
      "description": "The apartment for sale is located in Oba, close to the centre of Alanya. Alanya belongs to the province of Antalya. By car the ride from the city of Antalya to Alanya takes about 120 minutes. Alanya is a well known holiday destination. The city has a rich history dating back to late antiquity. The founding of the city presumably dates back to the hellenic period. On top of this Alanya offers a diverse nature, long beaches and many attractions. Alanya has got an own airport with a limited number of international flights as well (via Istanbul most destinations are available).In close proximity you can find cafs, restaurants, hospitals, pharmacies, schools, banks, super markets, shops, bars and public transport.From the apartment it is around 1-5 km to the beach. The closest airport is approx. 100+ km away.The apartment has a living space of 55 m. This includes a bed-/living room with an en-suite bathroom. The bathroom offers a shower. The kitchen of the property is integrated into the living room. The private balcony offers fresh air all year around.The property provides SAT/TV.The complex includes lifts for your convenience. A community garden including a barbecue can be used.For leisure activities a pool and fitness room can be used. For relaxation a sauna and a turkish bath are integrated into the facility.A parking space is also available.For your safety a 24/7 surveillance system and a security service are active. This is in Turkey quite common for upscale living space. A maintenance service and a janitor are taking care of the facility.The apartment can be purchased fully equipped with all kitchen appliances installed.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %.Upon signing a purchase contract, a placement / termination fee of 0 % including VAT on the purchase price will be charged to the buyer."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/istanbul-sisli-istanbul-310098970069/",
      "price": "AUD $21,241,001",
      "location": "Istanbul Sisli, İstanbul 34360",
      "description": "The apartment for sale is located in Sisli. Istanbul Sisli is a district located on the European side of Istanbul. It is one of the most populous and central districts of the city. It is bordered by the districts of Beyoglu, Kagithane, Sariyer, Eyup, and Besiktas. Additionally, it has many historical buildings, monuments, parks, and museums. The district also has a large population of immigrants from various countries and offers a diverse range of cultural experiences.Public transportation options such as The M2 line metro. It is also possible to travel within the district and throughout Istanbul with bus and minibus lines. The minibus option can be used for movements within the district.One of the key transportation routes serving the area is the TEM Expressway, also known as the D-100, which provides a direct connection between the European and Asian sides of Istanbul. Another major highway in the area is the E-5, which runs through Istanbul and provides easy access to other parts of the city.Some of the notable hospitals in the area include, Sisli Etfal Training and Research Hospital, Istanbul University Cerrahpasa Faculty of Medicine, Istanbul Sisli Etfal Training and Research Hospital, and Acibadem Sisli Hospital.Popular shopping places in Sisli include: Nisantasi: This is a high-end shopping district that is home to luxury fashion boutiques, designer shops, and upscale restaurants. Cevahir Shopping and Entertainment Center: This is the largest shopping center in Europe and offers a wide range of shopping and entertainment options. Osmanbey street: This is a modern shopping street with a large selection of shops, restaurants, and cafes. Profilo Shopping Center: This is a large shopping center that offers a variety of shopping and entertainment options, including a movie theater and a food court.The property has an unobstructed sea view. Wake up every morning to alluring colours of blue and green.From the apartment it is around 2 km to the beach. The closest airport is approx. 40 km away.The apartment has a living space of 765 m. In total there are 9 rooms and 3 bathrooms. All rooms can be used as a bedroom or living room. The bathroom offers a shower. The apartment has got an open kitchen concept.The property provides SAT/TV, internet and air conditioning.The complex includes lifts for your convenience. The outdoor area includes a lovely community garden as part of the complex.For leisure activities a pool and fitness room can be used. For relaxation a sauna and a turkish bath are integrated into the facility.The real estate comes with a parking space.For your safety a 24/7 surveillance system and a security service are active. This is in Turkey quite common for upscale living space.The apartment can be purchased fully equipped with all kitchen appliances installed.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/istanbul-sisli-istanbul-310098969933/",
      "price": "AUD $10,611,613",
      "location": "Istanbul Sisli, İstanbul 34360",
      "description": "The apartment for sale is located in Sisli. Istanbul Sisli is a district located on the European side of Istanbul. It is one of the most populous and central districts of the city. It is bordered by the districts of Beyoglu, Kagithane, Sariyer, Eyup, and Besiktas. Additionally, it has many historical buildings, monuments, parks, and museums. The district also has a large population of immigrants from various countries and offers a diverse range of cultural experiences.Public transportation options such as The M2 line metro. It is also possible to travel within the district and throughout Istanbul with bus and minibus lines. The minibus option can be used for movements within the district.One of the key transportation routes serving the area is the TEM Expressway, also known as the D-100, which provides a direct connection between the European and Asian sides of Istanbul. Another major highway in the area is the E-5, which runs through Istanbul and provides easy access to other parts of the city.Some of the notable hospitals in the area include, Sisli Etfal Training and Research Hospital, Istanbul University Cerrahpasa Faculty of Medicine, Istanbul Sisli Etfal Training and Research Hospital, and Acibadem Sisli Hospital.Popular shopping places in Sisli include: Nisantasi: This is a high-end shopping district that is home to luxury fashion boutiques, designer shops, and upscale restaurants. Cevahir Shopping and Entertainment Center: This is the largest shopping center in Europe and offers a wide range of shopping and entertainment options. Osmanbey street: This is a modern shopping street with a large selection of shops, restaurants, and cafes. Profilo Shopping Center: This is a large shopping center that offers a variety of shopping and entertainment options, including a movie theater and a food court.The property has a stunning sea view. These impressions help start the day with pleasant energy.From the apartment it is around 3 km to the beach. The closest airport is approx. 50 km away.The apartment offers a living space of 395 m. In total there are 5 rooms and 3 bathrooms. All rooms can be used as a bedroom or living room. The bathroom offers a shower. A private balcony is included in this apartment.The property provides SAT/TV and internet.The complex includes lifts for your convenience. The outdoor area includes a lovely community garden as part of the complex.For leisure activities a pool and fitness room can be used.Parking space is available.For your safety a 24/7 surveillance system and a security service are active. This is in Turkey quite common for upscale living space.The apartment can be purchased fully equipped with all kitchen appliances installed.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %.Upon signing a purchase contract, a placement / termination fee of 0 % including VAT on the purchase price will be charged to the buyer."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/alanya-oba-antalya-310098969899/",
      "price": "AUD $312,838",
      "location": "Alanya Oba, Antalya 07460",
      "description": "The apartment for sale is located in Oba, close to the centre of Alanya. Alanya belongs to the province of Antalya. By car the ride from the city of Antalya to Alanya takes about 120 minutes. Alanya is a well known holiday destination. The city has a rich history dating back to late antiquity. The founding of the city presumably dates back to the hellenic period. On top of this Alanya offers a diverse nature, long beaches and many attractions. Alanya has got an own airport with a limited number of international flights as well (via Istanbul most destinations are available).In close proximity you can find cafs, restaurants, hospitals, pharmacies, schools, banks, super markets, shops, bars and public transport.From the apartment it is around 1-5 km to the beach. The closest airport is approx. 100+ km away.The apartment has a living space of 100 m. In total there are 3 rooms and 3 bathrooms. All rooms can be used as a bedroom or living room. The apartment has got an open kitchen concept. The apartment also includes a private balcony.The property provides SAT/TV and air conditioning.The complex includes lifts for your convenience. A community garden including a barbecue can be used.For leisure activities a pool and fitness room can be used. For your relaxation a sauna is available.A parking space is also available.The complex includes a surveillance system. Most upscale homes in Turkey are outfitted with a similar system.The apartment can be purchased fully equipped with all kitchen appliances installed.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %.Upon signing a purchase contract, a placement / termination fee of 0 % including VAT on the purchase price will be charged to the buyer."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/istanbul-sisli-istanbul-310098969818/",
      "price": "AUD $1,546,416",
      "location": "Istanbul Sisli, İstanbul 34360",
      "description": "The apartment for sale is located in Sisli. Istanbul Sisli is a district located on the European side of Istanbul. It is one of the most populous and central districts of the city. It is bordered by the districts of Beyoglu, Kagithane, Sariyer, Eyup, and Besiktas. Additionally, it has many historical buildings, monuments, parks, and museums. The district also has a large population of immigrants from various countries and offers a diverse range of cultural experiences.Public transportation options such as The M2 line metro. It is also possible to travel within the district and throughout Istanbul with bus and minibus lines. The minibus option can be used for movements within the district.One of the key transportation routes serving the area is the TEM Expressway, also known as the D-100, which provides a direct connection between the European and Asian sides of Istanbul. Another major highway in the area is the E-5, which runs through Istanbul and provides easy access to other parts of the city.Some of the notable hospitals in the area include, Sisli Etfal Training and Research Hospital, Istanbul University Cerrahpasa Faculty of Medicine, Istanbul Sisli Etfal Training and Research Hospital, and Acibadem Sisli Hospital.Popular shopping places in Sisli include: Nisantasi: This is a high-end shopping district that is home to luxury fashion boutiques, designer shops, and upscale restaurants. Cevahir Shopping and Entertainment Center: This is the largest shopping center in Europe and offers a wide range of shopping and entertainment options. Osmanbey street: This is a modern shopping street with a large selection of shops, restaurants, and cafes. Profilo Shopping Center: This is a large shopping center that offers a variety of shopping and entertainment options, including a movie theater and a food court.The closest airport is approx. 0-50 km away.The apartment has a living space of 112 m. In total there are 4 rooms and a bathroom. All rooms can be used as a bedroom or living room. The bathroom offers a shower. The open kitchen includes installed kitchen appliances.The property provides SAT/TV and air conditioning.The complex includes lifts for your convenience.For leisure activities a fitness room can be used. For your relaxation a sauna is available.Parking space is available.For your safety a 24/7 surveillance system and a security service are active. This is in Turkey quite common for upscale living space.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %.Upon signing a purchase contract, a placement / termination fee of 0 % including VAT on the purchase price will be charged to the buyer."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/antalya-aksu-antalya-310098969775/",
      "price": "AUD $116,603",
      "location": "Antalya Aksu, Antalya 07112",
      "description": "The apartment for sale is located in Aksu. The Aksu district lies between the Dden and Aksu streams. It is located to the east of Antalyas city center. Aksu is bordered by Muratpaa in the southwest, Kepez in the west, Demealt in the northwest, Serik District in the east, and Isparta Province in the north.This amazing region has a lot to offer. It dates back to 1200 BC. The area where the district is located has experienced the Hellenistic, Roman and Byzantine periods. There is also the Kurunlu Waterfall, Perge and ancient theater ruins located in Aksu.The closest airport is approx. 50 km away.The apartment offers a living space of 55 m. In total there are 2 rooms and a bathroom. All rooms can be used as a bedroom or living room. A shower and a bathtub are part of the unit. There is an open kitchen and ready installed appliances. A private balcony is included in this apartment.The property provides SAT/TV, internet, air conditioning and blinds.The outdoor area includes a lovely community garden as part of the complex.For leisure activities a pool can be used.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/alanya-oba-antalya-310098969743/",
      "price": "AUD $389,270",
      "location": "Alanya Oba, Antalya 07460",
      "description": "The apartment for sale is located in Oba, close to the centre of Alanya. Alanya belongs to the province of Antalya. By car the ride from the city of Antalya to Alanya takes about 120 minutes. Alanya is a well known holiday destination. The city has a rich history dating back to late antiquity. The founding of the city presumably dates back to the hellenic period. On top of this Alanya offers a diverse nature, long beaches and many attractions. Alanya has got an own airport with a limited number of international flights as well (via Istanbul most destinations are available).In close proximity you can find cafs, restaurants, hospitals, pharmacies, schools, banks, super markets, shops, bars and public transport.From the apartment it is around 3 km to the beach. The closest airport is approx. 50 km away.The apartment has a living space of 80 m. In total there are 3 rooms and a bathroom. All rooms can be used as a bedroom or living room. The bathroom offers a bathtub. The kitchen of the property is integrated into the living room. The private balcony offers fresh air all year around.The property provides SAT/TV and internet.The complex includes lifts for your convenience.For leisure activities a pool and fitness room can be used.Parking space is available.The apartment can be purchased fully equipped with all kitchen appliances installed.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/istanbul-sisli-istanbul-310098969581/",
      "price": "AUD $8,887,448",
      "location": "Istanbul Sisli, İstanbul 34360",
      "description": "The apartment for sale is located in Sisli. Istanbul Sisli is a district located on the European side of Istanbul. It is one of the most populous and central districts of the city. It is bordered by the districts of Beyoglu, Kagithane, Sariyer, Eyup, and Besiktas. Additionally, it has many historical buildings, monuments, parks, and museums. The district also has a large population of immigrants from various countries and offers a diverse range of cultural experiences.Public transportation options such as The M2 line metro. It is also possible to travel within the district and throughout Istanbul with bus and minibus lines. The minibus option can be used for movements within the district.One of the key transportation routes serving the area is the TEM Expressway, also known as the D-100, which provides a direct connection between the European and Asian sides of Istanbul. Another major highway in the area is the E-5, which runs through Istanbul and provides easy access to other parts of the city.Some of the notable hospitals in the area include, Sisli Etfal Training and Research Hospital, Istanbul University Cerrahpasa Faculty of Medicine, Istanbul Sisli Etfal Training and Research Hospital, and Acibadem Sisli Hospital.Popular shopping places in Sisli include: Nisantasi: This is a high-end shopping district that is home to luxury fashion boutiques, designer shops, and upscale restaurants. Cevahir Shopping and Entertainment Center: This is the largest shopping center in Europe and offers a wide range of shopping and entertainment options. Osmanbey street: This is a modern shopping street with a large selection of shops, restaurants, and cafes. Profilo Shopping Center: This is a large shopping center that offers a variety of shopping and entertainment options, including a movie theater and a food court.The apartment offers a view to the sea. Wake up with an exquisite view every morning.From the apartment it is around 2 km to the beach. The closest airport is approx. 40 km away.The apartment has a living space of 384 m. In total there are 5 rooms and a bathroom. All rooms can be used as a bedroom or living room. The bathroom offers a shower. The apartment has got an open kitchen concept.The property provides SAT/TV, internet and air conditioning.The complex includes lifts for your convenience. The outdoor area includes a lovely community garden as part of the complex.For leisure activities a pool and fitness room can be used. For relaxation a sauna and a turkish bath are integrated into the facility.Parking space is available.For your safety a 24/7 surveillance system and a security service are active. This is in Turkey quite common for upscale living space.The apartment can be purchased fully equipped with all kitchen appliances installed.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/antalya-aksu-antalya-310098969582/",
      "price": "AUD $452,193",
      "location": "Antalya Aksu, Antalya 07112",
      "description": "The apartment for sale is located in Aksu. The Aksu district lies between the Dden and Aksu streams. It is located to the east of Antalyas city center. Aksu is bordered by Muratpaa in the southwest, Kepez in the west, Demealt in the northwest, Serik District in the east, and Isparta Province in the north.This amazing region has a lot to offer. It dates back to 1200 BC. The area where the district is located has experienced the Hellenistic, Roman and Byzantine periods. There is also the Kurunlu Waterfall, Perge and ancient theater ruins located in Aksu.From the apartment it is around 5 km to the beach. The closest airport is approx. 6 km away.The apartment has a living space of 127 m. In total there are 3 rooms and a bathroom. All rooms can be used as a bedroom or living room. The bathroom offers a shower. The open kitchen is set up with preinstalled appliances. The private balcony offers fresh air all year around.The property provides SAT/TV, internet and air conditioning.The complex includes lifts for your convenience. The outdoor area includes a lovely community garden as part of the complex.For leisure activities a pool and fitness room can be used. For your relaxation a sauna is available.The real estate comes with a parking space.For your safety a 24/7 surveillance system and a security service are active. This is in Turkey quite common for upscale living space.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/antalya-manavgat-antalya-310098969513/",
      "price": "AUD $370,073",
      "location": "Antalya Manavgat, Antalya 07600",
      "description": "The apartment for sale is located in Manavgat. Manavgat is at the heart of the Turkish Riviera and governed by the province Antalya. The city of Manavgat has seen considerable growth in recent years and when combined with the surrounding areas counts more than 250.000 inhabitants. One of Manavgat's famous districts, right next to the Mediterranean Sea, is Side. Side is well known for it's antique amphitheatre, luxurious hotels and white beaches. The region offers uncountable sights and impressive nature. The Manavgat river and waterfall, the bordering Taurus Mountains, an active nightlife and fresh fruits and vegetable all year long make life rich and healthy, up to the point that one does not want to leave for long or come back at the earliest chance. The same can be said for the whole area stretching from Antalya to Alanya.From the apartment it is around 1-5 km to the beach. The closest golf course can be reached in approx. 45 km. The closest airport is approx. 61 km away.The apartment has a living space of 100 m. In total there are 4 rooms and 2 bathrooms. All rooms can be used as a bedroom or living room. The bathroom offers a shower. The open kitchen is set up with preinstalled appliances. The private balcony offers fresh air all year around.The property provides SAT/TV, internet and air conditioning.The outdoor area includes a lovely community garden as part of the complex.For leisure activities a pool can be used.Parking space is available.For your safety a 24/7 surveillance system and a security service are active. This is in Turkey quite common for upscale living space.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/istanbul-sisli-istanbul-310098969497/",
      "price": "AUD $14,913,138",
      "location": "Istanbul Sisli, İstanbul 34360",
      "description": "The apartment for sale is located in Sisli. Istanbul Sisli is a district located on the European side of Istanbul. It is one of the most populous and central districts of the city. It is bordered by the districts of Beyoglu, Kagithane, Sariyer, Eyup, and Besiktas. Additionally, it has many historical buildings, monuments, parks, and museums. The district also has a large population of immigrants from various countries and offers a diverse range of cultural experiences.Public transportation options such as The M2 line metro. It is also possible to travel within the district and throughout Istanbul with bus and minibus lines. The minibus option can be used for movements within the district.One of the key transportation routes serving the area is the TEM Expressway, also known as the D-100, which provides a direct connection between the European and Asian sides of Istanbul. Another major highway in the area is the E-5, which runs through Istanbul and provides easy access to other parts of the city.Some of the notable hospitals in the area include, Sisli Etfal Training and Research Hospital, Istanbul University Cerrahpasa Faculty of Medicine, Istanbul Sisli Etfal Training and Research Hospital, and Acibadem Sisli Hospital.Popular shopping places in Sisli include: Nisantasi: This is a high-end shopping district that is home to luxury fashion boutiques, designer shops, and upscale restaurants. Cevahir Shopping and Entertainment Center: This is the largest shopping center in Europe and offers a wide range of shopping and entertainment options. Osmanbey street: This is a modern shopping street with a large selection of shops, restaurants, and cafes. Profilo Shopping Center: This is a large shopping center that offers a variety of shopping and entertainment options, including a movie theater and a food court.The apartment offers a view to the sea. Wake up with an exquisite view every morning.The closest airport is approx. 0-50 km away.The apartment has a living space of 561 m. In total there are 6 rooms and 3 bathrooms. All rooms can be used as a bedroom or living room. A shower and a bathtub are part of the unit. The open kitchen includes installed kitchen appliances. The apartment also includes a private balcony.The property provides SAT/TV and air conditioning.The complex includes lifts for your convenience. The outdoor area includes a lovely community garden as part of the complex.For leisure activities a pool and fitness room can be used.The real estate comes with a parking space.For your safety a 24/7 surveillance system and a security service are active. This is in Turkey quite common for upscale living space.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/kargıcak-belediyesi-kargıcak-belediyesi-antalya-310098969118/",
      "price": "AUD $259,513",
      "location": "Kargıcak Belediyesi, Kargıcak Belediyesi, Antalya",
      "description": "Where Mediterranean Luxury Meets Mountain Serenity Nestled among lush banana gardens with the majestic Taurus Mountains as a backdrop, this extraordinary new development offers an unmatched opportunity for discerning investors seeking refined living on Turkeys coveted Mediterranean coast. Located in the serene Kargicak district of Alanya, this property occupies 7, 900 m of pristine land, just 2 kilometers from the azure waters of the Mediterranean Sea. The meticulously designed complex features three elegant blocks, each rising six stories and housing 64 bespoke residences. Sizes range from intimate 49 m apartments to expansive 170 m living spaces, available in various configurations including 1+1, 2+1, garden floor duplexes, and penthouse retreatsall embodying sophisticated design and premium craftsmanship. Resort-inspired amenities elevate the living experience beyond the ordinary. Residents have access to adult and childrens swimming pools with water slides, a heated indoor pool, traditional Turkish hamam, sauna, and jacuzzi for wellness. Active lifestyles are catered for with a dedicated massage room, fully equipped gym, and tennis court. Relaxation and community are fostered through thoughtfully designed resting areas and barbecue spaces. Inside each residence, no detail has been overlooked. Kitchens feature specially designed modular furniture and elegant granite countertops, while bathrooms present spa-like experiences with premium fixtures and shower cabins. Granite ceramic flooring, recessed lighting, and solid steel entrance doors add beauty and security throughout. With Alanyas vibrant city center just 16 kilometers away, and convenient access to Gazipaa Airport (25 km) and Antalya Airport (145 km), this development perfectly balances secluded tranquility with Mediterranean connectivity. Discover your sanctuary where gentle mountain breezes, Mediterranean sunshine, and uncompromising luxury create an unparalleled lifestyle."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/oba-belediyesi-oba-belediyesi-antalya-310098969065/",
      "price": "AUD $147,532",
      "location": "Oba Belediyesi, Oba Belediyesi, Antalya 07460",
      "description": "Step into the realm of modern elegance with this exquisite 1+1 apartment, nestled in the vibrant and sought-after Oba neighborhood of Alanya. Unveiled in 2023, this pristine property promises a harmonious blend of luxury and tranquility, all just 5 km from the bustling city center. Boasting a sleek and contemporary exterior, this 50 m apartment is thoughtfully designed to maximize comfort and style. Located on the second floor of a five-story complex, it features an open-plan American-style kitchen, complete with granite countertops and lacquered cabinetry. The spacious living room flows effortlessly into a cozy bedroom and a well-appointed bathroom, offering a perfect sanctuary to unwind. The east-facing balcony provides an idyllic spot to soak in the morning sun, enveloping you in warmth and serenity. The residential complex is a haven of luxurious amenities, including both outdoor and heated indoor swimming pools, a state-of-the-art fitness center, a revitalizing sauna, and a traditional Turkish bath. With 24/7 video surveillance, secure on-site parking, and a conference room for meetings or remote work, convenience is at your doorstep. This apartments location is a gateway to the best of Alanya. Just 2.5 km from the sandy beaches and stunning coastline, and a stones throw from restaurants, cafes, shopping centers, and medical facilities. With excellent public transport links and proximity to Gazipaa and Antalya airports, your new home is perfectly positioned for both local and international connections. Priced at 83, 000 and move-in ready with tasteful furnishings, this is an opportunity not to be missed. Embrace the luxurious lifestyle you've always dreamed of in this modern oasis."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/inonu-caddesi-avsallar-antalya-310098968944/",
      "price": "AUD $213,299",
      "location": "İnönü Caddesi, Avsallar, Antalya",
      "description": "Would you like to buy an apartment in Alanya and at the same time achieve a secure, attractive return? Then this new development on the Turkish Riviera is your chance for a worry-free and profitable investment. With high-quality construction, modern amenities, and a professional rental concept, this project offers everything that investors and owner-occupiers expect. Why buy an apartment in Alanya? The real estate market in Turkeyespecially in Alanyais attracting more and more investors from Europe. This is due to strong tourism demand, good infrastructure, the Mediterranean climate, and affordable entry prices. Anyone who has a Buy an apartment in Alanya, benefits in the long term from increased value and stable rental income. Advantages of buying an apartment in Alanya with Exquisite Residence 9 % guaranteed rental yield for 3 years contractually & notarially secured Professional rentals via Airbnb, Booking.com & FeWo-direkt No administration fee Full service included Flexible payment options: 20 %, 30 % or 40 % down payment + 12 interest-free installments Payment in Bitcoin, gold or silver possible 5 % discount for one-time payment Facilities Your new living comfort in Alanya At the Buying an apartment in Alanya The equipment plays an important role. This project offers: Smart home system Underfloor heating LED lighting Designer kitchen & bathroom Security windows & doors Large balconies with natural light Common areas for your well-being Outdoor pool with sun deck Wellness with sauna & steam bath Gym Children's playground Shuttle service to the beach (1 km) Buy an apartment in Alanya & rent it out worry-free Our in-house administration takes care of: Publication on booking platforms Automatic calendar and payment processing Cleaning & guest check-in/out Payout directly to your account You buy we take care of the rest. Why is Avsallar the ideal place to buy an apartment? Avsallar is one of Alanya's most attractive districts. Here you will find: Quiet residential areas Shopping, schools & doctors Well-maintained streets and green spaces Close to Incekum Beach High quality of life Alanya or Spain? The price-performance comparison While a comparable property in Spain or Greece often costs twice as much, in Alanya you get: Same equipment Better return opportunities Lower additional costs Simple purchase process with German notary contract Who is suitable for buying an apartment in Alanya? This investment is ideal for: familieswho are looking for a holiday property Pensionerwho want to live permanently in the sun Digital nomadswho value peace and infrastructure Investorswho want passive income with little effort Long-term benefits of buying an apartment in Alanya Rising property prices in Avsallar Year-round rental demand Legally secure contracts in Germany & Turkey Personal support from our office in Berlin FAQ Frequently Asked Questions How does the purchase process work? Reservation with 2040 % deposit, remainder in interest-free installments. Can I use the apartment myself? Yes, at any time you decide whether to rent it out or use it yourself. How is my investment protected? Through notarial contracts & insurance up to 200, 000. Contact & Advice Birol Dikmen +90 532 457 43 03 (WhatsApp) Request your expos now or arrange a personal consultation! Conclusion: Buy an apartment in Alanya now and secure a 9% return Anyone who now has a Buy an apartment in Alanya not only secures a piece of paradise, but also a smart and stable investment. Find out more now, request an expos and invest worry-free!"
    },
    {
      "url": "https://www.realestate.com.au/international/tr/alanya-oba-antalya-310098968903/",
      "price": "AUD $255,959",
      "location": "Alanya Oba, Antalya 07460",
      "description": "The apartment for sale is located in Oba, close to the centre of Alanya. Alanya belongs to the province of Antalya. By car the ride from the city of Antalya to Alanya takes about 120 minutes. Alanya is a well known holiday destination. The city has a rich history dating back to late antiquity. The founding of the city presumably dates back to the hellenic period. On top of this Alanya offers a diverse nature, long beaches and many attractions. Alanya has got an own airport with a limited number of international flights as well (via Istanbul most destinations are available).In close proximity you can find cafs, restaurants, hospitals, pharmacies, schools, banks, super markets, shops, bars and public transport.From the apartment it is around 1-5 km to the beach. The closest airport is approx. 0-50 km away.The apartment has a living space of 70 m. In total there are 2 rooms and a bathroom. All rooms can be used as a bedroom or living room. The bathroom offers a shower. The apartment has got an open kitchen concept. The apartment also includes a private balcony.The property provides SAT/TV and air conditioning.The complex includes lifts for your convenience. A community garden including a barbecue can be used.For leisure activities a pool and fitness room can be used. For your relaxation a sauna is available.Parking space is available.For your safety a 24/7 surveillance system and a security service are active. This is in Turkey quite common for upscale living space. A maintenance service and a janitor are taking care of the facility.The apartment can be purchased fully equipped with all kitchen appliances installed.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/alanya-oba-antalya-310098968902/",
      "price": "AUD $526,137",
      "location": "Alanya Oba, Antalya 07460",
      "description": "The apartment for sale is located in Oba, close to the centre of Alanya. Alanya belongs to the province of Antalya. By car the ride from the city of Antalya to Alanya takes about 120 minutes. Alanya is a well known holiday destination. The city has a rich history dating back to late antiquity. The founding of the city presumably dates back to the hellenic period. On top of this Alanya offers a diverse nature, long beaches and many attractions. Alanya has got an own airport with a limited number of international flights as well (via Istanbul most destinations are available).In close proximity you can find cafs, restaurants, hospitals, pharmacies, schools, banks, super markets, shops, bars and public transport.From the apartment it is around 1-5 km to the beach. The closest airport is approx. 0-50 km away.The apartment offers a living space of 145 m. In total there are 3 rooms and a bathroom. All rooms can be used as a bedroom or living room. The bathroom offers a shower. The kitchen concept has an open design.The property provides SAT/TV and air conditioning.The complex includes lifts for your convenience. The outdoor area includes a lovely community garden as part of the complex.For leisure activities a pool can be used. For relaxation a sauna and a turkish bath are integrated into the facility.Parking space is available.For your safety a 24/7 surveillance system and a security service are active. This is in Turkey quite common for upscale living space. A maintenance service and a janitor are taking care of the facility.The apartment can be purchased fully equipped with all kitchen appliances installed.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/antalya-antalya-310098968895/",
      "price": "AUD $264,846",
      "location": "Antalya, Antalya 07112",
      "description": "Our apartments, which are located in one of the most prestigious and elite regions of Aksu district of Antalya, are built with the concept of hotel and holiday village. With this advantageous location, it offers a quiet, modern and elite life. The region provides a sought-after life experience with its green nature, peaceful surroundings and proximity to Lara beaches. Our project has forest, mountain and sea views. While it is within walking distance to markets, schools and shops, it is 3 km to the sea, 4 km to dden waterfall, 11 km to Antalya city center Kaleii and marina and 2 km to Antalya Airport. Our residence, which has a 5-star hotel concept with sea view, consists of a single block and has a total of 74 apartments. There are 1+1, 2+1 and 4+1 type apartments. Our project, which is built on a land area of 5.300 m, has a modern design where you can enjoy a quiet life. Our site has many features like a common large pool, indoor pool, Aqua Park, Lobby, Electric vehicle charging units, indoor and outdoor car parking for each apartment, generator, gazebos, walking paths, meeting room, 24/7 security and security cameras, Turkish Bath, Sauna, Fitness, kids club, children and adult playgrounds, basketball and volleyball courts, tennis court, pool bar, elevator, water tank. In addition to the features such as living room, open-plan kitchen, en-suite bathroom and dressing room, each apartment has modern details such as kitchen appliances, air conditioning and underfloor heating in each room, smart home system, shower cabins and central satellite TV system. Contact us to discover these special apartments that offer you a quiet and elite life! This announcement is automatically integrated by the RE-OS Real Estate MLS Program ."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/alanya-mahmutlar-antalya-310098946958/",
      "price": "AUD $241,739",
      "location": "Alanya Mahmutlar, Antalya 07460",
      "description": "The apartment for sale is located in Mahmutlar. Mahmutlar is part of the region Alanya about 12 km east of Alanya's centre. Mahmutlar further belonged to the province of Antalya. This incredible region has much to offer. Such as the fortress of Alanya, the Damlatas cave as well as the red tower museum. Many Greek, Roman and Byzantine sights are close by. Mahmutlar offers a fantastic 5 km long beach. You will love this area as beautiful nature awaits for long walks. Discover banana and orange trees along the way.In close proximity you can find cafs, restaurants, hospitals, pharmacies, schools, banks, super markets, shops, bars and public transport.From the apartment it is around 0, 5-1 km to the beach. The closest airport is approx. 0-50 km away.The apartment has a living space of 60 m. In total there are 2 rooms and a bathroom. All rooms can be used as a bedroom or living room. The bathroom offers a shower. The apartment has got an open kitchen concept. The apartment also includes a private balcony.The property provides SAT/TV and air conditioning.The complex includes lifts for your convenience. A community garden including a barbecue can be used.For leisure activities a pool and fitness room can be used. For relaxation a sauna and a turkish bath are integrated into the facility.Parking space is available.The complex includes a surveillance system. Most upscale homes in Turkey are outfitted with a similar system. A maintenance service and a janitor are taking care of the facility.The apartment can be purchased fully equipped with all kitchen appliances installed.Square metre for property for sale in Turkey are generally stated according to English/USA standard. Net square metre excludes for example the balcony. Please substract roughly 10 to 15 %."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/eyupsultan-istanbul-istanbul-istanbul-310098946919/",
      "price": "AUD $434,013",
      "location": "Eyupsultan, Istanbul,, Istanbul, İstanbul",
      "description": "Discover Premium Apartments for Sale in Eyupsultan, Istanbul Located in the vibrant city of Istanbul, Turkey, the apartment listings in Eyupsultan offer discerning buyers a unique combination of modern amenities and cultural richness. These properties are available in 1, 2, and 3-bedroom configurations and are perfect for those seeking citizenship-eligible investments. Each apartment is designed with smart home technology, ensuring comfort and convenience for residents. Unique Features of the Apartments Nestled in a district known for its cultural heritage and vibrant community, these apartments come equipped with a range of features that stand out from the rest. Enjoy peace of mind with indoor parking, enhance your well-being at the Turkish bath, and stay warm with efficient floor heating. The properties also boast breathtaking city views, accessible via a modern elevator, and provide access to a pool, gym, volleyball, and basketball courts. For energy efficiency, natural gas infrastructure has been installed. With the city just 0.5 km away, the convenience of nearby shopping centers, the beach only 4.498 km away, and the airport at 34 km, these residences are strategically located. Why Choose Eyupsultan, Istanbul? Eyupsultan is a district brimming with history and culture. It's a place where modern living meets traditional charm, making it highly appealing to both locals and expatriates. The area offers a favorable climate and a host of local attractions such as historical landmarks, lush parks, and lively cafes. Proximity to Istanbul's city center means unparalleled access to lifestyle amenities, making it an ideal choice for families and professionals alike. Whether you seek a new home or a future investment, these apartments in Eyupsultan, Istanbul provide opportunities for both. Don't miss the chance to own a slice of Turkish heritage with modern luxuries. Contact us today to learn more about this exceptional opportunity or to schedule a visit."
    },
    {
      "url": "https://www.realestate.com.au/international/tr/bagcilar-istanbul-istanbul-istanbul-310098946900/",
      "price": "AUD $482,585",
      "location": "Bagcilar, Istanbul,, Istanbul, İstanbul",
      "description": "Explore Apartments for Sale in Bagcilar, Istanbul Discover an exceptional opportunity to own an apartment in the vibrant district of Bagcilar, Istanbul, Turkey. Whether you are looking for a 1, 2, or 3 bedroom residence, these apartments offer an array of modern amenities and features perfect for singles, couples, and families. Property Features These stylish apartments boast an impressive range of features, including a smart home system, en-suite bathrooms, and breathtaking city views. Enjoy a healthy lifestyle with amenities like a gym, sauna, indoor parking, and easy access to a playground, tennis, volleyball, and basketball courts. Designed to meet the highest standards, residents can also benefit from the massage room, garden, and air conditioning. Location Benefits Located only 0.5 km from the bustling city center and shopping areas, Bagcilar offers the best of both convenience and tranquility in Istanbul. Residents can enjoy the proximity to the city center while being just a 12 km drive from the beach and 32 km away from the airport. Bagcilar is known for its well-developed infrastructure, with a variety of local attractions, schools, and healthcare facilities making it a sought-after destination for both living and investing. Bagcilar is a dynamic district in Istanbul, characterized by a blend of cultural heritage and modern lifestyle. It benefits from excellent transportation links, a thriving local economy, and diverse dining and entertainment options, making it an ideal area for people of all age groups. Make Your Move Today If you are interested in tap into the rich opportunities these apartments offer, dont hesitate to explore further. Contact us today to learn more or to schedule a visit. These apartments are perfect for investment and can also be purchased with installment payments, making them accessible to a wide range of buyers."
    }
  ]
}